*** openvpn-mgmt-codec/src/client.rs:173:9: replace ManagementClient<T>::send_expect_success -> Result<String, ClientError> with Ok(String::new())

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::send_expect_success -> Result<String, ClientError> with Ok(String::new())
@@ -165,21 +165,17 @@
     /// arrives.
     async fn send_and_recv(&mut self, cmd: OvpnCommand) -> Result<OvpnMessage, ClientError> {
         self.framed.send(cmd).await?;
         self.recv_response().await
     }
 
     /// Send a command that expects `SUCCESS:` and return the payload string.
     async fn send_expect_success(&mut self, cmd: OvpnCommand) -> Result<String, ClientError> {
-        match self.send_and_recv(cmd).await? {
-            OvpnMessage::Success(payload) => Ok(payload),
-            OvpnMessage::Error(msg) => Err(ClientError::ServerError(msg)),
-            other => Err(ClientError::UnexpectedResponse(other)),
-        }
+        Ok(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Send a command that expects a multi-line response.
     async fn send_expect_multi_line(
         &mut self,
         cmd: OvpnCommand,
     ) -> Result<Vec<String>, ClientError> {
         match self.send_and_recv(cmd).await? {

---- client::tests::connection_closed_returns_error stdout ----

thread 'client::tests::connection_closed_returns_error' (27432) panicked at openvpn-mgmt-codec\src\client.rs:1223:9:
expected connection error, got ParseResponse(MissingPidPrefix(""))

---- client::tests::load_stats_parsed stdout ----

thread 'client::tests::load_stats_parsed' (24208) panicked at openvpn-mgmt-codec\src\client.rs:716:47:
called `Result::unwrap()` on an `Err` value: ParseResponse(MissingField("nclients"))

---- client::tests::hold_query_parsed stdout ----

thread 'client::tests::hold_query_parsed' (19648) panicked at openvpn-mgmt-codec\src\client.rs:725:43:
called `Result::unwrap()` on an `Err` value: ParseResponse(MissingHoldPrefix(""))

failures:
    client::tests::connection_closed_returns_error
    client::tests::hold_query_parsed
    client::tests::hold_query_returns_false
    client::tests::load_stats_parsed
    client::tests::multiple_notification_subscribers
    client::tests::mute_returns_payload
    client::tests::notifications_forwarded_during_command
    client::tests::pid_returns_parsed_value
    client::tests::pkcs11_id_count_returns_payload
    client::tests::pkcs11_id_get_returns_payload
    client::tests::raw_returns_success_payload
    client::tests::raw_server_error

test result: FAILED. 354 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
