*** openvpn-mgmt-codec/src/client.rs:185:9: replace ManagementClient<T>::send_expect_multi_line -> Result<Vec<String>, ClientError> with Ok(vec![String::new()])

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::send_expect_multi_line -> Result<Vec<String>, ClientError> with Ok(vec![String::new()])
@@ -177,21 +177,17 @@
         }
     }
 
     /// Send a command that expects a multi-line response.
     async fn send_expect_multi_line(
         &mut self,
         cmd: OvpnCommand,
     ) -> Result<Vec<String>, ClientError> {
-        match self.send_and_recv(cmd).await? {
-            OvpnMessage::MultiLine(lines) => Ok(lines),
-            OvpnMessage::Error(msg) => Err(ClientError::ServerError(msg)),
-            other => Err(ClientError::UnexpectedResponse(other)),
-        }
+        Ok(vec![String::new()]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Send a command that expects `SUCCESS:` and discard the payload.
     async fn send_expect_ok(&mut self, cmd: OvpnCommand) -> Result<(), ClientError> {
         self.send_expect_success(cmd).await?;
         Ok(())
     }

---- client::tests::current_state_returns_single_entry stdout ----

thread 'client::tests::current_state_returns_single_entry' (40032) panicked at openvpn-mgmt-codec\src\client.rs:1085:50:
called `Result::unwrap()` on an `Err` value: ParseResponse(StateTooFewFields(1))

---- client::tests::help_returns_lines stdout ----

thread 'client::tests::help_returns_lines' (26480) panicked at openvpn-mgmt-codec\src\client.rs:1021:9:
assertion failed: lines.len() >= 2

---- client::tests::log_all_returns_history stdout ----

thread 'client::tests::log_all_returns_history' (43836) panicked at openvpn-mgmt-codec\src\client.rs:1107:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    client::tests::current_state_returns_single_entry
    client::tests::help_returns_lines
    client::tests::log_all_returns_history
    client::tests::net_returns_lines
    client::tests::raw_multi_line_returns_lines
    client::tests::remote_entry_count_returns_lines
    client::tests::remote_entry_get_returns_lines
    client::tests::state_returns_parsed_entries
    client::tests::state_stream_all_returns_parsed_history
    client::tests::status_raw_returns_lines
    client::tests::unexpected_response_for_multi_line_command

test result: FAILED. 359 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
