*** openvpn-mgmt-codec/src/client.rs:194:9: replace ManagementClient<T>::send_expect_ok -> Result<(), ClientError> with Ok(())

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::send_expect_ok -> Result<(), ClientError> with Ok(())
@@ -186,18 +186,17 @@
             OvpnMessage::MultiLine(lines) => Ok(lines),
             OvpnMessage::Error(msg) => Err(ClientError::ServerError(msg)),
             other => Err(ClientError::UnexpectedResponse(other)),
         }
     }
 
     /// Send a command that expects `SUCCESS:` and discard the payload.
     async fn send_expect_ok(&mut self, cmd: OvpnCommand) -> Result<(), ClientError> {
-        self.send_expect_success(cmd).await?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Send a stream-mode command (`log`, `state`, `echo`).
     ///
     /// History-returning modes produce `Some(lines)`, on/off modes
     /// produce `None`.
     async fn send_stream_command(
         &mut self,

---- client::tests::server_error_maps_to_client_error stdout ----

thread 'client::tests::server_error_maps_to_client_error' (36480) panicked at openvpn-mgmt-codec\src\client.rs:1213:47:
called `Result::unwrap_err()` on an `Ok` value: ()

failures:
    client::tests::server_error_maps_to_client_error

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
