*** openvpn-mgmt-codec/src/client.rs:207:9: replace ManagementClient<T>::send_stream_command -> Result<Option<Vec<String>>, ClientError> with Ok(None)

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::send_stream_command -> Result<Option<Vec<String>>, ClientError> with Ok(None)
@@ -199,22 +199,17 @@
     ///
     /// History-returning modes produce `Some(lines)`, on/off modes
     /// produce `None`.
     async fn send_stream_command(
         &mut self,
         mode: StreamMode,
         cmd: OvpnCommand,
     ) -> Result<Option<Vec<String>>, ClientError> {
-        if mode.returns_history() {
-            Ok(Some(self.send_expect_multi_line(cmd).await?))
-        } else {
-            self.send_expect_ok(cmd).await?;
-            Ok(None)
-        }
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     // --- Public command methods ---
 
     // -- Informational --
 
     /// Query the connection status in the given format.
     ///

---- client::tests::log_all_returns_history stdout ----

thread 'client::tests::log_all_returns_history' (32388) panicked at openvpn-mgmt-codec\src\client.rs:1105:64:
called `Option::unwrap()` on a `None` value

---- client::tests::state_stream_all_returns_parsed_history stdout ----

thread 'client::tests::state_stream_all_returns_parsed_history' (31940) panicked at openvpn-mgmt-codec\src\client.rs:1130:75:
called `Option::unwrap()` on a `None` value

failures:
    client::tests::log_all_returns_history
    client::tests::state_stream_all_returns_parsed_history

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
