*** openvpn-mgmt-codec/src/client.rs:207:9: replace ManagementClient<T>::send_stream_command -> Result<Option<Vec<String>>, ClientError> with Ok(Some(vec!["xyzzy".into()]))

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::send_stream_command -> Result<Option<Vec<String>>, ClientError> with Ok(Some(vec!["xyzzy".into()]))
@@ -199,22 +199,17 @@
     ///
     /// History-returning modes produce `Some(lines)`, on/off modes
     /// produce `None`.
     async fn send_stream_command(
         &mut self,
         mode: StreamMode,
         cmd: OvpnCommand,
     ) -> Result<Option<Vec<String>>, ClientError> {
-        if mode.returns_history() {
-            Ok(Some(self.send_expect_multi_line(cmd).await?))
-        } else {
-            self.send_expect_ok(cmd).await?;
-            Ok(None)
-        }
+        Ok(Some(vec!["xyzzy".into()])) /* ~ changed by cargo-mutants ~ */
     }
 
     // --- Public command methods ---
 
     // -- Informational --
 
     /// Query the connection status in the given format.
     ///

---- client::tests::echo_off_returns_none stdout ----

thread 'client::tests::echo_off_returns_none' (26068) panicked at openvpn-mgmt-codec\src\client.rs:1113:9:
assertion failed: client.echo(StreamMode::Off).await.unwrap().is_none()

---- client::tests::log_all_returns_history stdout ----

thread 'client::tests::log_all_returns_history' (46004) panicked at openvpn-mgmt-codec\src\client.rs:1106:9:
assertion `left == right` failed
  left: 1
 right: 2

---- client::tests::log_on_returns_none stdout ----

thread 'client::tests::log_on_returns_none' (44444) panicked at openvpn-mgmt-codec\src\client.rs:1094:9:
assertion failed: client.log(StreamMode::On).await.unwrap().is_none()

failures:
    client::tests::echo_off_returns_none
    client::tests::log_all_returns_history
    client::tests::log_on_returns_none
    client::tests::state_stream_all_returns_parsed_history
    client::tests::state_stream_on_returns_none

test result: FAILED. 356 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
