*** openvpn-mgmt-codec/src/client.rs:224:9: replace ManagementClient<T>::status_raw -> Result<Vec<String>, ClientError> with Ok(vec![])

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::status_raw -> Result<Vec<String>, ClientError> with Ok(vec![])
@@ -216,18 +216,17 @@
 
     // -- Informational --
 
     /// Query the connection status in the given format.
     ///
     /// Returns the raw multi-line response. Use [`status`](Self::status)
     /// for a typed result.
     pub async fn status_raw(&mut self, format: StatusFormat) -> Result<Vec<String>, ClientError> {
-        self.send_expect_multi_line(OvpnCommand::Status(format))
-            .await
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Query and parse the server-mode connection status.
     pub async fn status(&mut self, format: StatusFormat) -> Result<StatusResponse, ClientError> {
         let lines = self.status_raw(format).await?;
         Ok(status::parse_status(&lines)?)
     }

---- client::tests::status_raw_returns_lines stdout ----

thread 'client::tests::status_raw_returns_lines' (35452) panicked at openvpn-mgmt-codec\src\client.rs:1010:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    client::tests::status_raw_returns_lines

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
