*** openvpn-mgmt-codec/src/codec.rs:1251:44: replace & with ^ in parse_password

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace & with ^ in parse_password
@@ -1243,17 +1243,17 @@
         // Static challenge: SC:flag,challenge_text
         // flag is a multi-bit integer: bit 0 = ECHO, bit 1 = FORMAT/CONCAT
         if let Some(sc) = after_up.strip_prefix("SC:") {
             let (flag_str, challenge) = sc.split_once(',')?;
             let flags: u32 = parse_field(flag_str, "static challenge flags")?;
             return Some(Notification::Password(
                 PasswordNotification::StaticChallenge {
                     echo: flags & 1 != 0,
-                    response_concat: flags & 2 != 0,
+                    response_concat: flags ^ /* ~ changed by cargo-mutants ~ */ 2 != 0,
                     challenge: challenge.to_string(),
                 },
             ));
         }
 
         // Plain username/password request
         return Some(Notification::Password(PasswordNotification::NeedAuth {
             auth_type: parse_auth_type(auth_type_str),

---- password_static_challenge_echo_and_concat_flags stdout ----

thread 'password_static_challenge_echo_and_concat_flags' (33732) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:343:9:
assertion failed: !response_concat

failures:
    password_static_challenge_echo_and_concat_flags

test result: FAILED. 58 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
