*** openvpn-mgmt-codec/src/codec.rs:1251:48: replace != with == in parse_password

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace != with == in parse_password
@@ -1243,17 +1243,17 @@
         // Static challenge: SC:flag,challenge_text
         // flag is a multi-bit integer: bit 0 = ECHO, bit 1 = FORMAT/CONCAT
         if let Some(sc) = after_up.strip_prefix("SC:") {
             let (flag_str, challenge) = sc.split_once(',')?;
             let flags: u32 = parse_field(flag_str, "static challenge flags")?;
             return Some(Notification::Password(
                 PasswordNotification::StaticChallenge {
                     echo: flags & 1 != 0,
-                    response_concat: flags & 2 != 0,
+                    response_concat: flags & 2 == /* ~ changed by cargo-mutants ~ */ 0,
                     challenge: challenge.to_string(),
                 },
             ));
         }
 
         // Plain username/password request
         return Some(Notification::Password(PasswordNotification::NeedAuth {
             auth_type: parse_auth_type(auth_type_str),

---- real_world::static_challenge_flag_3_echo_and_concat stdout ----

thread 'real_world::static_challenge_flag_3_echo_and_concat' (43336) panicked at openvpn-mgmt-codec\tests\defensive\real_world.rs:1535:13:
bit 1 should be set for flag=3

failures:
    real_world::static_challenge_flag_3_echo_and_concat

test result: FAILED. 132 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
