*** openvpn-mgmt-codec/src/codec.rs:963:13: delete match arm "PASSWORD" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "PASSWORD" in OvpnCodec::parse_notification
@@ -955,17 +955,17 @@
             "INFOMSG" => Some(Notification::InfoMsg {
                 extra: payload.to_string(),
             }),
             "NEED-CERTIFICATE" => Some(Notification::NeedCertificate {
                 hint: payload.to_string(),
             }),
             "REMOTE" => parse_remote(payload),
             "PROXY" => parse_proxy(payload),
-            "PASSWORD" => parse_password(payload),
+             /* ~ changed by cargo-mutants ~ */
             "PKCS11ID-ENTRY" => {
                 return parse_pkcs11id_entry_notif(payload).or_else(|| {
                     Some(OvpnMessage::Notification(Notification::Simple {
                         kind: kind.to_string(),
                         payload: payload.to_string(),
                     }))
                 });
             }

---- codec::tests::decode_password_notification stdout ----

thread 'codec::tests::decode_password_notification' (7412) panicked at openvpn-mgmt-codec\src\codec.rs:1800:9:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::Password(PasswordNotification::NeedAuth
    { auth_type: AuthType::Auth, })))

failures:
    codec::tests::decode_password_notification

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
