*** openvpn-mgmt-codec/src/client.rs:245:9: replace ManagementClient<T>::state -> Result<Vec<StateEntry>, ClientError> with Ok(vec![])

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::state -> Result<Vec<StateEntry>, ClientError> with Ok(vec![])
@@ -237,18 +237,17 @@
         format: StatusFormat,
     ) -> Result<ClientStatistics, ClientError> {
         let lines = self.status_raw(format).await?;
         Ok(status::parse_client_statistics(&lines)?)
     }
 
     /// Query the current state as a multi-line history.
     pub async fn state(&mut self) -> Result<Vec<StateEntry>, ClientError> {
-        let lines = self.send_expect_multi_line(OvpnCommand::State).await?;
-        Ok(parsed_response::parse_state_history(&lines)?)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Query the most recent state entry.
     pub async fn current_state(&mut self) -> Result<StateEntry, ClientError> {
         let lines = self.send_expect_multi_line(OvpnCommand::State).await?;
         Ok(parsed_response::parse_current_state(&lines)?)
     }

---- client::tests::state_returns_parsed_entries stdout ----

thread 'client::tests::state_returns_parsed_entries' (41948) panicked at openvpn-mgmt-codec\src\client.rs:1074:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    client::tests::state_returns_parsed_entries

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
