*** openvpn-mgmt-codec/src/client.rs:263:9: replace ManagementClient<T>::state_stream -> Result<Option<Vec<StateEntry>>, ClientError> with Ok(None)

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::state_stream -> Result<Option<Vec<StateEntry>>, ClientError> with Ok(None)
@@ -255,23 +255,17 @@
     /// Control real-time state notifications.
     ///
     /// Streaming modes (`All`, `OnAll`, `Recent`) return accumulated history
     /// lines. `On`/`Off` return `Ok(None)`.
     pub async fn state_stream(
         &mut self,
         mode: StreamMode,
     ) -> Result<Option<Vec<StateEntry>>, ClientError> {
-        match self
-            .send_stream_command(mode, OvpnCommand::StateStream(mode))
-            .await?
-        {
-            Some(lines) => Ok(Some(parsed_response::parse_state_history(&lines)?)),
-            None => Ok(None),
-        }
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Query the OpenVPN and management interface version.
     pub async fn version(&mut self) -> Result<VersionInfo, ClientError> {
         let lines = self.send_expect_multi_line(OvpnCommand::Version).await?;
         Ok(parsed_response::parse_version(&lines))
     }

---- client::tests::state_stream_all_returns_parsed_history stdout ----

thread 'client::tests::state_stream_all_returns_parsed_history' (9100) panicked at openvpn-mgmt-codec\src\client.rs:1129:75:
called `Option::unwrap()` on a `None` value

failures:
    client::tests::state_stream_all_returns_parsed_history

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
