*** openvpn-mgmt-codec/src/command.rs:717:13: delete match arm "password" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "password" in <impl FromStr for OvpnCommand>::from_str
@@ -709,31 +709,17 @@
                     auth_type: auth_type_str
                         .parse()
                         .inspect_err(|error| warn!(%error, "unknown auth type"))
                         .unwrap_or(AuthType::Unknown(auth_type_str)),
                     value: value.into(),
                 })
             }
 
-            "password" => {
-                let (auth_type_str, rest) = next_token(args).ok_or(
-                    CommandParseError::MissingArgs("usage: password <auth-type> <value>"),
-                )?;
-                let (value, _) = next_token(rest).ok_or(CommandParseError::MissingArgs(
-                    "usage: password <auth-type> <value>",
-                ))?;
-                Ok(Self::Password {
-                    auth_type: auth_type_str
-                        .parse()
-                        .inspect_err(|error| warn!(%error, "unknown auth type"))
-                        .unwrap_or(AuthType::Unknown(auth_type_str)),
-                    value: value.into(),
-                })
-            }
+             /* ~ changed by cargo-mutants ~ */
 
             "auth-retry" => Ok(Self::AuthRetry(args.parse::<AuthRetryMode>()?)),
 
             "forget-passwords" => Ok(Self::ForgetPasswords),
 
             // --- Interactive prompts ---
             "needok" => {
                 let (name, resp) =

---- command::tests::parse_password stdout ----

thread 'command::tests::parse_password' (41524) panicked at openvpn-mgmt-codec\src\command.rs:1440:9:
assertion `left == right` failed
  left: Raw("password Auth s3cret")
 right: Password { auth_type: Auth, value: <redacted> }

---- command::tests::parse_password_quoted_http_proxy stdout ----

thread 'command::tests::parse_password_quoted_http_proxy' (34988) panicked at openvpn-mgmt-codec\src\command.rs:1763:9:
assertion `left == right` failed
  left: Raw("password \"HTTP Proxy\" \"proxypass\"")
 right: Password { auth_type: HttpProxy, value: <redacted> }

---- command::tests::parse_password_quoted_spaced_auth_type stdout ----

thread 'command::tests::parse_password_quoted_spaced_auth_type' (32248) panicked at openvpn-mgmt-codec\src\command.rs:1751:9:
assertion `left == right` failed
  left: Raw("password \"Private Key\" \"s3cret\"")
 right: Password { auth_type: PrivateKey, value: <redacted> }

failures:
    command::tests::parse_password
    command::tests::parse_password_missing_value_is_err
    command::tests::parse_password_quoted_http_proxy
    command::tests::parse_password_quoted_socks_proxy
    command::tests::parse_password_quoted_spaced_auth_type
    command::tests::parse_password_roundtrip_spaced_auth_types
    command::tests::parse_password_unknown_auth_type_falls_back

test result: FAILED. 356 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
