*** openvpn-mgmt-codec/src/client.rs:263:9: replace ManagementClient<T>::state_stream -> Result<Option<Vec<StateEntry>>, ClientError> with Ok(Some(vec![]))

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::state_stream -> Result<Option<Vec<StateEntry>>, ClientError> with Ok(Some(vec![]))
@@ -255,23 +255,17 @@
     /// Control real-time state notifications.
     ///
     /// Streaming modes (`All`, `OnAll`, `Recent`) return accumulated history
     /// lines. `On`/`Off` return `Ok(None)`.
     pub async fn state_stream(
         &mut self,
         mode: StreamMode,
     ) -> Result<Option<Vec<StateEntry>>, ClientError> {
-        match self
-            .send_stream_command(mode, OvpnCommand::StateStream(mode))
-            .await?
-        {
-            Some(lines) => Ok(Some(parsed_response::parse_state_history(&lines)?)),
-            None => Ok(None),
-        }
+        Ok(Some(vec![])) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Query the OpenVPN and management interface version.
     pub async fn version(&mut self) -> Result<VersionInfo, ClientError> {
         let lines = self.send_expect_multi_line(OvpnCommand::Version).await?;
         Ok(parsed_response::parse_version(&lines))
     }

---- client::tests::state_stream_all_returns_parsed_history stdout ----

thread 'client::tests::state_stream_all_returns_parsed_history' (30300) panicked at openvpn-mgmt-codec\src\client.rs:1130:9:
assertion `left == right` failed
  left: 0
 right: 1

---- client::tests::state_stream_on_returns_none stdout ----

thread 'client::tests::state_stream_on_returns_none' (43520) panicked at openvpn-mgmt-codec\src\client.rs:1119:9:
assertion failed: client.state_stream(StreamMode::On).await.unwrap().is_none()

failures:
    client::tests::state_stream_all_returns_parsed_history
    client::tests::state_stream_on_returns_none

test result: FAILED. 368 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
