*** openvpn-mgmt-codec/src/command.rs:733:13: delete match arm "auth-retry" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "auth-retry" in <impl FromStr for OvpnCommand>::from_str
@@ -725,17 +725,17 @@
                     auth_type: auth_type_str
                         .parse()
                         .inspect_err(|error| warn!(%error, "unknown auth type"))
                         .unwrap_or(AuthType::Unknown(auth_type_str)),
                     value: value.into(),
                 })
             }
 
-            "auth-retry" => Ok(Self::AuthRetry(args.parse::<AuthRetryMode>()?)),
+             /* ~ changed by cargo-mutants ~ */
 
             "forget-passwords" => Ok(Self::ForgetPasswords),
 
             // --- Interactive prompts ---
             "needok" => {
                 let (name, resp) =
                     args.rsplit_once(char::is_whitespace)
                         .ok_or(CommandParseError::MissingArgs(

---- command::tests::parse_auth_retry stdout ----

thread 'command::tests::parse_auth_retry' (15700) panicked at openvpn-mgmt-codec\src\command.rs:1471:9:
assertion `left == right` failed
  left: Ok(Raw("auth-retry none"))
 right: Ok(AuthRetry(None))

failures:
    command::tests::parse_auth_retry

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
