*** openvpn-mgmt-codec/src/command.rs:735:13: delete match arm "forget-passwords" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "forget-passwords" in <impl FromStr for OvpnCommand>::from_str
@@ -727,17 +727,17 @@
                         .inspect_err(|error| warn!(%error, "unknown auth type"))
                         .unwrap_or(AuthType::Unknown(auth_type_str)),
                     value: value.into(),
                 })
             }
 
             "auth-retry" => Ok(Self::AuthRetry(args.parse::<AuthRetryMode>()?)),
 
-            "forget-passwords" => Ok(Self::ForgetPasswords),
+             /* ~ changed by cargo-mutants ~ */
 
             // --- Interactive prompts ---
             "needok" => {
                 let (name, resp) =
                     args.rsplit_once(char::is_whitespace)
                         .ok_or(CommandParseError::MissingArgs(
                             "usage: needok <name> ok|cancel",
                         ))?;

---- command::tests::parse_simple_commands stdout ----

thread 'command::tests::parse_simple_commands' (12232) panicked at openvpn-mgmt-codec\src\command.rs:1240:9:
assertion `left == right` failed
  left: Ok(Raw("forget-passwords"))
 right: Ok(ForgetPasswords)

failures:
    command::tests::parse_simple_commands

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
