*** openvpn-mgmt-codec/src/command.rs:786:13: delete match arm "client-auth" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "client-auth" in <impl FromStr for OvpnCommand>::from_str
@@ -778,45 +778,17 @@
             "pkcs11-id-get" => args.parse::<u32>().map(Self::Pkcs11IdGet).map_err(|_| {
                 CommandParseError::InvalidNumber {
                     field: "pkcs11-id-get index",
                     input: args.to_string(),
                 }
             }),
 
             // --- Client management (server mode) ---
-            "client-auth" => {
-                let mut parts = args.splitn(3, char::is_whitespace);
-                let cid = parts
-                    .next()
-                    .ok_or(CommandParseError::MissingArgs(
-                        "usage: client-auth <cid> <kid> [config-lines]",
-                    ))?
-                    .parse::<u64>()
-                    .map_err(|_| CommandParseError::MissingArgs("cid must be a number"))?;
-                let kid = parts
-                    .next()
-                    .ok_or(CommandParseError::MissingArgs(
-                        "usage: client-auth <cid> <kid> [config-lines]",
-                    ))?
-                    .parse::<u64>()
-                    .map_err(|_| CommandParseError::MissingArgs("kid must be a number"))?;
-                let config_lines = match parts.next() {
-                    Some(rest) => rest
-                        .split(',')
-                        .map(|line| line.trim().to_string())
-                        .collect(),
-                    None => vec![],
-                };
-                Ok(Self::ClientAuth {
-                    cid,
-                    kid,
-                    config_lines,
-                })
-            }
+             /* ~ changed by cargo-mutants ~ */
 
             "client-auth-nt" => {
                 let (cid_s, kid_s) =
                     args.split_once(char::is_whitespace)
                         .ok_or(CommandParseError::MissingArgs(
                             "usage: client-auth-nt <cid> <kid>",
                         ))?;
                 Ok(Self::ClientAuthNt {

---- command::tests::parse_client_auth_non_numeric_kid stdout ----

thread 'command::tests::parse_client_auth_non_numeric_kid' (39624) panicked at openvpn-mgmt-codec\src\command.rs:1815:9:
assertion failed: "client-auth 1 abc".parse::<OvpnCommand>().is_err()

---- command::tests::parse_client_auth_non_numeric_cid stdout ----

thread 'command::tests::parse_client_auth_non_numeric_cid' (42800) panicked at openvpn-mgmt-codec\src\command.rs:1810:9:
assertion failed: "client-auth abc 1".parse::<OvpnCommand>().is_err()

---- command::tests::parse_client_auth stdout ----

thread 'command::tests::parse_client_auth' (31524) panicked at openvpn-mgmt-codec\src\command.rs:1504:9:
assertion `left == right` failed
  left: Ok(Raw("client-auth 42 7"))
 right: Ok(ClientAuth { cid: 42, kid: 7, config_lines: [] })

failures:
    command::tests::parse_client_auth
    command::tests::parse_client_auth_non_numeric_cid
    command::tests::parse_client_auth_non_numeric_kid
    command::tests::parse_client_auth_with_config

test result: FAILED. 359 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
