*** openvpn-mgmt-codec/src/command.rs:816:13: delete match arm "client-auth-nt" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "client-auth-nt" in <impl FromStr for OvpnCommand>::from_str
@@ -808,32 +808,17 @@
                 };
                 Ok(Self::ClientAuth {
                     cid,
                     kid,
                     config_lines,
                 })
             }
 
-            "client-auth-nt" => {
-                let (cid_s, kid_s) =
-                    args.split_once(char::is_whitespace)
-                        .ok_or(CommandParseError::MissingArgs(
-                            "usage: client-auth-nt <cid> <kid>",
-                        ))?;
-                Ok(Self::ClientAuthNt {
-                    cid: cid_s
-                        .parse()
-                        .map_err(|_| CommandParseError::MissingArgs("cid must be a number"))?,
-                    kid: kid_s
-                        .trim()
-                        .parse()
-                        .map_err(|_| CommandParseError::MissingArgs("kid must be a number"))?,
-                })
-            }
+             /* ~ changed by cargo-mutants ~ */
 
             // Wire format per management-notes.txt:
             //   client-deny <cid> <kid> "reason" ["client-reason"]
             // Reason strings are quoted+escaped on the wire.
             // https://github.com/OpenVPN/openvpn/blob/master/doc/management-notes.txt
             "client-deny" => {
                 let (cid_str, rest) = next_token(args).ok_or(CommandParseError::MissingArgs(
                     "usage: client-deny <cid> <kid> <reason> [client-reason]",

---- command::tests::parse_client_auth_nt stdout ----

thread 'command::tests::parse_client_auth_nt' (18428) panicked at openvpn-mgmt-codec\src\command.rs:1547:9:
assertion `left == right` failed
  left: Ok(Raw("client-auth-nt 5 3"))
 right: Ok(ClientAuthNt { cid: 5, kid: 3 })

---- command::tests::parse_client_auth_nt_non_numeric_kid stdout ----

thread 'command::tests::parse_client_auth_nt_non_numeric_kid' (30088) panicked at openvpn-mgmt-codec\src\command.rs:1833:9:
assertion failed: "client-auth-nt 1 abc".parse::<OvpnCommand>().is_err()

failures:
    command::tests::parse_client_auth_nt
    command::tests::parse_client_auth_nt_non_numeric_kid

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
