*** openvpn-mgmt-codec/src/command.rs:998:13: delete match arm "client-pending-auth" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "client-pending-auth" in <impl FromStr for OvpnCommand>::from_str
@@ -990,49 +990,17 @@
                 ))?;
                 Ok(Self::PushUpdateCid { cid, options })
             }
 
             // --- Extended client management ---
             // Wire format per management-notes.txt:
             //   client-pending-auth <cid> <kid> <extra> <timeout>
             // https://github.com/OpenVPN/openvpn/blob/master/doc/management-notes.txt
-            "client-pending-auth" => {
-                let (cid_str, rest) = next_token(args).ok_or(CommandParseError::MissingArgs(
-                    "usage: client-pending-auth <cid> <kid> <extra> <timeout>",
-                ))?;
-                let cid = cid_str
-                    .parse::<u64>()
-                    .map_err(|_| CommandParseError::MissingArgs("cid must be a number"))?;
-                let (kid_str, rest) = next_token(rest).ok_or(CommandParseError::MissingArgs(
-                    "usage: client-pending-auth <cid> <kid> <extra> <timeout>",
-                ))?;
-                let kid = kid_str
-                    .parse::<u64>()
-                    .map_err(|_| CommandParseError::MissingArgs("kid must be a number"))?;
-                let (extra, rest) = next_token(rest).ok_or(CommandParseError::MissingArgs(
-                    "usage: client-pending-auth <cid> <kid> <extra> <timeout>",
-                ))?;
-                let (timeout_str, _) = next_token(rest).ok_or(CommandParseError::MissingArgs(
-                    "usage: client-pending-auth <cid> <kid> <extra> <timeout>",
-                ))?;
-                let timeout =
-                    timeout_str
-                        .parse::<u32>()
-                        .map_err(|_| CommandParseError::InvalidNumber {
-                            field: "client-pending-auth timeout",
-                            input: timeout_str,
-                        })?;
-                Ok(Self::ClientPendingAuth {
-                    cid,
-                    kid,
-                    extra,
-                    timeout,
-                })
-            }
+             /* ~ changed by cargo-mutants ~ */
 
             // Wire format per management-notes.txt:
             //   cr-response <base64-response>
             // https://github.com/OpenVPN/openvpn/blob/master/doc/management-notes.txt
             "cr-response" => {
                 let (response, _) = next_token(args).ok_or(CommandParseError::MissingArgs(
                     "usage: cr-response <response>",
                 ))?;

---- command::tests::parse_client_pending_auth stdout ----

thread 'command::tests::parse_client_pending_auth' (3260) panicked at openvpn-mgmt-codec\src\command.rs:1952:9:
assertion `left == right` failed
  left: Raw("client-pending-auth 42 1 WEB_AUTH::https://example.com 120")
 right: ClientPendingAuth { cid: 42, kid: 1, extra: "WEB_AUTH::https://example.com", timeout: 120 }

---- command::tests::parse_client_pending_auth_missing_args stdout ----

thread 'command::tests::parse_client_pending_auth_missing_args' (6532) panicked at openvpn-mgmt-codec\src\command.rs:1965:9:
assertion failed: "client-pending-auth".parse::<OvpnCommand>().is_err()

---- command::tests::parse_client_pending_auth_non_numeric stdout ----

thread 'command::tests::parse_client_pending_auth_non_numeric' (47120) panicked at openvpn-mgmt-codec\src\command.rs:1977:9:
assertion failed: "client-pending-auth abc 1 extra 120".parse::<OvpnCommand>().is_err()

failures:
    command::tests::parse_client_pending_auth
    command::tests::parse_client_pending_auth_missing_args
    command::tests::parse_client_pending_auth_non_numeric

test result: FAILED. 360 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.39s

*** result: Failure(101)
