*** openvpn-mgmt-codec/src/client.rs:294:9: replace ManagementClient<T>::pid -> Result<u32, ClientError> with Ok(0)

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::pid -> Result<u32, ClientError> with Ok(0)
@@ -286,18 +286,17 @@
             Ok(())
         } else {
             self.send_expect_ok(cmd).await
         }
     }
 
     /// Query the PID of the OpenVPN process.
     pub async fn pid(&mut self) -> Result<u32, ClientError> {
-        let payload = self.send_expect_success(OvpnCommand::Pid).await?;
-        Ok(parsed_response::parse_pid(&payload)?)
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
 
     /// List available management commands.
     pub async fn help(&mut self) -> Result<Vec<String>, ClientError> {
         self.send_expect_multi_line(OvpnCommand::Help).await
     }
 
     /// Query or set the log verbosity level.

---- client::tests::connection_closed_returns_error stdout ----

thread 'client::tests::connection_closed_returns_error' (41600) panicked at openvpn-mgmt-codec\src\client.rs:1225:38:
called `Result::unwrap_err()` on an `Ok` value: 0

---- client::tests::multiple_notification_subscribers stdout ----

thread 'client::tests::multiple_notification_subscribers' (31148) panicked at openvpn-mgmt-codec\src\client.rs:1202:9:
assertion `left == right` failed
  left: 0
 right: 1

---- client::tests::notifications_forwarded_during_command stdout ----

thread 'client::tests::notifications_forwarded_during_command' (24316) panicked at openvpn-mgmt-codec\src\client.rs:1180:9:
assertion `left == right` failed
  left: 0
 right: 99

failures:
    client::tests::connection_closed_returns_error
    client::tests::multiple_notification_subscribers
    client::tests::notifications_forwarded_during_command
    client::tests::parse_error_for_malformed_pid
    client::tests::pid_returns_parsed_value
    client::tests::unexpected_response_for_success_command

test result: FAILED. 364 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
