*** openvpn-mgmt-codec/src/message.rs:319:9: replace <impl fmt::Debug for RedactedEnv<'_>>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- openvpn-mgmt-codec/src/message.rs
+++ replace <impl fmt::Debug for RedactedEnv<'_>>::fmt -> fmt::Result with Ok(Default::default())
@@ -311,25 +311,17 @@
 
 /// Helper for Debug output: displays env entries, masking sensitive keys.
 /// Constructed by `derive_more::Debug` on [`Notification::Client::env`].
 #[allow(dead_code)] // used via derive_more::Debug attribute
 struct RedactedEnv<'a>(&'a BTreeMap<String, String>);
 
 impl fmt::Debug for RedactedEnv<'_> {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        f.debug_map()
-            .entries(self.0.iter().map(|(k, v)| {
-                if SENSITIVE_ENV_KEYS.contains(&k.as_str()) {
-                    (k.as_str(), "<redacted>")
-                } else {
-                    (k.as_str(), v.as_str())
-                }
-            }))
-            .finish()
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::transport_protocol::TransportProtocol;
     // --- Debug redaction ---

---- message::tests::debug_does_not_redact_non_sensitive_keys stdout ----

thread 'message::tests::debug_does_not_redact_non_sensitive_keys' (31944) panicked at openvpn-mgmt-codec\src\message.rs:361:9:
assertion failed: dbg.contains("10.0.0.1")

---- message::tests::debug_redacts_password_env_key stdout ----

thread 'message::tests::debug_redacts_password_env_key' (45792) panicked at openvpn-mgmt-codec\src\message.rs:341:9:
non-sensitive values should appear

failures:
    message::tests::debug_does_not_redact_non_sensitive_keys
    message::tests::debug_redacts_password_env_key

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
