*** openvpn-mgmt-codec/src/redacted.rs:40:9: replace Redacted::expose -> &str with ""

*** mutation diff:
--- openvpn-mgmt-codec/src/redacted.rs
+++ replace Redacted::expose -> &str with ""
@@ -32,17 +32,17 @@
     }
 
     /// Access the inner value.
     ///
     /// Use this when you genuinely need the raw string, for instance when
     /// encoding it onto the wire. Avoid passing the result to logging or
     /// display formatting.
     pub fn expose(&self) -> &str {
-        &self.0
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Consume the wrapper and return the inner string.
     pub fn into_inner(self) -> String {
         self.0
     }
 }

---- codec::tests::encode_password_escaping stdout ----
2026-03-29T11:11:28.456101Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=password expected=SuccessOrError queue_depth=1

thread 'codec::tests::encode_password_escaping' (9620) panicked at openvpn-mgmt-codec\src\codec.rs:1369:9:
assertion `left == right` failed
  left: "password \"Private Key\" \"\"\n"
 right: "password \"Private Key\" \"foo\\\\\\\"bar\"\n"

---- codec::tests::encode_password_simple stdout ----
2026-03-29T11:11:28.456244Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=password expected=SuccessOrError queue_depth=1

thread 'codec::tests::encode_password_simple' (40228) panicked at openvpn-mgmt-codec\src\codec.rs:1378:9:
assertion `left == right` failed
  left: "password \"Auth\" \"\"\n"
 right: "password \"Auth\" \"hunter2\"\n"

---- command::tests::parse_password_roundtrip_spaced_auth_types stdout ----
2026-03-29T11:11:28.463348Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=password expected=SuccessOrError queue_depth=1

thread 'command::tests::parse_password_roundtrip_spaced_auth_types' (11052) panicked at openvpn-mgmt-codec\src\command.rs:1832:13:
assertion `left == right` failed
  left: Password { auth_type: PrivateKey, value: <redacted> }
 right: Password { auth_type: PrivateKey, value: <redacted> }

failures:
    codec::tests::encode_password_escaping
    codec::tests::encode_password_simple
    command::tests::parse_password_roundtrip_spaced_auth_types
    redacted::tests::expose_returns_inner
    redacted::tests::from_str
    redacted::tests::from_string

test result: FAILED. 355 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
