*** openvpn-mgmt-codec/src/client.rs:300:9: replace ManagementClient<T>::help -> Result<Vec<String>, ClientError> with Ok(vec![String::new()])

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::help -> Result<Vec<String>, ClientError> with Ok(vec![String::new()])
@@ -292,17 +292,17 @@
     /// Query the PID of the OpenVPN process.
     pub async fn pid(&mut self) -> Result<u32, ClientError> {
         let payload = self.send_expect_success(OvpnCommand::Pid).await?;
         Ok(parsed_response::parse_pid(&payload)?)
     }
 
     /// List available management commands.
     pub async fn help(&mut self) -> Result<Vec<String>, ClientError> {
-        self.send_expect_multi_line(OvpnCommand::Help).await
+        Ok(vec![String::new()]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Query or set the log verbosity level.
     pub async fn verb(&mut self, level: Option<u8>) -> Result<String, ClientError> {
         self.send_expect_success(OvpnCommand::Verb(level)).await
     }
 
     /// Query or set the mute threshold.

---- client::tests::help_returns_lines stdout ----

thread 'client::tests::help_returns_lines' (24100) panicked at openvpn-mgmt-codec\src\client.rs:1025:9:
assertion failed: lines.len() >= 2

---- client::tests::unexpected_response_for_multi_line_command stdout ----

thread 'client::tests::unexpected_response_for_multi_line_command' (17268) panicked at openvpn-mgmt-codec\src\client.rs:1248:39:
called `Result::unwrap_err()` on an `Ok` value: [""]

failures:
    client::tests::help_returns_lines
    client::tests::unexpected_response_for_multi_line_command

test result: FAILED. 368 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
