*** openvpn-mgmt-codec/src/redacted.rs:45:9: replace Redacted::into_inner -> String with "xyzzy".into()

*** mutation diff:
--- openvpn-mgmt-codec/src/redacted.rs
+++ replace Redacted::into_inner -> String with "xyzzy".into()
@@ -37,17 +37,17 @@
     /// encoding it onto the wire. Avoid passing the result to logging or
     /// display formatting.
     pub fn expose(&self) -> &str {
         &self.0
     }
 
     /// Consume the wrapper and return the inner string.
     pub fn into_inner(self) -> String {
-        self.0
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<String> for Redacted {
     fn from(s: String) -> Self {
         Self(s)
     }
 }

---- redacted::tests::into_inner_returns_owned stdout ----

thread 'redacted::tests::into_inner_returns_owned' (2704) panicked at openvpn-mgmt-codec\src\redacted.rs:86:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "pass"

failures:
    redacted::tests::into_inner_returns_owned

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
