*** openvpn-mgmt-codec/src/status.rs:529:13: delete match arm "Auth read bytes" in parse_client_statistics

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ delete match arm "Auth read bytes" in parse_client_statistics
@@ -521,20 +521,17 @@
             "TCP/UDP read bytes" => {
                 stats.tcp_udp_read_bytes = parse_u64(val, "tcp_udp_read_bytes")?;
                 found_tcp_read = true;
             }
             "TCP/UDP write bytes" => {
                 stats.tcp_udp_write_bytes = parse_u64(val, "tcp_udp_write_bytes")?;
                 found_tcp_write = true;
             }
-            "Auth read bytes" => {
-                stats.auth_read_bytes = parse_u64(val, "auth_read_bytes")?;
-                found_auth_read = true;
-            }
+             /* ~ changed by cargo-mutants ~ */
             "pre-compress bytes" => {
                 stats.pre_compress_bytes = Some(parse_u64(val, "pre_compress_bytes")?);
             }
             "post-compress bytes" => {
                 stats.post_compress_bytes = Some(parse_u64(val, "post_compress_bytes")?);
             }
             "pre-decompress bytes" => {
                 stats.pre_decompress_bytes = Some(parse_u64(val, "pre_decompress_bytes")?);

---- status::tests::client_statistics_basic stdout ----

thread 'status::tests::client_statistics_basic' (47936) panicked at openvpn-mgmt-codec\src\status.rs:738:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("Auth read bytes")

---- status::tests::client_statistics_with_compression stdout ----

thread 'status::tests::client_statistics_with_compression' (47072) panicked at openvpn-mgmt-codec\src\status.rs:754:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("Auth read bytes")

failures:
    status::tests::client_statistics_basic
    status::tests::client_statistics_with_compression

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
