*** openvpn-mgmt-ui/src/completions.rs:186:5: replace fuzzy_match -> Vec<&'static CommandEntry> with vec![]

*** mutation diff:
--- openvpn-mgmt-ui/src/completions.rs
+++ replace fuzzy_match -> Vec<&'static CommandEntry> with vec![]
@@ -178,42 +178,17 @@
     },
 ];
 
 /// Return catalog entries whose name fuzzy-matches `query`, sorted by
 /// nucleo score (best match first).
 ///
 /// An empty query returns every entry in catalog order.
 pub(crate) fn fuzzy_match(query: &str) -> Vec<&'static CommandEntry> {
-    if query.is_empty() {
-        return CATALOG.iter().collect();
-    }
-
-    let mut matcher = Matcher::new(Config::DEFAULT);
-    let pattern = Pattern::new(
-        query,
-        CaseMatching::Smart,
-        Normalization::Smart,
-        AtomKind::Fuzzy,
-    );
-
-    let mut scored: Vec<_> = CATALOG
-        .iter()
-        .filter_map(|entry| {
-            let mut buf = Vec::new();
-            let haystack = Utf32Str::new(entry.name, &mut buf);
-            let score = pattern.score(haystack, &mut matcher)?;
-            Some((entry, score))
-        })
-        .collect();
-
-    // Sort descending by score (highest = best match first).
-    scored.sort_by_key(|&(_, score)| std::cmp::Reverse(score));
-
-    scored.into_iter().map(|(entry, _)| entry).collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn empty_query_returns_all() {

---- completions::tests::exact_match_ranks_first stdout ----

thread 'completions::tests::exact_match_ranks_first' (38832) panicked at openvpn-mgmt-ui\src\completions.rs:231:36:
called `Option::unwrap()` on a `None` value

---- completions::tests::fuzzy_across_hyphen stdout ----

thread 'completions::tests::fuzzy_across_hyphen' (2116) panicked at openvpn-mgmt-ui\src\completions.rs:207:9:
assertion failed: results.iter().any(|entry| entry.name == "client-deny")

---- completions::tests::prefix_match stdout ----

thread 'completions::tests::prefix_match' (24540) panicked at openvpn-mgmt-ui\src\completions.rs:201:9:
assertion failed: results.first().is_some_and(|entry| entry.name == "version")

failures:
    completions::tests::empty_query_returns_all
    completions::tests::exact_match_ranks_first
    completions::tests::fuzzy_across_hyphen
    completions::tests::prefix_match
    completions::tests::word_boundary_bonus

test result: FAILED. 19 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
