*** openvpn-mgmt-codec/src/client.rs:305:9: replace ManagementClient<T>::verb -> Result<String, ClientError> with Ok("xyzzy".into())

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::verb -> Result<String, ClientError> with Ok("xyzzy".into())
@@ -297,17 +297,17 @@
 
     /// List available management commands.
     pub async fn help(&mut self) -> Result<Vec<String>, ClientError> {
         self.send_expect_multi_line(OvpnCommand::Help).await
     }
 
     /// Query or set the log verbosity level.
     pub async fn verb(&mut self, level: Option<u8>) -> Result<String, ClientError> {
-        self.send_expect_success(OvpnCommand::Verb(level)).await
+        Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Query or set the mute threshold.
     pub async fn mute(&mut self, threshold: Option<u32>) -> Result<String, ClientError> {
         self.send_expect_success(OvpnCommand::Mute(threshold)).await
     }
 
     /// (Windows) Show network adapter list.

---- client::tests::verb_query_returns_payload stdout ----

thread 'client::tests::verb_query_returns_payload' (33584) panicked at openvpn-mgmt-codec\src\client.rs:960:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "verb=3"

---- client::tests::verb_set_returns_payload stdout ----

thread 'client::tests::verb_set_returns_payload' (41496) panicked at openvpn-mgmt-codec\src\client.rs:966:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "verb level changed"

failures:
    client::tests::verb_query_returns_payload
    client::tests::verb_set_returns_payload

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
