*** openvpn-mgmt-codec/src/client.rs:310:9: replace ManagementClient<T>::mute -> Result<String, ClientError> with Ok("xyzzy".into())

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::mute -> Result<String, ClientError> with Ok("xyzzy".into())
@@ -302,17 +302,17 @@
 
     /// Query or set the log verbosity level.
     pub async fn verb(&mut self, level: Option<u8>) -> Result<String, ClientError> {
         self.send_expect_success(OvpnCommand::Verb(level)).await
     }
 
     /// Query or set the mute threshold.
     pub async fn mute(&mut self, threshold: Option<u32>) -> Result<String, ClientError> {
-        self.send_expect_success(OvpnCommand::Mute(threshold)).await
+        Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// (Windows) Show network adapter list.
     pub async fn net(&mut self) -> Result<Vec<String>, ClientError> {
         self.send_expect_multi_line(OvpnCommand::Net).await
     }
 
     // -- Notification control --

---- client::tests::mute_returns_payload stdout ----

thread 'client::tests::mute_returns_payload' (21296) panicked at openvpn-mgmt-codec\src\client.rs:972:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "mute=40"

failures:
    client::tests::mute_returns_payload

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
