*** openvpn-mgmt-codec/src/client.rs:315:9: replace ManagementClient<T>::net -> Result<Vec<String>, ClientError> with Ok(vec!["xyzzy".into()])

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::net -> Result<Vec<String>, ClientError> with Ok(vec!["xyzzy".into()])
@@ -307,17 +307,17 @@
 
     /// Query or set the mute threshold.
     pub async fn mute(&mut self, threshold: Option<u32>) -> Result<String, ClientError> {
         self.send_expect_success(OvpnCommand::Mute(threshold)).await
     }
 
     /// (Windows) Show network adapter list.
     pub async fn net(&mut self) -> Result<Vec<String>, ClientError> {
-        self.send_expect_multi_line(OvpnCommand::Net).await
+        Ok(vec!["xyzzy".into()]) /* ~ changed by cargo-mutants ~ */
     }
 
     // -- Notification control --
 
     /// Control real-time log streaming.
     ///
     /// Streaming modes return accumulated log history. `On`/`Off` return `Ok(None)`.
     pub async fn log(&mut self, mode: StreamMode) -> Result<Option<Vec<String>>, ClientError> {

---- client::tests::net_returns_lines stdout ----

thread 'client::tests::net_returns_lines' (39924) panicked at openvpn-mgmt-codec\src\client.rs:1033:9:
assertion failed: lines[0].contains("eth0")

failures:
    client::tests::net_returns_lines

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
