*** openvpn-mgmt-codec/src/client.rs:324:9: replace ManagementClient<T>::log -> Result<Option<Vec<String>>, ClientError> with Ok(None)

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::log -> Result<Option<Vec<String>>, ClientError> with Ok(None)
@@ -316,17 +316,17 @@
     }
 
     // -- Notification control --
 
     /// Control real-time log streaming.
     ///
     /// Streaming modes return accumulated log history. `On`/`Off` return `Ok(None)`.
     pub async fn log(&mut self, mode: StreamMode) -> Result<Option<Vec<String>>, ClientError> {
-        self.send_stream_command(mode, OvpnCommand::Log(mode)).await
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Control real-time echo notifications.
     pub async fn echo(&mut self, mode: StreamMode) -> Result<Option<Vec<String>>, ClientError> {
         self.send_stream_command(mode, OvpnCommand::Echo(mode))
             .await
     }

---- client::tests::log_all_returns_history stdout ----

thread 'client::tests::log_all_returns_history' (39924) panicked at openvpn-mgmt-codec\src\client.rs:1110:64:
called `Option::unwrap()` on a `None` value

failures:
    client::tests::log_all_returns_history

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
