*** openvpn-mgmt-codec/src/client.rs:324:9: replace ManagementClient<T>::log -> Result<Option<Vec<String>>, ClientError> with Ok(Some(vec![String::new()]))

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::log -> Result<Option<Vec<String>>, ClientError> with Ok(Some(vec![String::new()]))
@@ -316,17 +316,17 @@
     }
 
     // -- Notification control --
 
     /// Control real-time log streaming.
     ///
     /// Streaming modes return accumulated log history. `On`/`Off` return `Ok(None)`.
     pub async fn log(&mut self, mode: StreamMode) -> Result<Option<Vec<String>>, ClientError> {
-        self.send_stream_command(mode, OvpnCommand::Log(mode)).await
+        Ok(Some(vec![String::new()])) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Control real-time echo notifications.
     pub async fn echo(&mut self, mode: StreamMode) -> Result<Option<Vec<String>>, ClientError> {
         self.send_stream_command(mode, OvpnCommand::Echo(mode))
             .await
     }

---- client::tests::log_on_returns_none stdout ----

thread 'client::tests::log_on_returns_none' (38384) panicked at openvpn-mgmt-codec\src\client.rs:1099:9:
assertion failed: client.log(StreamMode::On).await.unwrap().is_none()

---- client::tests::log_all_returns_history stdout ----

thread 'client::tests::log_all_returns_history' (3880) panicked at openvpn-mgmt-codec\src\client.rs:1111:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    client::tests::log_all_returns_history
    client::tests::log_on_returns_none

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
