*** openvpn-mgmt-codec/src/client.rs:353:9: replace ManagementClient<T>::hold_query -> Result<bool, ClientError> with Ok(true)

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::hold_query -> Result<bool, ClientError> with Ok(true)
@@ -345,18 +345,17 @@
 
     /// Kill a specific client connection (server mode).
     pub async fn kill(&mut self, target: KillTarget) -> Result<(), ClientError> {
         self.send_expect_ok(OvpnCommand::Kill(target)).await
     }
 
     /// Query the current hold flag.
     pub async fn hold_query(&mut self) -> Result<bool, ClientError> {
-        let payload = self.send_expect_success(OvpnCommand::HoldQuery).await?;
-        Ok(parsed_response::parse_hold(&payload)?)
+        Ok(true) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the hold flag on.
     pub async fn hold_on(&mut self) -> Result<(), ClientError> {
         self.send_expect_ok(OvpnCommand::HoldOn).await
     }
 
     /// Clear the hold flag.

---- client::tests::hold_query_returns_false stdout ----

thread 'client::tests::hold_query_returns_false' (26748) panicked at openvpn-mgmt-codec\src\client.rs:734:9:
assertion failed: !client.hold_query().await.unwrap()

failures:
    client::tests::hold_query_returns_false

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
