*** openvpn-mgmt-codec/src/client.rs:369:9: replace ManagementClient<T>::hold_release -> Result<(), ClientError> with Ok(())

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::hold_release -> Result<(), ClientError> with Ok(())
@@ -361,17 +361,17 @@
 
     /// Clear the hold flag.
     pub async fn hold_off(&mut self) -> Result<(), ClientError> {
         self.send_expect_ok(OvpnCommand::HoldOff).await
     }
 
     /// Release from hold state and start OpenVPN.
     pub async fn hold_release(&mut self) -> Result<(), ClientError> {
-        self.send_expect_ok(OvpnCommand::HoldRelease).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     // -- Authentication --
 
     /// Supply a username for the given auth type.
     pub async fn username(
         &mut self,
         auth_type: AuthType,

---- client::tests::server_error_maps_to_client_error stdout ----

thread 'client::tests::server_error_maps_to_client_error' (41220) panicked at openvpn-mgmt-codec\src\client.rs:1214:47:
called `Result::unwrap_err()` on an `Ok` value: ()

failures:
    client::tests::server_error_maps_to_client_error

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
