*** openvpn-mgmt-codec/src/client.rs:476:9: replace ManagementClient<T>::pkcs11_id_count -> Result<String, ClientError> with Ok(String::new())

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::pkcs11_id_count -> Result<String, ClientError> with Ok(String::new())
@@ -468,17 +468,17 @@
         })
         .await
     }
 
     // -- PKCS#11 --
 
     /// Query available PKCS#11 certificate count.
     pub async fn pkcs11_id_count(&mut self) -> Result<String, ClientError> {
-        self.send_expect_success(OvpnCommand::Pkcs11IdCount).await
+        Ok(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Retrieve a PKCS#11 certificate by index.
     pub async fn pkcs11_id_get(&mut self, index: u32) -> Result<String, ClientError> {
         self.send_expect_success(OvpnCommand::Pkcs11IdGet(index))
             .await
     }

---- client::tests::pkcs11_id_count_returns_payload stdout ----

thread 'client::tests::pkcs11_id_count_returns_payload' (25772) panicked at openvpn-mgmt-codec\src\client.rs:978:9:
assertion `left == right` failed
  left: ""
 right: "2"

failures:
    client::tests::pkcs11_id_count_returns_payload

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
