*** openvpn-mgmt-codec/src/client.rs:481:9: replace ManagementClient<T>::pkcs11_id_get -> Result<String, ClientError> with Ok("xyzzy".into())

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::pkcs11_id_get -> Result<String, ClientError> with Ok("xyzzy".into())
@@ -473,18 +473,17 @@
 
     /// Query available PKCS#11 certificate count.
     pub async fn pkcs11_id_count(&mut self) -> Result<String, ClientError> {
         self.send_expect_success(OvpnCommand::Pkcs11IdCount).await
     }
 
     /// Retrieve a PKCS#11 certificate by index.
     pub async fn pkcs11_id_get(&mut self, index: u32) -> Result<String, ClientError> {
-        self.send_expect_success(OvpnCommand::Pkcs11IdGet(index))
-            .await
+        Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 
     // -- External key / signatures --
 
     /// Provide an RSA signature in response to `>RSA_SIGN:`.
     pub async fn rsa_sig(&mut self, base64_lines: Vec<String>) -> Result<(), ClientError> {
         self.send_expect_ok(OvpnCommand::RsaSig { base64_lines })
             .await

---- client::tests::pkcs11_id_get_returns_payload stdout ----

thread 'client::tests::pkcs11_id_get_returns_payload' (3372) panicked at openvpn-mgmt-codec\src\client.rs:983:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "pkcs11-id=cert0"

failures:
    client::tests::pkcs11_id_get_returns_payload

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
