*** openvpn-mgmt-codec/src/client.rs:530:9: replace ManagementClient<T>::client_deny -> Result<(), ClientError> with Ok(())

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::client_deny -> Result<(), ClientError> with Ok(())
@@ -522,17 +522,17 @@
     /// Authorize a client without pushing any config.
     pub async fn client_auth_nt(&mut self, cid: u64, kid: u64) -> Result<(), ClientError> {
         self.send_expect_ok(OvpnCommand::ClientAuthNt { cid, kid })
             .await
     }
 
     /// Deny a client connection.
     pub async fn client_deny(&mut self, deny: ClientDeny) -> Result<(), ClientError> {
-        self.send_expect_ok(OvpnCommand::ClientDeny(deny)).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Kill a client session by CID.
     pub async fn client_kill(
         &mut self,
         cid: u64,
         message: Option<String>,
     ) -> Result<(), ClientError> {

*** result: Success
