*** openvpn-mgmt-codec/src/client.rs:564:9: replace ManagementClient<T>::remote -> Result<(), ClientError> with Ok(())

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::remote -> Result<(), ClientError> with Ok(())
@@ -556,17 +556,17 @@
         })
         .await
     }
 
     // -- Remote / Proxy override --
 
     /// Respond to a `>REMOTE:` notification.
     pub async fn remote(&mut self, action: RemoteAction) -> Result<(), ClientError> {
-        self.send_expect_ok(OvpnCommand::Remote(action)).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Respond to a `>PROXY:` notification.
     pub async fn proxy(&mut self, action: ProxyAction) -> Result<(), ClientError> {
         self.send_expect_ok(OvpnCommand::Proxy(action)).await
     }
 
     // -- Server statistics --

*** result: Success
