*** openvpn-mgmt-codec/src/client.rs:591:9: replace ManagementClient<T>::remote_entry_count -> Result<Vec<String>, ClientError> with Ok(vec![])

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::remote_entry_count -> Result<Vec<String>, ClientError> with Ok(vec![])
@@ -583,18 +583,17 @@
     pub async fn env_filter(&mut self, level: u32) -> Result<(), ClientError> {
         self.send_expect_ok(OvpnCommand::EnvFilter(level)).await
     }
 
     // -- Remote entry queries --
 
     /// Query the number of `--remote` entries.
     pub async fn remote_entry_count(&mut self) -> Result<Vec<String>, ClientError> {
-        self.send_expect_multi_line(OvpnCommand::RemoteEntryCount)
-            .await
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Retrieve `--remote` entries.
     pub async fn remote_entry_get(
         &mut self,
         range: RemoteEntryRange,
     ) -> Result<Vec<String>, ClientError> {
         self.send_expect_multi_line(OvpnCommand::RemoteEntryGet(range))

---- client::tests::remote_entry_count_returns_lines stdout ----

thread 'client::tests::remote_entry_count_returns_lines' (45292) panicked at openvpn-mgmt-codec\src\client.rs:1046:9:
assertion `left == right` failed
  left: []
 right: ["3"]

failures:
    client::tests::remote_entry_count_returns_lines

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
