*** openvpn-mgmt-codec/src/client.rs:600:9: replace ManagementClient<T>::remote_entry_get -> Result<Vec<String>, ClientError> with Ok(vec![])

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::remote_entry_get -> Result<Vec<String>, ClientError> with Ok(vec![])
@@ -592,18 +592,17 @@
             .await
     }
 
     /// Retrieve `--remote` entries.
     pub async fn remote_entry_get(
         &mut self,
         range: RemoteEntryRange,
     ) -> Result<Vec<String>, ClientError> {
-        self.send_expect_multi_line(OvpnCommand::RemoteEntryGet(range))
-            .await
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     // -- Push updates (server mode) --
 
     /// Broadcast a push option update to all connected clients.
     pub async fn push_update_broad(
         &mut self,
         options: impl Into<String>,

---- client::tests::remote_entry_get_returns_lines stdout ----

thread 'client::tests::remote_entry_get_returns_lines' (29236) panicked at openvpn-mgmt-codec\src\client.rs:1061:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    client::tests::remote_entry_get_returns_lines

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
