*** openvpn-mgmt-codec/src/client.rs:656:9: replace ManagementClient<T>::raw -> Result<String, ClientError> with Ok(String::new())

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::raw -> Result<String, ClientError> with Ok(String::new())
@@ -648,18 +648,17 @@
         self.framed.send(OvpnCommand::Exit).await?;
         Ok(())
     }
 
     // -- Raw escape hatch --
 
     /// Send a raw command expecting `SUCCESS:`/`ERROR:`.
     pub async fn raw(&mut self, command: impl Into<String>) -> Result<String, ClientError> {
-        self.send_expect_success(OvpnCommand::Raw(command.into()))
-            .await
+        Ok(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Send a raw command expecting a multi-line response.
     pub async fn raw_multi_line(
         &mut self,
         command: impl Into<String>,
     ) -> Result<Vec<String>, ClientError> {
         self.send_expect_multi_line(OvpnCommand::RawMultiLine(command.into()))

---- client::tests::raw_returns_success_payload stdout ----

thread 'client::tests::raw_returns_success_payload' (42140) panicked at openvpn-mgmt-codec\src\client.rs:989:9:
assertion `left == right` failed
  left: ""
 right: "pid=99"

---- client::tests::raw_server_error stdout ----

thread 'client::tests::raw_server_error' (16128) panicked at openvpn-mgmt-codec\src\client.rs:995:48:
called `Result::unwrap_err()` on an `Ok` value: ""

failures:
    client::tests::raw_returns_success_payload
    client::tests::raw_server_error

test result: FAILED. 368 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
