*** openvpn-mgmt-codec/src/client.rs:665:9: replace ManagementClient<T>::raw_multi_line -> Result<Vec<String>, ClientError> with Ok(vec![])

*** mutation diff:
--- openvpn-mgmt-codec/src/client.rs
+++ replace ManagementClient<T>::raw_multi_line -> Result<Vec<String>, ClientError> with Ok(vec![])
@@ -657,18 +657,17 @@
             .await
     }
 
     /// Send a raw command expecting a multi-line response.
     pub async fn raw_multi_line(
         &mut self,
         command: impl Into<String>,
     ) -> Result<Vec<String>, ClientError> {
-        self.send_expect_multi_line(OvpnCommand::RawMultiLine(command.into()))
-            .await
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use tokio::io::{AsyncWriteExt, DuplexStream};

---- client::tests::raw_multi_line_returns_lines stdout ----

thread 'client::tests::raw_multi_line_returns_lines' (17836) panicked at openvpn-mgmt-codec\src\client.rs:1039:9:
assertion `left == right` failed
  left: []
 right: ["line one", "line two"]

failures:
    client::tests::raw_multi_line_returns_lines

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
