*** openvpn-mgmt-codec/src/codec.rs:1015:5: replace parse_field -> Option<T> with None

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace parse_field -> Option<T> with None
@@ -1007,20 +1007,17 @@
 /// Parse a string into `T`, logging a warning on failure and returning `None`.
 ///
 /// Used by the notification parsers that degrade to `Notification::Simple`
 /// rather than failing hard.
 fn parse_field<T: std::str::FromStr>(value: &str, field: &str) -> Option<T>
 where
     T::Err: std::fmt::Display,
 {
-    value
-        .parse()
-        .inspect_err(|error| warn!(%error, value, field, "failed to parse notification field"))
-        .ok()
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_state(payload: &str) -> Option<Notification> {
     // Wire format per management-notes.txt:
     //   (a) timestamp, (b) state, (c) desc, (d) local_ip, (e) remote_ip,
     //   (f) remote_port, (g) local_addr, (h) local_port, (i) local_ipv6
     let mut parts = payload.splitn(9, ',');
     let timestamp = parse_field(parts.next()?, "state timestamp")?;

---- client::tests::notifications_forwarded_during_command stdout ----

thread 'client::tests::notifications_forwarded_during_command' (31804) panicked at openvpn-mgmt-codec\src\client.rs:1184:9:
expected ByteCount, got Simple { kind: "BYTECOUNT", payload: "1024,2048" }

---- codec::tests::decode_client_address_single_line stdout ----

thread 'codec::tests::decode_client_address_single_line' (25164) panicked at openvpn-mgmt-codec\src\codec.rs:1733:9:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::ClientAddress
    { cid: 3, addr, primary: true, }) if addr == "10.0.0.5")

---- codec::tests::decode_client_connect_multiline_notification stdout ----

thread 'codec::tests::decode_client_connect_multiline_notification' (19944) panicked at openvpn-mgmt-codec\src\codec.rs:1716:9:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::Client
    { event: ClientEvent::Connect, cid: 0, kid: Some(1), env, }) if env.len()
    == 2 && env.get("untrusted_ip").map(String::as_str) == Some("1.2.3.4") &&
    env.get("common_name").map(String::as_str) == Some("TestClient"))

failures:
    client::tests::notifications_forwarded_during_command
    codec::tests::decode_client_address_single_line
    codec::tests::decode_client_connect_multiline_notification
    codec::tests::decode_client_disconnect
    codec::tests::decode_notification_during_multiline
    codec::tests::decode_state_notification

test result: FAILED. 364 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
