*** openvpn-mgmt-codec/src/codec.rs:1053:5: replace parse_bytecount -> Option<Notification> with None

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace parse_bytecount -> Option<Notification> with None
@@ -1045,21 +1045,17 @@
         remote_port,
         local_addr,
         local_port,
         local_ipv6,
     })
 }
 
 fn parse_bytecount(payload: &str) -> Option<Notification> {
-    let (a, b) = payload.split_once(',')?;
-    Some(Notification::ByteCount {
-        bytes_in: parse_field(a, "bytecount bytes_in")?,
-        bytes_out: parse_field(b, "bytecount bytes_out")?,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_bytecount_cli(payload: &str) -> Option<Notification> {
     let mut parts = payload.splitn(3, ',');
     let cid = parse_field(parts.next()?, "bytecount_cli cid")?;
     let bytes_in = parse_field(parts.next()?, "bytecount_cli bytes_in")?;
     let bytes_out = parse_field(parts.next()?, "bytecount_cli bytes_out")?;
     Some(Notification::ByteCountCli {

---- client::tests::notifications_forwarded_during_command stdout ----

thread 'client::tests::notifications_forwarded_during_command' (20536) panicked at openvpn-mgmt-codec\src\client.rs:1184:9:
expected ByteCount, got Simple { kind: "BYTECOUNT", payload: "1024,2048" }

---- codec::tests::decode_notification_during_multiline stdout ----

thread 'codec::tests::decode_notification_during_multiline' (40496) panicked at openvpn-mgmt-codec\src\codec.rs:1692:9:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::ByteCount
    { bytes_in: 1000, bytes_out: 2000 }))

failures:
    client::tests::notifications_forwarded_during_command
    codec::tests::decode_notification_during_multiline

test result: FAILED. 368 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
