*** openvpn-mgmt-codec/src/codec.rs:1073:5: replace parse_log -> Option<Notification> with None

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace parse_log -> Option<Notification> with None
@@ -1065,27 +1065,17 @@
     Some(Notification::ByteCountCli {
         cid,
         bytes_in,
         bytes_out,
     })
 }
 
 fn parse_log(payload: &str) -> Option<Notification> {
-    let (ts_str, rest) = payload.split_once(',')?;
-    let timestamp = parse_field(ts_str, "log timestamp")?;
-    let (level_str, message) = rest.split_once(',')?;
-    Some(Notification::Log {
-        timestamp,
-        level: level_str
-            .parse()
-            .inspect_err(|error| warn!(%error, "unknown log level"))
-            .unwrap_or_else(|_| LogLevel::Unknown(level_str.to_string())),
-        message: message.to_string(),
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_echo(payload: &str) -> Option<Notification> {
     let (ts_str, param) = payload.split_once(',')?;
     let timestamp = parse_field(ts_str, "echo timestamp")?;
     Some(Notification::Echo {
         timestamp,
         param: param.to_string(),

---- log_empty_message stdout ----

thread 'log_empty_message' (9876) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:217:9:
expected Log

---- log_unknown_level stdout ----

thread 'log_unknown_level' (45772) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:207:9:
expected Log

---- log_with_commas_in_message stdout ----

thread 'log_with_commas_in_message' (28768) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:197:9:
expected Log

failures:
    log_empty_message
    log_unknown_level
    log_with_commas_in_message

test result: FAILED. 56 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
