*** openvpn-mgmt-codec/src/codec.rs:1087:5: replace parse_echo -> Option<Notification> with None

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace parse_echo -> Option<Notification> with None
@@ -1079,22 +1079,17 @@
             .parse()
             .inspect_err(|error| warn!(%error, "unknown log level"))
             .unwrap_or_else(|_| LogLevel::Unknown(level_str.to_string())),
         message: message.to_string(),
     })
 }
 
 fn parse_echo(payload: &str) -> Option<Notification> {
-    let (ts_str, param) = payload.split_once(',')?;
-    let timestamp = parse_field(ts_str, "echo timestamp")?;
-    Some(Notification::Echo {
-        timestamp,
-        param: param.to_string(),
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_pkcs11id_count(payload: &str) -> Option<Notification> {
     let count = parse_field(payload.trim(), "pkcs11id_count")?;
     Some(Notification::Pkcs11IdCount { count })
 }
 
 /// Parse `>PKCS11ID-ENTRY:'idx', ID:'id', BLOB:'blob'` from the notification

---- echo_empty_param stdout ----

thread 'echo_empty_param' (25736) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:253:9:
expected Echo

---- echo_with_commas stdout ----

thread 'echo_with_commas' (44492) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:243:9:
expected Echo

failures:
    echo_empty_param
    echo_with_commas

test result: FAILED. 57 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
