*** openvpn-mgmt-codec/src/codec.rs:1096:5: replace parse_pkcs11id_count -> Option<Notification> with None

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace parse_pkcs11id_count -> Option<Notification> with None
@@ -1088,18 +1088,17 @@
     let timestamp = parse_field(ts_str, "echo timestamp")?;
     Some(Notification::Echo {
         timestamp,
         param: param.to_string(),
     })
 }
 
 fn parse_pkcs11id_count(payload: &str) -> Option<Notification> {
-    let count = parse_field(payload.trim(), "pkcs11id_count")?;
-    Some(Notification::Pkcs11IdCount { count })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse `>PKCS11ID-ENTRY:'idx', ID:'id', BLOB:'blob'` from the notification
 /// payload (after the kind and colon have been stripped).
 fn parse_pkcs11id_entry_notif(payload: &str) -> Option<OvpnMessage> {
     let rest = payload.strip_prefix('\'')?;
     let (index, rest) = rest.split_once("', ID:'")?;
     let (id, rest) = rest.split_once("', BLOB:'")?;

---- pkcs11_id_count_valid stdout ----

thread 'pkcs11_id_count_valid' (23168) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:510:5:
assertion failed: matches!(notification, Notification::Pkcs11IdCount { count: 3 })

---- pkcs11_id_count_zero stdout ----

thread 'pkcs11_id_count_zero' (30064) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:519:5:
assertion failed: matches!(notification, Notification::Pkcs11IdCount { count: 0 })

failures:
    pkcs11_id_count_valid
    pkcs11_id_count_zero

test result: FAILED. 57 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
