*** openvpn-mgmt-codec/src/codec.rs:1103:5: replace parse_pkcs11id_entry_notif -> Option<OvpnMessage> with None

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace parse_pkcs11id_entry_notif -> Option<OvpnMessage> with None
@@ -1095,25 +1095,17 @@
 fn parse_pkcs11id_count(payload: &str) -> Option<Notification> {
     let count = parse_field(payload.trim(), "pkcs11id_count")?;
     Some(Notification::Pkcs11IdCount { count })
 }
 
 /// Parse `>PKCS11ID-ENTRY:'idx', ID:'id', BLOB:'blob'` from the notification
 /// payload (after the kind and colon have been stripped).
 fn parse_pkcs11id_entry_notif(payload: &str) -> Option<OvpnMessage> {
-    let rest = payload.strip_prefix('\'')?;
-    let (index, rest) = rest.split_once("', ID:'")?;
-    let (id, rest) = rest.split_once("', BLOB:'")?;
-    let blob = rest.strip_suffix('\'')?;
-    Some(OvpnMessage::Pkcs11IdEntry {
-        index: index.to_string(),
-        id: id.to_string(),
-        blob: blob.to_string(),
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse `Need 'name' ... MSG:message` from NEED-OK payload.
 fn parse_need_ok(payload: &str) -> Option<Notification> {
     // Format: Need 'name' confirmation MSG:message
     let rest = payload.strip_prefix("Need '")?;
     let (name, rest) = rest.split_once('\'')?;
     let msg = rest.split_once("MSG:")?.1;

---- real_world::pkcs11id_entry_with_realistic_token_data stdout ----

thread 'real_world::pkcs11id_entry_with_realistic_token_data' (11872) panicked at openvpn-mgmt-codec\tests\defensive\real_world.rs:857:18:
expected Pkcs11IdEntry, got: Notification(Simple { kind: "PKCS11ID-ENTRY", payload: "'0', ID:'pkcs11:model=SoftHSM%20v2;manufacturer=SoftHSM%20project;serial=a1b2c3d4e5f6;token=My%20Token;id=%01%02%03;object=my-cert;type=cert', BLOB:'MIICpDCCAYwCCQDU+pQ4pHgSpDANBgkqhkiG9w0BAQsFADAU'" })

failures:
    real_world::pkcs11id_entry_with_realistic_token_data

test result: FAILED. 132 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
