*** openvpn-mgmt-codec/src/codec.rs:110:5: replace quote -> String with "xyzzy".into()

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace quote -> String with "xyzzy".into()
@@ -102,17 +102,17 @@
 }
 
 /// Wrap an already-escaped string in double quotes for the wire format.
 ///
 /// This is required for any user-supplied string that might contain
 /// whitespace, backslashes, or quotes — passwords, reason strings,
 /// needstr values, etc.
 fn quote(s: &str) -> String {
-    format!("\"{s}\"")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Codec-internal state for accumulating multi-line `>CLIENT:` notifications.
 #[derive(Debug)]
 struct ClientNotificationAccumulator {
     event: ClientEvent,
     cid: u64,
     kid: Option<u64>,

---- codec::tests::encode_client_deny_with_client_reason stdout ----

thread 'codec::tests::encode_client_deny_with_client_reason' (37204) panicked at openvpn-mgmt-codec\src\codec.rs:1418:9:
assertion `left == right` failed
  left: "client-deny 5 0 xyzzy xyzzy\n"
 right: "client-deny 5 0 \"cert revoked\" \"Your access has been revoked.\"\n"

---- codec::tests::encode_needstr stdout ----
2026-03-29T10:51:08.047715Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=need-str expected=SuccessOrError queue_depth=1

thread 'codec::tests::encode_needstr' (25536) panicked at openvpn-mgmt-codec\src\codec.rs:1569:9:
assertion `left == right` failed
  left: "needstr name xyzzy\n"
 right: "needstr name \"John\"\n"

---- codec::tests::encode_password_escaping stdout ----
2026-03-29T10:51:08.047810Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=password expected=SuccessOrError queue_depth=1

thread 'codec::tests::encode_password_escaping' (34020) panicked at openvpn-mgmt-codec\src\codec.rs:1369:9:
assertion `left == right` failed
  left: "password xyzzy xyzzy\n"
 right: "password \"Private Key\" \"foo\\\\\\\"bar\"\n"

failures:
    codec::tests::encode_client_deny_with_client_reason
    codec::tests::encode_needstr
    codec::tests::encode_password_escaping
    codec::tests::encode_password_simple
    codec::tests::encode_push_update_broad
    codec::tests::encode_push_update_cid
    codec::tests::escape_and_quote_special_chars
    command::tests::parse_password_roundtrip_spaced_auth_types

test result: FAILED. 362 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
