*** openvpn-mgmt-codec/src/codec.rs:1117:5: replace parse_need_ok -> Option<Notification> with None

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace parse_need_ok -> Option<Notification> with None
@@ -1109,23 +1109,17 @@
         id: id.to_string(),
         blob: blob.to_string(),
     })
 }
 
 /// Parse `Need 'name' ... MSG:message` from NEED-OK payload.
 fn parse_need_ok(payload: &str) -> Option<Notification> {
     // Format: Need 'name' confirmation MSG:message
-    let rest = payload.strip_prefix("Need '")?;
-    let (name, rest) = rest.split_once('\'')?;
-    let msg = rest.split_once("MSG:")?.1;
-    Some(Notification::NeedOk {
-        name: name.to_string(),
-        message: msg.to_string(),
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse `Need 'name' input MSG:message` from NEED-STR payload.
 fn parse_need_str(payload: &str) -> Option<Notification> {
     let rest = payload.strip_prefix("Need '")?;
     let (name, rest) = rest.split_once('\'')?;
     let msg = rest.split_once("MSG:")?.1;
     Some(Notification::NeedStr {

---- codec::tests::decode_need_ok_notification stdout ----

thread 'codec::tests::decode_need_ok_notification' (23476) panicked at openvpn-mgmt-codec\src\codec.rs:1823:9:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::NeedOk { name, message }) if name
    == "token-insertion-request" && message == "Please insert your token")

failures:
    codec::tests::decode_need_ok_notification

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
