*** openvpn-mgmt-codec/src/codec.rs:1128:5: replace parse_need_str -> Option<Notification> with None

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace parse_need_str -> Option<Notification> with None
@@ -1120,23 +1120,17 @@
     Some(Notification::NeedOk {
         name: name.to_string(),
         message: msg.to_string(),
     })
 }
 
 /// Parse `Need 'name' input MSG:message` from NEED-STR payload.
 fn parse_need_str(payload: &str) -> Option<Notification> {
-    let rest = payload.strip_prefix("Need '")?;
-    let (name, rest) = rest.split_once('\'')?;
-    let msg = rest.split_once("MSG:")?.1;
-    Some(Notification::NeedStr {
-        name: name.to_string(),
-        message: msg.to_string(),
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse `>PK_SIGN:base64_data[,algorithm]`.
 ///
 /// The algorithm field is only present when the management client announced
 /// version > 2 via the `version` command.
 ///
 /// Source: [`management-notes.txt`](https://github.com/OpenVPN/openvpn/blob/master/doc/management-notes.txt),

---- need_str_valid stdout ----

thread 'need_str_valid' (24088) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:496:5:
assertion failed: matches!(notification, Notification::NeedStr { ref name, ref message } if name
    == "username" && message == "Enter username")

failures:
    need_str_valid

test result: FAILED. 58 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
