*** openvpn-mgmt-codec/src/codec.rs:1145:5: replace parse_pk_sign -> Option<Notification> with None

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace parse_pk_sign -> Option<Notification> with None
@@ -1137,24 +1137,17 @@
 /// Parse `>PK_SIGN:base64_data[,algorithm]`.
 ///
 /// The algorithm field is only present when the management client announced
 /// version > 2 via the `version` command.
 ///
 /// Source: [`management-notes.txt`](https://github.com/OpenVPN/openvpn/blob/master/doc/management-notes.txt),
 /// [`ssl_openssl.c` `get_sig_from_man()`](https://github.com/OpenVPN/openvpn/blob/master/src/openvpn/ssl_openssl.c).
 fn parse_pk_sign(payload: &str) -> Option<Notification> {
-    if payload.is_empty() {
-        return None;
-    }
-    let (data, algorithm) = match payload.split_once(',') {
-        Some((d, a)) => (d.to_string(), Some(a.to_string())),
-        None => (payload.to_string(), None),
-    };
-    Some(Notification::PkSign { data, algorithm })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_remote(payload: &str) -> Option<Notification> {
     let mut parts = payload.splitn(3, ',');
     let host = parts.next()?.to_string();
     let port = parse_field(parts.next()?, "remote port")?;
     let proto_str = parts.next()?;
     let protocol = proto_str

---- real_world::pk_sign_with_algorithm_parsed stdout ----

thread 'real_world::pk_sign_with_algorithm_parsed' (6904) panicked at openvpn-mgmt-codec\tests\defensive\real_world.rs:351:5:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::PkSign
    { data, algorithm: Some(algo), }) if data == "AABBCCDD==" && algo ==
    "RSA_PKCS1_PSS_PADDING")

---- real_world::pk_sign_with_ecdsa_algorithm stdout ----

thread 'real_world::pk_sign_with_ecdsa_algorithm' (34744) panicked at openvpn-mgmt-codec\tests\defensive\real_world.rs:1279:5:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::PkSign
    { data, algorithm: Some(algo), }) if data == "EEFF0011==" && algo ==
    "ECDSA")

---- real_world::pk_sign_with_pss_padding_and_hash_params stdout ----

thread 'real_world::pk_sign_with_pss_padding_and_hash_params' (42164) panicked at openvpn-mgmt-codec\tests\defensive\real_world.rs:1271:18:
expected PkSign, got: Notification(Simple { kind: "PK_SIGN", payload: "AABBCCDD==,RSA_PKCS1_PSS_PADDING,hashalg=SHA256,saltlen=max" })

failures:
    real_world::pk_sign_with_algorithm_parsed
    real_world::pk_sign_with_ecdsa_algorithm
    real_world::pk_sign_with_large_base64_payload
    real_world::pk_sign_with_pss_padding_and_hash_params
    real_world::pk_sign_without_algorithm_parsed

test result: FAILED. 128 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
