*** openvpn-mgmt-codec/src/codec.rs:1173:5: replace parse_proxy -> Option<Notification> with None

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace parse_proxy -> Option<Notification> with None
@@ -1165,29 +1165,17 @@
         host,
         port,
         protocol,
     })
 }
 
 fn parse_proxy(payload: &str) -> Option<Notification> {
     // Wire: >PROXY:{index},{type},{host}  (3 fields per init.c)
-    let mut parts = payload.splitn(3, ',');
-    let index = parse_field(parts.next()?, "proxy index")?;
-    let pt_str = parts.next()?;
-    let proxy_type = pt_str
-        .parse()
-        .inspect_err(|error| warn!(%error, "unknown proxy type"))
-        .unwrap_or_else(|_| TransportProtocol::Unknown(pt_str.to_string()));
-    let host = parts.next()?.to_string();
-    Some(Notification::Proxy {
-        index,
-        proxy_type,
-        host,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Map a wire auth-type string to the typed enum.
 fn parse_auth_type(s: &str) -> AuthType {
     s.parse()
         .inspect_err(|error| warn!(%error, "unknown auth type"))
         .unwrap_or_else(|_| AuthType::Unknown(s.to_string()))
 }

---- proxy_valid stdout ----

thread 'proxy_valid' (44152) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:456:5:
assertion failed: matches!(notification, Notification::Proxy { index: 1, .. })

failures:
    proxy_valid

test result: FAILED. 58 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
