*** openvpn-mgmt-codec/src/codec.rs:224:9: replace OvpnCodec::with_max_multi_line_lines -> Self with Default::default()

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace OvpnCodec::with_max_multi_line_lines -> Self with Default::default()
@@ -216,18 +216,17 @@
     /// decode responses.
     pub fn new() -> Self {
         Self::default()
     }
 
     /// Set the maximum number of lines accumulated in a multi-line
     /// response before the decoder returns an error.
     pub fn with_max_multi_line_lines(mut self, limit: AccumulationLimit) -> Self {
-        self.max_multi_line_lines = limit;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the maximum number of ENV entries accumulated for
     /// `>CLIENT:` notifications before the decoder returns an error.
     pub fn with_max_client_env_entries(mut self, limit: AccumulationLimit) -> Self {
         self.max_client_env_entries = limit;
         self
     }

---- codec::tests::multi_line_limit_exceeded stdout ----
2026-03-29T10:51:14.616444Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=status expected=MultiLine queue_depth=1
2026-03-29T10:51:14.616473Z DEBUG openvpn_mgmt_codec::codec: decoded multi-line response line_count=4

thread 'codec::tests::multi_line_limit_exceeded' (47396) panicked at openvpn-mgmt-codec\src\codec.rs:2000:9:
expected error when limit exceeded

failures:
    codec::tests::multi_line_limit_exceeded

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
