*** openvpn-mgmt-codec/src/codec.rs:242:9: replace OvpnCodec::with_encoder_mode -> Self with Default::default()

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace OvpnCodec::with_encoder_mode -> Self with Default::default()
@@ -234,18 +234,17 @@
 
     /// Set the encoder mode for handling unsafe characters in user-supplied
     /// strings.
     ///
     /// The default is [`EncoderMode::Sanitize`], which silently strips
     /// `\n`, `\r`, and `\0`. Use [`EncoderMode::Strict`] to reject inputs
     /// containing those characters with an error instead.
     pub fn with_encoder_mode(mut self, mode: EncoderMode) -> Self {
-        self.encoder_mode = mode;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Peek at the expected response kind for the next unmatched command.
     /// Falls back to `SuccessOrError` when no command is pending (defensive;
     /// self-describing SUCCESS/ERROR lines will still decode correctly).
     fn expected_front(&self) -> ResponseKind {
         self.expected_queue
             .front()

---- codec::tests::raw_multiline_strict_rejects_newlines stdout ----
2026-03-29T10:51:21.490022Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=raw-multi-line expected=MultiLine queue_depth=1

thread 'codec::tests::raw_multiline_strict_rejects_newlines' (26168) panicked at openvpn-mgmt-codec\src\codec.rs:1884:9:
assertion failed: result.is_err()

failures:
    codec::tests::raw_multiline_strict_rejects_newlines

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
