*** openvpn-mgmt-codec/src/codec.rs:259:9: replace OvpnCodec::consume_expected with ()

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace OvpnCodec::consume_expected with ()
@@ -251,17 +251,17 @@
             .front()
             .copied()
             .unwrap_or(ResponseKind::SuccessOrError)
     }
 
     /// Pop the front response kind after a complete response has been
     /// decoded (Success, Error, MultiLine, or NoResponse).
     fn consume_expected(&mut self) {
-        self.expected_queue.pop_front();
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The decoder accumulated more items than its configured limit allows.
 #[derive(Debug, thiserror::Error)]
 #[error("{what} accumulation limit exceeded ({max})")]
 struct AccumulationLimitExceeded {
     what: &'static str,

---- codec::tests::pipelined_commands_decode_correctly stdout ----
2026-03-29T10:51:26.529488Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=status expected=MultiLine queue_depth=1
2026-03-29T10:51:26.529523Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=pid expected=SuccessOrError queue_depth=2
2026-03-29T10:51:26.529540Z DEBUG openvpn_mgmt_codec::codec: decoded multi-line response line_count=3

thread 'codec::tests::pipelined_commands_decode_correctly' (45684) panicked at openvpn-mgmt-codec\src\codec.rs:1956:9:
assertion failed: codec.expected_queue.is_empty()

failures:
    codec::tests::pipelined_commands_decode_correctly

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
