*** openvpn-mgmt-codec/src/codec.rs:276:5: replace check_accumulation_limit -> Result<(), io::Error> with Ok(())

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace check_accumulation_limit -> Result<(), io::Error> with Ok(())
@@ -268,22 +268,17 @@
     max: usize,
 }
 
 fn check_accumulation_limit(
     current_len: usize,
     limit: AccumulationLimit,
     what: &'static str,
 ) -> Result<(), io::Error> {
-    if let AccumulationLimit::Max(max) = limit
-        && current_len >= max
-    {
-        return Err(io::Error::other(AccumulationLimitExceeded { what, max }));
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 // --- Encoder ---
 
 impl Encoder<OvpnCommand> for OvpnCodec {
     type Error = io::Error;
 
     fn encode(&mut self, item: OvpnCommand, dst: &mut BytesMut) -> Result<(), Self::Error> {

---- codec::tests::client_env_limit_exceeded stdout ----

thread 'codec::tests::client_env_limit_exceeded' (38204) panicked at openvpn-mgmt-codec\src\codec.rs:2041:9:
expected error when client ENV limit exceeded

---- codec::tests::multi_line_limit_exceeded stdout ----
2026-03-29T10:51:29.128474Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=status expected=MultiLine queue_depth=1
2026-03-29T10:51:29.128525Z DEBUG openvpn_mgmt_codec::codec: decoded multi-line response line_count=4

thread 'codec::tests::multi_line_limit_exceeded' (23528) panicked at openvpn-mgmt-codec\src\codec.rs:1996:9:
expected error when limit exceeded

failures:
    codec::tests::client_env_limit_exceeded
    codec::tests::multi_line_limit_exceeded

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
