*** openvpn-mgmt-codec/src/codec.rs:277:24: replace >= with < in check_accumulation_limit

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace >= with < in check_accumulation_limit
@@ -269,17 +269,17 @@
 }
 
 fn check_accumulation_limit(
     current_len: usize,
     limit: AccumulationLimit,
     what: &'static str,
 ) -> Result<(), io::Error> {
     if let AccumulationLimit::Max(max) = limit
-        && current_len >= max
+        && current_len < /* ~ changed by cargo-mutants ~ */ max
     {
         return Err(io::Error::other(AccumulationLimitExceeded { what, max }));
     }
     Ok(())
 }
 
 // --- Encoder ---

---- client::tests::help_returns_lines stdout ----

thread 'client::tests::help_returns_lines' (1400) panicked at openvpn-mgmt-codec\src\client.rs:1024:41:
called `Result::unwrap()` on an `Err` value: Io(Custom { kind: Other, error: AccumulationLimitExceeded { what: "multi-line response", max: 10000 } })

---- client::tests::log_all_returns_history stdout ----

thread 'client::tests::log_all_returns_history' (32736) panicked at openvpn-mgmt-codec\src\client.rs:1110:55:
called `Result::unwrap()` on an `Err` value: Io(Custom { kind: Other, error: AccumulationLimitExceeded { what: "multi-line response", max: 10000 } })

---- client::tests::raw_multi_line_returns_lines stdout ----

thread 'client::tests::raw_multi_line_returns_lines' (22912) panicked at openvpn-mgmt-codec\src\client.rs:1039:63:
called `Result::unwrap()` on an `Err` value: Io(Custom { kind: Other, error: AccumulationLimitExceeded { what: "multi-line response", max: 10000 } })

failures:
    client::tests::help_returns_lines
    client::tests::log_all_returns_history
    client::tests::raw_multi_line_returns_lines
    client::tests::remote_entry_get_returns_lines
    client::tests::status_raw_returns_lines
    codec::tests::decode_multiline_with_command_tracking
    codec::tests::decode_notification_during_multiline
    codec::tests::default_accumulation_limit_allows_reasonable_responses
    codec::tests::multi_line_limit_exact_boundary_passes
    codec::tests::pipelined_commands_decode_correctly
    codec::tests::raw_multiline_expects_multiline_response

test result: FAILED. 359 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
