*** openvpn-mgmt-codec/src/codec.rs:290:42: replace || with && in <impl Encoder<OvpnCommand> for OvpnCodec>::encode

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace || with && in <impl Encoder<OvpnCommand> for OvpnCodec>::encode
@@ -282,17 +282,17 @@
 }
 
 // --- Encoder ---
 
 impl Encoder<OvpnCommand> for OvpnCodec {
     type Error = io::Error;
 
     fn encode(&mut self, item: OvpnCommand, dst: &mut BytesMut) -> Result<(), Self::Error> {
-        if self.multi_line_buf.is_some() || self.client_notification.is_some() {
+        if self.multi_line_buf.is_some() && /* ~ changed by cargo-mutants ~ */ self.client_notification.is_some() {
             warn!(
                 "encode() called while the decoder is mid-accumulation \
                  (multi_line_buf or client_notification is active). \
                  Drain decode() before sending a new command."
             );
         }
 
         // Push the expected response kind onto the queue so the decoder

---- codec::tests::encode_during_multiline_accumulation_warns_but_succeeds stdout ----
2026-03-29T10:51:45.123505Z DEBUG encode_during_multiline_accumulation_warns_but_succeeds: openvpn_mgmt_codec::codec: encoding command cmd=status expected=MultiLine queue_depth=1
2026-03-29T10:51:45.123590Z DEBUG encode_during_multiline_accumulation_warns_but_succeeds: openvpn_mgmt_codec::codec: encoding command cmd=pid expected=SuccessOrError queue_depth=2

thread 'codec::tests::encode_during_multiline_accumulation_warns_but_succeeds' (33984) panicked at openvpn-mgmt-codec\src\codec.rs:1909:9:
assertion failed: logs_contain("mid-accumulation")

---- codec::tests::encode_during_client_notif_accumulation_warns_but_succeeds stdout ----
2026-03-29T10:51:45.123661Z DEBUG encode_during_client_notif_accumulation_warns_but_succeeds: openvpn_mgmt_codec::codec: encoding command cmd=pid expected=SuccessOrError queue_depth=1

thread 'codec::tests::encode_during_client_notif_accumulation_warns_but_succeeds' (2596) panicked at openvpn-mgmt-codec\src\codec.rs:1923:9:
assertion failed: logs_contain("mid-accumulation")

failures:
    codec::tests::encode_during_client_notif_accumulation_warns_but_succeeds
    codec::tests::encode_during_multiline_accumulation_warns_but_succeeds

test result: FAILED. 368 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
