*** openvpn-mgmt-codec/src/codec.rs:529:32: replace > with >= in <impl Encoder<OvpnCommand> for OvpnCodec>::encode

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace > with >= in <impl Encoder<OvpnCommand> for OvpnCodec>::encode
@@ -521,17 +521,17 @@
             OvpnCommand::ClientPendingAuth {
                 cid,
                 kid,
                 ref extra,
                 timeout,
             } => {
                 // Real-world limit discovered by jkroepke/openvpn-auth-oauth2
                 // (used for WEB_AUTH URLs). Not documented in management-notes.txt.
-                if extra.len() > 245 {
+                if extra.len() >= /* ~ changed by cargo-mutants ~ */ 245 {
                     warn!(
                         len = extra.len(),
                         max = 245,
                         "client-pending-auth extra exceeds 245-character limit; \
                          OpenVPN may truncate or reject it"
                     );
                 }
                 let extra = wire_safe(extra, "client-pending-auth extra", mode)?;

---- codec::tests::encode_client_pending_auth_at_limit_no_warning stdout ----
2026-03-29T10:52:03.269643Z DEBUG encode_client_pending_auth_at_limit_no_warning: openvpn_mgmt_codec::codec: encoding command cmd=client-pending-auth expected=SuccessOrError queue_depth=1
2026-03-29T10:52:03.269698Z  WARN encode_client_pending_auth_at_limit_no_warning: openvpn_mgmt_codec::codec: client-pending-auth extra exceeds 245-character limit; OpenVPN may truncate or reject it len=245 max=245

thread 'codec::tests::encode_client_pending_auth_at_limit_no_warning' (27504) panicked at openvpn-mgmt-codec\src\codec.rs:1462:9:
assertion failed: !logs_contain("exceeds 245-character limit")

failures:
    codec::tests::encode_client_pending_auth_at_limit_no_warning

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
