*** openvpn-mgmt-codec/src/codec.rs:600:5: replace write_line with ()

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace write_line with ()
@@ -592,19 +592,17 @@
         }
 
         Ok(())
     }
 }
 
 /// Write a single line followed by `\n`.
 fn write_line(dst: &mut BytesMut, s: &str) {
-    dst.reserve(s.len() + 1);
-    dst.put_slice(s.as_bytes());
-    dst.put_u8(b'\n');
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Write a multi-line block: header line, body lines, and a terminating `END`.
 ///
 /// In [`EncoderMode::Sanitize`] mode, body lines have `\n`, `\r`, and `\0`
 /// stripped, and any line that would be exactly `"END"` is escaped to
 /// `" END"` so the server does not treat it as the block terminator.
 ///

---- codec::tests::encode_client_deny_with_client_reason stdout ----

thread 'codec::tests::encode_client_deny_with_client_reason' (17292) panicked at openvpn-mgmt-codec\src\codec.rs:1416:9:
assertion `left == right` failed
  left: ""
 right: "client-deny 5 0 \"cert revoked\" \"Your access has been revoked.\"\n"

---- codec::tests::encode_client_pending_auth stdout ----

thread 'codec::tests::encode_client_pending_auth' (8344) panicked at openvpn-mgmt-codec\src\codec.rs:1430:9:
assertion `left == right` failed
  left: ""
 right: "client-pending-auth 42 1 WEB_AUTH::https://example.com 120\n"

---- codec::tests::encode_echo_on_all stdout ----

thread 'codec::tests::encode_echo_on_all' (44300) panicked at openvpn-mgmt-codec\src\codec.rs:1585:9:
assertion `left == right` failed
  left: ""
 right: "echo on all\n"

failures:
    codec::tests::encode_client_deny_with_client_reason
    codec::tests::encode_client_pending_auth
    codec::tests::encode_client_pending_auth_long_extra_warns
    codec::tests::encode_echo_on_all
    codec::tests::encode_env_filter
    codec::tests::encode_forget_passwords
    codec::tests::encode_hold_query
    codec::tests::encode_needok
    codec::tests::encode_needstr
    codec::tests::encode_password_escaping
    codec::tests::encode_password_simple
    codec::tests::encode_proxy_http_nct

test result: FAILED. 343 passed; 27 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
