*** openvpn-mgmt-codec/src/codec.rs:626:5: replace write_block -> Result<(), io::Error> with Ok(())

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace write_block -> Result<(), io::Error> with Ok(())
@@ -618,40 +618,17 @@
 ) -> Result<(), io::Error> {
     // Upper-bound byte count for the entire block on the wire:
     //   header.len()  — header line text (e.g. ">client-auth 7 42")
     //   + 1           — '\n' terminating the header
     //   + Σ(l.len()+2)— each body line's text + "\r\n" (2 bytes)
     //   + 4           — "END\n" block terminator
     // This is a conservative estimate: sanitized lines may shrink or grow
     // slightly, but over-reserving is harmless — only written bytes count.
-    let total: usize =
-        header.len() + 1 + lines.iter().map(|line| line.len() + 2).sum::<usize>() + 4;
-    dst.reserve(total);
-    dst.put_slice(header.as_bytes());
-    dst.put_u8(b'\n');
-    for line in lines {
-        let clean = wire_safe(line, "block body line", mode)?;
-        if *clean == *"END" {
-            match mode {
-                EncoderMode::Sanitize => {
-                    dst.put_slice(b" END");
-                    dst.put_u8(b'\n');
-                    continue;
-                }
-                EncoderMode::Strict => {
-                    return Err(io::Error::other(EncodeError::EndInBlockBody));
-                }
-            }
-        }
-        dst.put_slice(clean.as_bytes());
-        dst.put_u8(b'\n');
-    }
-    dst.put_slice(b"END\n");
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// The password prompt.
 ///
 /// May arrive without a trailing newline
 /// (OpenVPN ≥ 2.6 sends it as an interactive prompt, expecting
 /// the password on the same line).
 /// Handle this only when no complete line is available —

---- codec::tests::encode_client_auth_empty_config stdout ----

thread 'codec::tests::encode_client_auth_empty_config' (24404) panicked at openvpn-mgmt-codec\src\codec.rs:1384:9:
assertion `left == right` failed
  left: ""
 right: "client-auth 1 0\nEND\n"

---- codec::tests::encode_client_auth_with_config stdout ----

thread 'codec::tests::encode_client_auth_with_config' (23108) panicked at openvpn-mgmt-codec\src\codec.rs:1368:9:
assertion `left == right` failed
  left: ""
 right: "client-auth 42 0\npush \"route 10.0.0.0 255.255.0.0\"\npush \"dhcp-option DNS 10.0.0.1\"\nEND\n"

---- codec::tests::encode_pk_sig stdout ----
2026-03-29T10:52:05.153933Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=pk-sig expected=SuccessOrError queue_depth=1

thread 'codec::tests::encode_pk_sig' (14220) panicked at openvpn-mgmt-codec\src\codec.rs:1464:9:
assertion `left == right` failed
  left: ""
 right: "pk-sig\nAAAA\nBBBB\nEND\n"

failures:
    codec::tests::encode_client_auth_empty_config
    codec::tests::encode_client_auth_with_config
    codec::tests::encode_pk_sig
    codec::tests::encode_rsa_sig

test result: FAILED. 357 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
