*** openvpn-mgmt-codec/src/codec.rs:633:19: replace == with != in write_block

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace == with != in write_block
@@ -625,17 +625,17 @@
     // slightly, but over-reserving is harmless — only written bytes count.
     let total: usize =
         header.len() + 1 + lines.iter().map(|line| line.len() + 2).sum::<usize>() + 4;
     dst.reserve(total);
     dst.put_slice(header.as_bytes());
     dst.put_u8(b'\n');
     for line in lines {
         let clean = wire_safe(line, "block body line", mode)?;
-        if *clean == *"END" {
+        if *clean != /* ~ changed by cargo-mutants ~ */ *"END" {
             match mode {
                 EncoderMode::Sanitize => {
                     dst.put_slice(b" END");
                     dst.put_u8(b'\n');
                     continue;
                 }
                 EncoderMode::Strict => {
                     return Err(io::Error::other(EncodeError::EndInBlockBody));

---- codec::tests::encode_client_auth_with_config stdout ----

thread 'codec::tests::encode_client_auth_with_config' (18312) panicked at openvpn-mgmt-codec\src\codec.rs:1391:9:
assertion `left == right` failed
  left: "client-auth 42 0\n END\n END\nEND\n"
 right: "client-auth 42 0\npush \"route 10.0.0.0 255.255.0.0\"\npush \"dhcp-option DNS 10.0.0.1\"\nEND\n"

---- codec::tests::encode_pk_sig stdout ----
2026-03-29T10:52:07.799005Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=pk-sig expected=SuccessOrError queue_depth=1

thread 'codec::tests::encode_pk_sig' (36320) panicked at openvpn-mgmt-codec\src\codec.rs:1487:9:
assertion `left == right` failed
  left: "pk-sig\n END\n END\nEND\n"
 right: "pk-sig\nAAAA\nBBBB\nEND\n"

---- codec::tests::encode_rsa_sig stdout ----
2026-03-29T10:52:07.799507Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=rsa-sig expected=SuccessOrError queue_depth=1

thread 'codec::tests::encode_rsa_sig' (36924) panicked at openvpn-mgmt-codec\src\codec.rs:1470:9:
assertion `left == right` failed
  left: "rsa-sig\n END\n END\nEND\n"
 right: "rsa-sig\nAAAA\nBBBB\nEND\n"

failures:
    codec::tests::encode_client_auth_with_config
    codec::tests::encode_pk_sig
    codec::tests::encode_rsa_sig

test result: FAILED. 367 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
