*** openvpn-mgmt-codec/src/codec.rs:680:41: replace == with != in <impl Decoder for OvpnCodec>::decode

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace == with != in <impl Decoder for OvpnCodec>::decode
@@ -672,17 +672,17 @@
                 // No complete line yet. Check for a password prompt
                 // without a trailing newline (OpenVPN ≥ 2.6 sends it as
                 // an interactive prompt with no line terminator).
                 // We accept any buffer that starts with the prompt text
                 // since no `\n` is present (checked above). Consume the
                 // prompt and any trailing `\r`.
                 if src.starts_with(PW_PROMPT) {
                     let mut consume = PW_PROMPT.len();
-                    if src.get(consume) == Some(&b'\r') {
+                    if src.get(consume) != /* ~ changed by cargo-mutants ~ */ Some(&b'\r') {
                         consume += 1;
                     }
                     src.advance(consume);
                     return Ok(Some(OvpnMessage::PasswordPrompt));
                 }
                 // Hint to Framed: reserve enough for a typical management
                 // protocol line so the next read_buf doesn't micro-allocate.
                 if src.capacity() - src.len() < 256 {

---- codec::tests::decode_password_prompt_with_cr_fully_consumes_buffer stdout ----

thread 'codec::tests::decode_password_prompt_with_cr_fully_consumes_buffer' (33336) panicked at openvpn-mgmt-codec\src\codec.rs:1782:9:
trailing \r was not consumed; 1 bytes remain

---- codec::tests::decode_password_prompt_no_newline_without_cr stdout ----

thread 'codec::tests::decode_password_prompt_no_newline_without_cr' (28080) panicked at C:\workspace\tools\cargo\registry\src\index.crates.io-1949cf8c6b5b557f\bytes-1.11.1\src\bytes_mut.rs:1156:9:
cannot advance past `remaining`: 16 <= 15

failures:
    codec::tests::decode_password_prompt_no_newline_without_cr
    codec::tests::decode_password_prompt_with_cr_fully_consumes_buffer

test result: FAILED. 368 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
