*** openvpn-mgmt-codec/src/codec.rs:681:33: replace += with *= in <impl Decoder for OvpnCodec>::decode

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace += with *= in <impl Decoder for OvpnCodec>::decode
@@ -673,17 +673,17 @@
                 // without a trailing newline (OpenVPN ≥ 2.6 sends it as
                 // an interactive prompt with no line terminator).
                 // We accept any buffer that starts with the prompt text
                 // since no `\n` is present (checked above). Consume the
                 // prompt and any trailing `\r`.
                 if src.starts_with(PW_PROMPT) {
                     let mut consume = PW_PROMPT.len();
                     if src.get(consume) == Some(&b'\r') {
-                        consume += 1;
+                        consume *= /* ~ changed by cargo-mutants ~ */ 1;
                     }
                     src.advance(consume);
                     return Ok(Some(OvpnMessage::PasswordPrompt));
                 }
                 // Hint to Framed: reserve enough for a typical management
                 // protocol line so the next read_buf doesn't micro-allocate.
                 if src.capacity() - src.len() < 256 {
                     src.reserve(256);

---- codec::tests::decode_password_prompt_with_cr_fully_consumes_buffer stdout ----

thread 'codec::tests::decode_password_prompt_with_cr_fully_consumes_buffer' (42624) panicked at openvpn-mgmt-codec\src\codec.rs:1782:9:
trailing \r was not consumed; 1 bytes remain

failures:
    codec::tests::decode_password_prompt_with_cr_fully_consumes_buffer

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
