*** openvpn-mgmt-codec/src/codec.rs:688:35: replace - with / in <impl Decoder for OvpnCodec>::decode

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace - with / in <impl Decoder for OvpnCodec>::decode
@@ -680,17 +680,17 @@
                     if src.get(consume) == Some(&b'\r') {
                         consume += 1;
                     }
                     src.advance(consume);
                     return Ok(Some(OvpnMessage::PasswordPrompt));
                 }
                 // Hint to Framed: reserve enough for a typical management
                 // protocol line so the next read_buf doesn't micro-allocate.
-                if src.capacity() - src.len() < 256 {
+                if src.capacity() / /* ~ changed by cargo-mutants ~ */ src.len() < 256 {
                     src.reserve(256);
                 }
                 return Ok(None); // Need more data.
             };
 
             // Extract the line and advance the buffer past the newline.
             let line_bytes = src.split_to(newline_pos + 1);
             let line = match std::str::from_utf8(&line_bytes) {

---- codec::tests::decode_bare_state_multiline stdout ----

thread 'codec::tests::decode_bare_state_multiline' (39496) panicked at openvpn-mgmt-codec\src\codec.rs:688:20:
attempt to divide by zero

---- codec::tests::decode_client_address_single_line stdout ----

thread 'codec::tests::decode_client_address_single_line' (14956) panicked at openvpn-mgmt-codec\src\codec.rs:688:20:
attempt to divide by zero

---- codec::tests::decode_client_connect_multiline_notification stdout ----

thread 'codec::tests::decode_client_connect_multiline_notification' (19796) panicked at openvpn-mgmt-codec\src\codec.rs:688:20:
attempt to divide by zero

failures:
    codec::tests::decode_bare_state_multiline
    codec::tests::decode_client_address_single_line
    codec::tests::decode_client_connect_multiline_notification
    codec::tests::decode_client_disconnect
    codec::tests::decode_empty_multiline
    codec::tests::decode_error
    codec::tests::decode_hold_notification
    codec::tests::decode_hold_query_success
    codec::tests::decode_info_notification
    codec::tests::decode_multiline_with_command_tracking
    codec::tests::decode_need_ok_notification
    codec::tests::decode_notification_during_multiline

test result: FAILED. 344 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
