*** openvpn-mgmt-codec/src/codec.rs:695:55: replace + with - in <impl Decoder for OvpnCodec>::decode

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace + with - in <impl Decoder for OvpnCodec>::decode
@@ -687,17 +687,17 @@
                 // protocol line so the next read_buf doesn't micro-allocate.
                 if src.capacity() - src.len() < 256 {
                     src.reserve(256);
                 }
                 return Ok(None); // Need more data.
             };
 
             // Extract the line and advance the buffer past the newline.
-            let line_bytes = src.split_to(newline_pos + 1);
+            let line_bytes = src.split_to(newline_pos - /* ~ changed by cargo-mutants ~ */ 1);
             let line = match std::str::from_utf8(&line_bytes) {
                 Ok(text) => text,
                 Err(error) => {
                     // Reset all accumulation state so the decoder doesn't
                     // remain stuck in a half-finished multi-line block.
                     self.multi_line_buf = None;
                     self.client_notification = None;
                     self.expected_queue.clear();

*** result: Timeout
