*** openvpn-mgmt-codec/src/codec.rs:719:20: delete ! in <impl Decoder for OvpnCodec>::decode

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete ! in <impl Decoder for OvpnCodec>::decode
@@ -711,17 +711,17 @@
             // decoder is not inside an accumulation context AND is not
             // expecting a multi-line response. Skip them silently rather
             // than emitting Unrecognized. This also absorbs the trailing
             // `\n` when the password prompt was already consumed without
             // a line terminator (OpenVPN ≥ 2.6).
             if line.is_empty()
                 && self.multi_line_buf.is_none()
                 && self.client_notification.is_none()
-                && !matches!(self.expected_front(), ResponseKind::MultiLine)
+                &&  /* ~ changed by cargo-mutants ~ */matches!(self.expected_front(), ResponseKind::MultiLine)
             {
                 continue;
             }
 
             // --- Phase 1: Multi-line >CLIENT: accumulation ---
             //
             // When we're accumulating a CLIENT notification, >CLIENT:ENV
             // lines belong to it. The block terminates with >CLIENT:ENV,END.

---- empty_line_does_not_break_subsequent_decoding stdout ----

thread 'empty_line_does_not_break_subsequent_decoding' (9232) panicked at openvpn-mgmt-codec\tests\decoder_recovery.rs:229:5:
assertion failed: matches!(msg, OvpnMessage::Success(_))

failures:
    empty_line_does_not_break_subsequent_decoding

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
