*** openvpn-mgmt-codec/src/codec.rs:735:25: replace == with != in <impl Decoder for OvpnCodec>::decode

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace == with != in <impl Decoder for OvpnCodec>::decode
@@ -727,17 +727,17 @@
             // lines belong to it. The block terminates with >CLIENT:ENV,END.
             // The spec guarantees atomicity for CLIENT notifications, so
             // interleaving here should not occur. Any other line (SUCCESS,
             // ERROR, other notifications) falls through to normal processing
             // as a defensive measure.
             if let Some(ref mut accum) = self.client_notification
                 && let Some(rest) = line.strip_prefix(">CLIENT:ENV,")
             {
-                if rest == "END" {
+                if rest != /* ~ changed by cargo-mutants ~ */ "END" {
                     let finished = self.client_notification.take().expect("guarded by if-let");
                     debug!(event = ?finished.event, cid = finished.cid, env_count = finished.env.len(), "decoded CLIENT notification");
                     return Ok(Some(OvpnMessage::Notification(Notification::Client {
                         event: finished.event,
                         cid: finished.cid,
                         kid: finished.kid,
                         env: finished.env,
                     })));

---- codec::tests::client_env_limit_exceeded stdout ----

thread 'codec::tests::client_env_limit_exceeded' (35872) panicked at openvpn-mgmt-codec\src\codec.rs:2046:9:
expected error when client ENV limit exceeded

---- codec::tests::decode_client_connect_multiline_notification stdout ----

thread 'codec::tests::decode_client_connect_multiline_notification' (26604) panicked at openvpn-mgmt-codec\src\codec.rs:1719:9:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::Client
    { event: ClientEvent::Connect, cid: 0, kid: Some(1), env, }) if env.len()
    == 2 && env.get("untrusted_ip").map(String::as_str) == Some("1.2.3.4") &&
    env.get("common_name").map(String::as_str) == Some("TestClient"))

---- codec::tests::decode_client_disconnect stdout ----

thread 'codec::tests::decode_client_disconnect' (41376) panicked at openvpn-mgmt-codec\src\codec.rs:1755:9:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::Client
    { event: ClientEvent::Disconnect, cid: 5, kid: None, env, }) if env.len()
    == 2)

failures:
    codec::tests::client_env_limit_exceeded
    codec::tests::decode_client_connect_multiline_notification
    codec::tests::decode_client_disconnect

test result: FAILED. 367 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
