*** openvpn-mgmt-codec/src/codec.rs:74:5: replace wire_safe -> Result<Cow<'a, str>, io::Error> with Ok(Cow::Owned("xyzzy".to_owned()))

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace wire_safe -> Result<Cow<'a, str>, io::Error> with Ok(Cow::Owned("xyzzy".to_owned()))
@@ -66,25 +66,17 @@
 ///
 /// In [`EncoderMode::Strict`]: returns `Err` if any unsafe characters
 /// are present.
 fn wire_safe<'a>(
     s: &'a str,
     field: &'static str,
     mode: EncoderMode,
 ) -> Result<Cow<'a, str>, io::Error> {
-    if !s.contains(WIRE_UNSAFE) {
-        return Ok(Cow::Borrowed(s));
-    }
-    match mode {
-        EncoderMode::Sanitize => Ok(Cow::Owned(
-            s.chars().filter(|chr| !WIRE_UNSAFE.contains(chr)).collect(),
-        )),
-        EncoderMode::Strict => Err(io::Error::other(EncodeError::UnsafeCharacters(field))),
-    }
+    Ok(Cow::Owned("xyzzy".to_owned())) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Backslash-escape `\` and `"` per the OpenVPN config-file lexer rules
 /// ("Command Parsing" section):
 ///   `\` → `\\`
 ///   `"` → `\"`
 ///
 /// This function performs *only* lexer escaping. Wire-safety validation

---- codec::tests::encode_client_pending_auth stdout ----

thread 'codec::tests::encode_client_pending_auth' (34660) panicked at openvpn-mgmt-codec\src\codec.rs:1424:9:
assertion `left == right` failed
  left: "client-pending-auth 42 1 xyzzy 120\n"
 right: "client-pending-auth 42 1 WEB_AUTH::https://example.com 120\n"

---- codec::tests::encode_client_auth_with_config stdout ----

thread 'codec::tests::encode_client_auth_with_config' (29780) panicked at openvpn-mgmt-codec\src\codec.rs:1383:9:
assertion `left == right` failed
  left: "client-auth 42 0\nxyzzy\nxyzzy\nEND\n"
 right: "client-auth 42 0\npush \"route 10.0.0.0 255.255.0.0\"\npush \"dhcp-option DNS 10.0.0.1\"\nEND\n"

---- codec::tests::encode_needok stdout ----
2026-03-29T10:50:36.128614Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=need-ok expected=SuccessOrError queue_depth=1

thread 'codec::tests::encode_needok' (1180) panicked at openvpn-mgmt-codec\src\codec.rs:1552:9:
assertion `left == right` failed
  left: "needok xyzzy ok\n"
 right: "needok token-insertion-request ok\n"

failures:
    codec::tests::encode_client_auth_with_config
    codec::tests::encode_client_deny_with_client_reason
    codec::tests::encode_client_pending_auth
    codec::tests::encode_client_pending_auth_long_extra_warns
    codec::tests::encode_needok
    codec::tests::encode_needstr
    codec::tests::encode_password_escaping
    codec::tests::encode_password_simple
    codec::tests::encode_pk_sig
    codec::tests::encode_proxy_http_nct
    codec::tests::encode_push_update_broad
    codec::tests::encode_push_update_cid

test result: FAILED. 352 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
