*** openvpn-mgmt-codec/src/codec.rs:74:8: delete ! in wire_safe

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete ! in wire_safe
@@ -66,17 +66,17 @@
 ///
 /// In [`EncoderMode::Strict`]: returns `Err` if any unsafe characters
 /// are present.
 fn wire_safe<'a>(
     s: &'a str,
     field: &'static str,
     mode: EncoderMode,
 ) -> Result<Cow<'a, str>, io::Error> {
-    if !s.contains(WIRE_UNSAFE) {
+    if  /* ~ changed by cargo-mutants ~ */s.contains(WIRE_UNSAFE) {
         return Ok(Cow::Borrowed(s));
     }
     match mode {
         EncoderMode::Sanitize => Ok(Cow::Owned(
             s.chars().filter(|chr| !WIRE_UNSAFE.contains(chr)).collect(),
         )),
         EncoderMode::Strict => Err(io::Error::other(EncodeError::UnsafeCharacters(field))),
     }

---- codec::tests::raw_multiline_sanitizes_newlines stdout ----
2026-03-29T10:50:43.996020Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=raw-multi-line expected=MultiLine queue_depth=1

thread 'codec::tests::raw_multiline_sanitizes_newlines' (26272) panicked at openvpn-mgmt-codec\src\codec.rs:1874:9:
assertion `left == right` failed
  left: "cmd\ninjected\n"
 right: "cmdinjected\n"

---- codec::tests::raw_multiline_strict_rejects_newlines stdout ----
2026-03-29T10:50:43.996134Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=raw-multi-line expected=MultiLine queue_depth=1

thread 'codec::tests::raw_multiline_strict_rejects_newlines' (10064) panicked at openvpn-mgmt-codec\src\codec.rs:1885:9:
assertion failed: result.is_err()

failures:
    codec::tests::raw_multiline_sanitizes_newlines
    codec::tests::raw_multiline_strict_rejects_newlines

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
