*** openvpn-mgmt-codec/src/codec.rs:79:36: delete ! in wire_safe

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete ! in wire_safe
@@ -71,17 +71,17 @@
     field: &'static str,
     mode: EncoderMode,
 ) -> Result<Cow<'a, str>, io::Error> {
     if !s.contains(WIRE_UNSAFE) {
         return Ok(Cow::Borrowed(s));
     }
     match mode {
         EncoderMode::Sanitize => Ok(Cow::Owned(
-            s.chars().filter(|chr| !WIRE_UNSAFE.contains(chr)).collect(),
+            s.chars().filter(|chr|  /* ~ changed by cargo-mutants ~ */WIRE_UNSAFE.contains(chr)).collect(),
         )),
         EncoderMode::Strict => Err(io::Error::other(EncodeError::UnsafeCharacters(field))),
     }
 }
 
 /// Backslash-escape `\` and `"` per the OpenVPN config-file lexer rules
 /// ("Command Parsing" section):
 ///   `\` → `\\`

---- codec::tests::raw_multiline_sanitizes_newlines stdout ----
2026-03-29T10:50:47.417235Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=raw-multi-line expected=MultiLine queue_depth=1

thread 'codec::tests::raw_multiline_sanitizes_newlines' (27496) panicked at openvpn-mgmt-codec\src\codec.rs:1874:9:
assertion `left == right` failed
  left: "\n\n"
 right: "cmdinjected\n"

failures:
    codec::tests::raw_multiline_sanitizes_newlines

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
