*** openvpn-mgmt-codec/src/codec.rs:810:21: replace == with != in <impl Decoder for OvpnCodec>::decode

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace == with != in <impl Decoder for OvpnCodec>::decode
@@ -802,17 +802,17 @@
             if let Some(rest) = line.strip_prefix("ERROR:") {
                 self.consume_expected();
                 return Ok(Some(OvpnMessage::Error(
                     rest.strip_prefix(' ').unwrap_or(rest).to_string(),
                 )));
             }
 
             // Management interface password prompt (no `>` prefix).
-            if line == "ENTER PASSWORD:" {
+            if line != /* ~ changed by cargo-mutants ~ */ "ENTER PASSWORD:" {
                 return Ok(Some(OvpnMessage::PasswordPrompt));
             }
 
             // Real-time notifications.
             if line.starts_with('>') {
                 if let Some(msg) = self.parse_notification(&line) {
                     return Ok(Some(msg));
                 }

---- client::tests::current_state_returns_single_entry stdout ----

thread 'client::tests::current_state_returns_single_entry' (44212) panicked at openvpn-mgmt-codec\src\client.rs:1089:50:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(PasswordPrompt)

---- client::tests::help_returns_lines stdout ----

thread 'client::tests::help_returns_lines' (34324) panicked at openvpn-mgmt-codec\src\client.rs:1024:41:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(PasswordPrompt)

---- client::tests::log_all_returns_history stdout ----

thread 'client::tests::log_all_returns_history' (43288) panicked at openvpn-mgmt-codec\src\client.rs:1110:55:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(PasswordPrompt)

failures:
    client::tests::current_state_returns_single_entry
    client::tests::help_returns_lines
    client::tests::log_all_returns_history
    client::tests::multiple_notification_subscribers
    client::tests::net_returns_lines
    client::tests::notifications_forwarded_during_command
    client::tests::raw_multi_line_returns_lines
    client::tests::remote_entry_count_returns_lines
    client::tests::remote_entry_get_returns_lines
    client::tests::state_returns_parsed_entries
    client::tests::state_stream_all_returns_parsed_history
    client::tests::status_raw_returns_lines

test result: FAILED. 327 passed; 34 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
