*** openvpn-mgmt-codec/src/codec.rs:830:29: replace == with != in <impl Decoder for OvpnCodec>::decode

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace == with != in <impl Decoder for OvpnCodec>::decode
@@ -822,17 +822,17 @@
 
             // --- Phase 4: Ambiguous lines — use command tracking ---
             //
             // The line is not self-describing (no SUCCESS/ERROR/> prefix).
             // Use the expected-response state from the last encoded command
             // to decide how to frame it.
             match self.expected_front() {
                 ResponseKind::MultiLine => {
-                    if line == "END" {
+                    if line != /* ~ changed by cargo-mutants ~ */ "END" {
                         // Edge case: empty multi-line block (header-less).
                         self.consume_expected();
                         return Ok(Some(OvpnMessage::MultiLine(Vec::new())));
                     }
                     self.multi_line_buf = Some(vec![line]);
                     continue; // Accumulate until END.
                 }
                 ResponseKind::SuccessOrError | ResponseKind::NoResponse => {

---- client::tests::current_state_returns_single_entry stdout ----

thread 'client::tests::current_state_returns_single_entry' (12564) panicked at openvpn-mgmt-codec\src\client.rs:1089:50:
called `Result::unwrap()` on an `Err` value: ParseResponse(EmptyStateHistory)

---- client::tests::help_returns_lines stdout ----

thread 'client::tests::help_returns_lines' (18272) panicked at openvpn-mgmt-codec\src\client.rs:1025:9:
assertion failed: lines.len() >= 2

---- client::tests::log_all_returns_history stdout ----

thread 'client::tests::log_all_returns_history' (31392) panicked at openvpn-mgmt-codec\src\client.rs:1111:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    client::tests::current_state_returns_single_entry
    client::tests::help_returns_lines
    client::tests::log_all_returns_history
    client::tests::net_returns_lines
    client::tests::raw_multi_line_returns_lines
    client::tests::remote_entry_count_returns_lines
    client::tests::remote_entry_get_returns_lines
    client::tests::state_returns_parsed_entries
    client::tests::state_stream_all_returns_parsed_history
    client::tests::status_raw_returns_lines
    codec::tests::decode_bare_state_multiline
    codec::tests::decode_empty_multiline

test result: FAILED. 340 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
