*** openvpn-mgmt-codec/src/codec.rs:870:17: replace == with != in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace == with != in OvpnCodec::parse_notification
@@ -862,17 +862,17 @@
                 line: line.to_string(),
                 kind: UnrecognizedKind::MalformedNotification,
             });
         };
 
         // >INFO: on the very first line is the connection banner — surface
         // it as OvpnMessage::Info. All subsequent >INFO: lines (e.g.
         // >INFO:WEB_AUTH::url) are routed to Notification::Info.
-        if kind == "INFO" {
+        if kind != /* ~ changed by cargo-mutants ~ */ "INFO" {
             if !self.seen_info {
                 self.seen_info = true;
                 return Some(OvpnMessage::Info(payload.to_string()));
             }
             return Some(OvpnMessage::Notification(Notification::Info {
                 message: payload.to_string(),
             }));
         }

---- client::tests::multiple_notification_subscribers stdout ----

thread 'client::tests::multiple_notification_subscribers' (46328) panicked at openvpn-mgmt-codec\src\client.rs:1203:39:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(Info("Waiting for hold release:5"))

---- client::tests::notifications_forwarded_during_command stdout ----

thread 'client::tests::notifications_forwarded_during_command' (35544) panicked at openvpn-mgmt-codec\src\client.rs:1180:38:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(Info("1024,2048"))

---- codec::tests::client_env_limit_exceeded stdout ----

thread 'codec::tests::client_env_limit_exceeded' (32516) panicked at openvpn-mgmt-codec\src\codec.rs:2046:9:
expected error when client ENV limit exceeded

failures:
    client::tests::multiple_notification_subscribers
    client::tests::notifications_forwarded_during_command
    codec::tests::client_env_limit_exceeded
    codec::tests::decode_client_address_single_line
    codec::tests::decode_client_connect_multiline_notification
    codec::tests::decode_client_disconnect
    codec::tests::decode_hold_notification
    codec::tests::decode_info_notification
    codec::tests::decode_need_ok_notification
    codec::tests::decode_notification_during_multiline
    codec::tests::decode_password_notification
    codec::tests::decode_state_notification

test result: FAILED. 356 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
