*** openvpn-mgmt-codec/src/codec.rs:871:16: delete ! in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete ! in OvpnCodec::parse_notification
@@ -863,17 +863,17 @@
                 kind: UnrecognizedKind::MalformedNotification,
             });
         };
 
         // >INFO: on the very first line is the connection banner — surface
         // it as OvpnMessage::Info. All subsequent >INFO: lines (e.g.
         // >INFO:WEB_AUTH::url) are routed to Notification::Info.
         if kind == "INFO" {
-            if !self.seen_info {
+            if  /* ~ changed by cargo-mutants ~ */self.seen_info {
                 self.seen_info = true;
                 return Some(OvpnMessage::Info(payload.to_string()));
             }
             return Some(OvpnMessage::Notification(Notification::Info {
                 message: payload.to_string(),
             }));
         }

---- codec::tests::decode_info_notification stdout ----

thread 'codec::tests::decode_info_notification' (32008) panicked at openvpn-mgmt-codec\src\codec.rs:1621:9:
assertion failed: matches!(&msgs[0], OvpnMessage::Info(s) if s ==
    "OpenVPN Management Interface Version 5")

failures:
    codec::tests::decode_info_notification

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
