*** openvpn-mgmt-codec/src/codec.rs:881:17: replace == with != in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace == with != in OvpnCodec::parse_notification
@@ -873,17 +873,17 @@
                 return Some(OvpnMessage::Info(payload.to_string()));
             }
             return Some(OvpnMessage::Notification(Notification::Info {
                 message: payload.to_string(),
             }));
         }
 
         // >CLIENT: may be multi-line. Inspect the sub-type to decide.
-        if kind == "CLIENT" {
+        if kind != /* ~ changed by cargo-mutants ~ */ "CLIENT" {
             let (event, args) = payload
                 .split_once(',')
                 .map(|(event_str, args_str)| (event_str.to_string(), args_str.to_string()))
                 .unwrap_or_else(|| (payload.to_string(), String::new()));
 
             // ADDRESS notifications are always single-line (no ENV block).
             if event == "ADDRESS" {
                 let mut parts = args.splitn(3, ',');

---- client::tests::multiple_notification_subscribers stdout ----

thread 'client::tests::multiple_notification_subscribers' (5984) panicked at openvpn-mgmt-codec\src\client.rs:1205:41:
called `Result::unwrap()` on an `Err` value: Empty

---- client::tests::notifications_forwarded_during_command stdout ----

thread 'client::tests::notifications_forwarded_during_command' (47524) panicked at openvpn-mgmt-codec\src\client.rs:1183:35:
called `Result::unwrap()` on an `Err` value: Empty

---- codec::tests::client_env_limit_exceeded stdout ----

thread 'codec::tests::client_env_limit_exceeded' (30080) panicked at openvpn-mgmt-codec\src\codec.rs:2046:9:
expected error when client ENV limit exceeded

failures:
    client::tests::multiple_notification_subscribers
    client::tests::notifications_forwarded_during_command
    codec::tests::client_env_limit_exceeded
    codec::tests::decode_client_address_single_line
    codec::tests::decode_client_connect_multiline_notification
    codec::tests::decode_client_disconnect
    codec::tests::decode_hold_notification
    codec::tests::decode_need_ok_notification
    codec::tests::decode_notification_during_multiline
    codec::tests::decode_password_notification
    codec::tests::decode_state_notification
    codec::tests::encode_during_client_notif_accumulation_warns_but_succeeds

test result: FAILED. 357 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
