*** openvpn-mgmt-codec/src/codec.rs:888:22: replace == with != in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace == with != in OvpnCodec::parse_notification
@@ -880,17 +880,17 @@
         // >CLIENT: may be multi-line. Inspect the sub-type to decide.
         if kind == "CLIENT" {
             let (event, args) = payload
                 .split_once(',')
                 .map(|(event_str, args_str)| (event_str.to_string(), args_str.to_string()))
                 .unwrap_or_else(|| (payload.to_string(), String::new()));
 
             // ADDRESS notifications are always single-line (no ENV block).
-            if event == "ADDRESS" {
+            if event != /* ~ changed by cargo-mutants ~ */ "ADDRESS" {
                 let mut parts = args.splitn(3, ',');
                 let cid = parts
                     .next()
                     .and_then(|field| parse_field(field, "client address cid"))
                     .unwrap_or(0);
                 let addr = parts.next().unwrap_or("").to_string();
                 let primary = parts.next() == Some("1");
                 return Some(OvpnMessage::Notification(Notification::ClientAddress {

---- codec::tests::client_env_limit_exceeded stdout ----

thread 'codec::tests::client_env_limit_exceeded' (43312) panicked at openvpn-mgmt-codec\src\codec.rs:2046:9:
expected error when client ENV limit exceeded

---- codec::tests::decode_client_address_single_line stdout ----

thread 'codec::tests::decode_client_address_single_line' (43184) panicked at openvpn-mgmt-codec\src\codec.rs:1735:9:
assertion `left == right` failed
  left: 0
 right: 1

---- codec::tests::decode_client_connect_multiline_notification stdout ----

thread 'codec::tests::decode_client_connect_multiline_notification' (32992) panicked at openvpn-mgmt-codec\src\codec.rs:1718:9:
assertion `left == right` failed
  left: 4
 right: 1

failures:
    codec::tests::client_env_limit_exceeded
    codec::tests::decode_client_address_single_line
    codec::tests::decode_client_connect_multiline_notification
    codec::tests::decode_client_disconnect
    codec::tests::encode_during_client_notif_accumulation_warns_but_succeeds
    codec::tests::utf8_error_resets_client_notif_state

test result: FAILED. 364 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
