*** openvpn-mgmt-codec/src/codec.rs:895:44: replace == with != in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace == with != in OvpnCodec::parse_notification
@@ -887,17 +887,17 @@
             // ADDRESS notifications are always single-line (no ENV block).
             if event == "ADDRESS" {
                 let mut parts = args.splitn(3, ',');
                 let cid = parts
                     .next()
                     .and_then(|field| parse_field(field, "client address cid"))
                     .unwrap_or(0);
                 let addr = parts.next().unwrap_or("").to_string();
-                let primary = parts.next() == Some("1");
+                let primary = parts.next() != /* ~ changed by cargo-mutants ~ */ Some("1");
                 return Some(OvpnMessage::Notification(Notification::ClientAddress {
                     cid,
                     addr,
                     primary,
                 }));
             }
 
             // CONNECT, REAUTH, ESTABLISHED, DISCONNECT, and CR_RESPONSE all

---- codec::tests::decode_client_address_single_line stdout ----

thread 'codec::tests::decode_client_address_single_line' (6616) panicked at openvpn-mgmt-codec\src\codec.rs:1736:9:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::ClientAddress
    { cid: 3, addr, primary: true, }) if addr == "10.0.0.5")

failures:
    codec::tests::decode_client_address_single_line

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
