*** openvpn-mgmt-codec/src/codec.rs:915:41: replace == with != in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace == with != in OvpnCodec::parse_notification
@@ -907,17 +907,17 @@
             let cid = id_parts
                 .next()
                 .and_then(|field| parse_field(field, "client cid"))
                 .unwrap_or(0);
             let kid = id_parts
                 .next()
                 .and_then(|field| parse_field(field, "client kid"));
 
-            let parsed_event = if event == "CR_RESPONSE" {
+            let parsed_event = if event != /* ~ changed by cargo-mutants ~ */ "CR_RESPONSE" {
                 let response = id_parts.next().unwrap_or("").to_string();
                 ClientEvent::CrResponse(response)
             } else {
                 event
                     .parse()
                     .inspect_err(|error| warn!(%error, "unknown client event"))
                     .unwrap_or_else(|_| ClientEvent::Unknown(event.clone()))
             };

---- codec::tests::decode_client_connect_multiline_notification stdout ----

thread 'codec::tests::decode_client_connect_multiline_notification' (32796) panicked at openvpn-mgmt-codec\src\codec.rs:1719:9:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::Client
    { event: ClientEvent::Connect, cid: 0, kid: Some(1), env, }) if env.len()
    == 2 && env.get("untrusted_ip").map(String::as_str) == Some("1.2.3.4") &&
    env.get("common_name").map(String::as_str) == Some("TestClient"))

---- codec::tests::decode_client_disconnect stdout ----

thread 'codec::tests::decode_client_disconnect' (31096) panicked at openvpn-mgmt-codec\src\codec.rs:1755:9:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::Client
    { event: ClientEvent::Disconnect, cid: 5, kid: None, env, }) if env.len()
    == 2)

failures:
    codec::tests::decode_client_connect_multiline_notification
    codec::tests::decode_client_disconnect

test result: FAILED. 368 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
