*** openvpn-mgmt-codec/src/codec.rs:937:13: delete match arm "STATE" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "STATE" in OvpnCodec::parse_notification
@@ -929,17 +929,17 @@
                 kid,
                 env: BTreeMap::new(),
             });
             return None; // Signal to the caller to keep reading.
         }
 
         // Dispatch to typed parsers. On parse failure, fall back to Simple.
         let notification = match kind {
-            "STATE" => parse_state(payload),
+             /* ~ changed by cargo-mutants ~ */
             "BYTECOUNT" => parse_bytecount(payload),
             "BYTECOUNT_CLI" => parse_bytecount_cli(payload),
             "LOG" => parse_log(payload),
             "ECHO" => parse_echo(payload),
             "HOLD" => Some(Notification::Hold {
                 text: payload.to_string(),
             }),
             "FATAL" => Some(Notification::Fatal {

---- codec::tests::decode_state_notification stdout ----

thread 'codec::tests::decode_state_notification' (5932) panicked at openvpn-mgmt-codec\src\codec.rs:1631:9:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::State
    {
        timestamp: 1234567890, name: OpenVpnState::Connected, description,
        local_ip, remote_ip, ..
    }) if description == "SUCCESS" && local_ip.is_empty() && remote_ip ==
    "10.0.0.1")

failures:
    codec::tests::decode_state_notification

test result: FAILED. 369 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
