*** openvpn-mgmt-codec/src/codec.rs:938:13: delete match arm "BYTECOUNT" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "BYTECOUNT" in OvpnCodec::parse_notification
@@ -930,17 +930,17 @@
                 env: BTreeMap::new(),
             });
             return None; // Signal to the caller to keep reading.
         }
 
         // Dispatch to typed parsers. On parse failure, fall back to Simple.
         let notification = match kind {
             "STATE" => parse_state(payload),
-            "BYTECOUNT" => parse_bytecount(payload),
+             /* ~ changed by cargo-mutants ~ */
             "BYTECOUNT_CLI" => parse_bytecount_cli(payload),
             "LOG" => parse_log(payload),
             "ECHO" => parse_echo(payload),
             "HOLD" => Some(Notification::Hold {
                 text: payload.to_string(),
             }),
             "FATAL" => Some(Notification::Fatal {
                 message: payload.to_string(),

---- client::tests::notifications_forwarded_during_command stdout ----

thread 'client::tests::notifications_forwarded_during_command' (3396) panicked at openvpn-mgmt-codec\src\client.rs:1184:9:
expected ByteCount, got Simple { kind: "BYTECOUNT", payload: "1024,2048" }

---- codec::tests::decode_notification_during_multiline stdout ----

thread 'codec::tests::decode_notification_during_multiline' (41336) panicked at openvpn-mgmt-codec\src\codec.rs:1696:9:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::ByteCount
    { bytes_in: 1000, bytes_out: 2000 }))

failures:
    client::tests::notifications_forwarded_during_command
    codec::tests::decode_notification_during_multiline

test result: FAILED. 368 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
