*** openvpn-mgmt-codec/src/codec.rs:939:13: delete match arm "BYTECOUNT_CLI" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "BYTECOUNT_CLI" in OvpnCodec::parse_notification
@@ -931,17 +931,17 @@
             });
             return None; // Signal to the caller to keep reading.
         }
 
         // Dispatch to typed parsers. On parse failure, fall back to Simple.
         let notification = match kind {
             "STATE" => parse_state(payload),
             "BYTECOUNT" => parse_bytecount(payload),
-            "BYTECOUNT_CLI" => parse_bytecount_cli(payload),
+             /* ~ changed by cargo-mutants ~ */
             "LOG" => parse_log(payload),
             "ECHO" => parse_echo(payload),
             "HOLD" => Some(Notification::Hold {
                 text: payload.to_string(),
             }),
             "FATAL" => Some(Notification::Fatal {
                 message: payload.to_string(),
             }),

---- real_world::bytecount_cli_realistic_server_data stdout ----

thread 'real_world::bytecount_cli_realistic_server_data' (22616) panicked at openvpn-mgmt-codec\tests\defensive\real_world.rs:891:18:
expected ByteCountCli, got: Notification(Simple { kind: "BYTECOUNT_CLI", payload: "0,52834567,9812345" })

failures:
    real_world::bytecount_cli_realistic_server_data

test result: FAILED. 132 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
