*** openvpn-mgmt-codec/src/codec.rs:93:5: replace escape -> String with String::new()

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace escape -> String with String::new()
@@ -85,25 +85,17 @@
 /// Backslash-escape `\` and `"` per the OpenVPN config-file lexer rules
 /// ("Command Parsing" section):
 ///   `\` → `\\`
 ///   `"` → `\"`
 ///
 /// This function performs *only* lexer escaping. Wire-safety validation
 /// or sanitization must happen upstream via [`wire_safe`].
 fn escape(s: &str) -> String {
-    let mut out = String::with_capacity(s.len());
-    for c in s.chars() {
-        match c {
-            '\\' => out.push_str("\\\\"),
-            '"' => out.push_str("\\\""),
-            _ => out.push(c),
-        }
-    }
-    out
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Wrap an already-escaped string in double quotes for the wire format.
 ///
 /// This is required for any user-supplied string that might contain
 /// whitespace, backslashes, or quotes — passwords, reason strings,
 /// needstr values, etc.
 fn quote(s: &str) -> String {

---- codec::tests::encode_client_deny_with_client_reason stdout ----

thread 'codec::tests::encode_client_deny_with_client_reason' (16908) panicked at openvpn-mgmt-codec\src\codec.rs:1410:9:
assertion `left == right` failed
  left: "client-deny 5 0 \"\" \"\"\n"
 right: "client-deny 5 0 \"cert revoked\" \"Your access has been revoked.\"\n"

---- codec::tests::encode_needstr stdout ----
2026-03-29T10:50:49.554930Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=need-str expected=SuccessOrError queue_depth=1

thread 'codec::tests::encode_needstr' (10048) panicked at openvpn-mgmt-codec\src\codec.rs:1561:9:
assertion `left == right` failed
  left: "needstr name \"\"\n"
 right: "needstr name \"John\"\n"

---- codec::tests::encode_password_escaping stdout ----
2026-03-29T10:50:49.555003Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=password expected=SuccessOrError queue_depth=1

thread 'codec::tests::encode_password_escaping' (33988) panicked at openvpn-mgmt-codec\src\codec.rs:1361:9:
assertion `left == right` failed
  left: "password \"\" \"\"\n"
 right: "password \"Private Key\" \"foo\\\\\\\"bar\"\n"

failures:
    codec::tests::encode_client_deny_with_client_reason
    codec::tests::encode_needstr
    codec::tests::encode_password_escaping
    codec::tests::encode_password_simple
    codec::tests::encode_push_update_broad
    codec::tests::encode_push_update_cid
    codec::tests::escape_and_quote_special_chars
    command::tests::parse_password_roundtrip_spaced_auth_types

test result: FAILED. 362 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
