*** openvpn-mgmt-codec/src/codec.rs:940:13: delete match arm "LOG" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "LOG" in OvpnCodec::parse_notification
@@ -932,17 +932,17 @@
             return None; // Signal to the caller to keep reading.
         }
 
         // Dispatch to typed parsers. On parse failure, fall back to Simple.
         let notification = match kind {
             "STATE" => parse_state(payload),
             "BYTECOUNT" => parse_bytecount(payload),
             "BYTECOUNT_CLI" => parse_bytecount_cli(payload),
-            "LOG" => parse_log(payload),
+             /* ~ changed by cargo-mutants ~ */
             "ECHO" => parse_echo(payload),
             "HOLD" => Some(Notification::Hold {
                 text: payload.to_string(),
             }),
             "FATAL" => Some(Notification::Fatal {
                 message: payload.to_string(),
             }),
             "PKCS11ID-COUNT" => parse_pkcs11id_count(payload),

---- log_empty_message stdout ----

thread 'log_empty_message' (47852) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:217:9:
expected Log

---- log_with_commas_in_message stdout ----

thread 'log_with_commas_in_message' (26776) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:197:9:
expected Log

---- log_unknown_level stdout ----

thread 'log_unknown_level' (9276) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:207:9:
expected Log

failures:
    log_empty_message
    log_unknown_level
    log_with_commas_in_message

test result: FAILED. 56 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
