*** openvpn-mgmt-codec/src/codec.rs:941:13: delete match arm "ECHO" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "ECHO" in OvpnCodec::parse_notification
@@ -933,17 +933,17 @@
         }
 
         // Dispatch to typed parsers. On parse failure, fall back to Simple.
         let notification = match kind {
             "STATE" => parse_state(payload),
             "BYTECOUNT" => parse_bytecount(payload),
             "BYTECOUNT_CLI" => parse_bytecount_cli(payload),
             "LOG" => parse_log(payload),
-            "ECHO" => parse_echo(payload),
+             /* ~ changed by cargo-mutants ~ */
             "HOLD" => Some(Notification::Hold {
                 text: payload.to_string(),
             }),
             "FATAL" => Some(Notification::Fatal {
                 message: payload.to_string(),
             }),
             "PKCS11ID-COUNT" => parse_pkcs11id_count(payload),
             "NEED-OK" => parse_need_ok(payload),

---- echo_with_commas stdout ----

thread 'echo_with_commas' (26780) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:243:9:
expected Echo

---- echo_empty_param stdout ----

thread 'echo_empty_param' (40640) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:253:9:
expected Echo

failures:
    echo_empty_param
    echo_with_commas

test result: FAILED. 57 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
