*** openvpn-mgmt-codec/src/codec.rs:942:13: delete match arm "HOLD" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "HOLD" in OvpnCodec::parse_notification
@@ -934,19 +934,17 @@
 
         // Dispatch to typed parsers. On parse failure, fall back to Simple.
         let notification = match kind {
             "STATE" => parse_state(payload),
             "BYTECOUNT" => parse_bytecount(payload),
             "BYTECOUNT_CLI" => parse_bytecount_cli(payload),
             "LOG" => parse_log(payload),
             "ECHO" => parse_echo(payload),
-            "HOLD" => Some(Notification::Hold {
-                text: payload.to_string(),
-            }),
+             /* ~ changed by cargo-mutants ~ */
             "FATAL" => Some(Notification::Fatal {
                 message: payload.to_string(),
             }),
             "PKCS11ID-COUNT" => parse_pkcs11id_count(payload),
             "NEED-OK" => parse_need_ok(payload),
             "NEED-STR" => parse_need_str(payload),
             "RSA_SIGN" => Some(Notification::RsaSign {
                 data: payload.to_string(),

---- client::tests::multiple_notification_subscribers stdout ----

thread 'client::tests::multiple_notification_subscribers' (20908) panicked at openvpn-mgmt-codec\src\client.rs:1205:9:
assertion failed: matches!(rx1.try_recv().unwrap(), Notification::Hold { .. })

---- codec::tests::decode_hold_notification stdout ----

thread 'codec::tests::decode_hold_notification' (38840) panicked at openvpn-mgmt-codec\src\codec.rs:1838:9:
assertion failed: matches!(&msgs[0], OvpnMessage::Notification(Notification::Hold { text }) if
    text == "Waiting for hold release")

failures:
    client::tests::multiple_notification_subscribers
    codec::tests::decode_hold_notification

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
