*** openvpn-mgmt-codec/src/codec.rs:945:13: delete match arm "FATAL" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "FATAL" in OvpnCodec::parse_notification
@@ -937,19 +937,17 @@
             "STATE" => parse_state(payload),
             "BYTECOUNT" => parse_bytecount(payload),
             "BYTECOUNT_CLI" => parse_bytecount_cli(payload),
             "LOG" => parse_log(payload),
             "ECHO" => parse_echo(payload),
             "HOLD" => Some(Notification::Hold {
                 text: payload.to_string(),
             }),
-            "FATAL" => Some(Notification::Fatal {
-                message: payload.to_string(),
-            }),
+             /* ~ changed by cargo-mutants ~ */
             "PKCS11ID-COUNT" => parse_pkcs11id_count(payload),
             "NEED-OK" => parse_need_ok(payload),
             "NEED-STR" => parse_need_str(payload),
             "RSA_SIGN" => Some(Notification::RsaSign {
                 data: payload.to_string(),
             }),
             "PK_SIGN" => parse_pk_sign(payload),
             "INFOMSG" => Some(Notification::InfoMsg {

---- real_world::fatal_tap_driver_error stdout ----

thread 'real_world::fatal_tap_driver_error' (28768) panicked at openvpn-mgmt-codec\tests\defensive\real_world.rs:1611:18:
expected Fatal, got: Notification(Simple { kind: "FATAL", payload: "There are no TAP-Windows adapters on this system." })

failures:
    real_world::fatal_tap_driver_error

test result: FAILED. 132 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
