*** openvpn-mgmt-codec/src/codec.rs:948:13: delete match arm "PKCS11ID-COUNT" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "PKCS11ID-COUNT" in OvpnCodec::parse_notification
@@ -940,17 +940,17 @@
             "LOG" => parse_log(payload),
             "ECHO" => parse_echo(payload),
             "HOLD" => Some(Notification::Hold {
                 text: payload.to_string(),
             }),
             "FATAL" => Some(Notification::Fatal {
                 message: payload.to_string(),
             }),
-            "PKCS11ID-COUNT" => parse_pkcs11id_count(payload),
+             /* ~ changed by cargo-mutants ~ */
             "NEED-OK" => parse_need_ok(payload),
             "NEED-STR" => parse_need_str(payload),
             "RSA_SIGN" => Some(Notification::RsaSign {
                 data: payload.to_string(),
             }),
             "PK_SIGN" => parse_pk_sign(payload),
             "INFOMSG" => Some(Notification::InfoMsg {
                 extra: payload.to_string(),

---- pkcs11_id_count_valid stdout ----

thread 'pkcs11_id_count_valid' (43280) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:510:5:
assertion failed: matches!(notification, Notification::Pkcs11IdCount { count: 3 })

---- pkcs11_id_count_zero stdout ----

thread 'pkcs11_id_count_zero' (19940) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:519:5:
assertion failed: matches!(notification, Notification::Pkcs11IdCount { count: 0 })

failures:
    pkcs11_id_count_valid
    pkcs11_id_count_zero

test result: FAILED. 57 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
