*** openvpn-mgmt-codec/src/codec.rs:949:13: delete match arm "NEED-OK" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "NEED-OK" in OvpnCodec::parse_notification
@@ -941,17 +941,17 @@
             "ECHO" => parse_echo(payload),
             "HOLD" => Some(Notification::Hold {
                 text: payload.to_string(),
             }),
             "FATAL" => Some(Notification::Fatal {
                 message: payload.to_string(),
             }),
             "PKCS11ID-COUNT" => parse_pkcs11id_count(payload),
-            "NEED-OK" => parse_need_ok(payload),
+             /* ~ changed by cargo-mutants ~ */
             "NEED-STR" => parse_need_str(payload),
             "RSA_SIGN" => Some(Notification::RsaSign {
                 data: payload.to_string(),
             }),
             "PK_SIGN" => parse_pk_sign(payload),
             "INFOMSG" => Some(Notification::InfoMsg {
                 extra: payload.to_string(),
             }),

---- codec::tests::decode_need_ok_notification stdout ----

thread 'codec::tests::decode_need_ok_notification' (44632) panicked at openvpn-mgmt-codec\src\codec.rs:1829:9:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::NeedOk { name, message }) if name
    == "token-insertion-request" && message == "Please insert your token")

failures:
    codec::tests::decode_need_ok_notification

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
