*** openvpn-mgmt-codec/src/codec.rs:950:13: delete match arm "NEED-STR" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "NEED-STR" in OvpnCodec::parse_notification
@@ -942,17 +942,17 @@
             "HOLD" => Some(Notification::Hold {
                 text: payload.to_string(),
             }),
             "FATAL" => Some(Notification::Fatal {
                 message: payload.to_string(),
             }),
             "PKCS11ID-COUNT" => parse_pkcs11id_count(payload),
             "NEED-OK" => parse_need_ok(payload),
-            "NEED-STR" => parse_need_str(payload),
+             /* ~ changed by cargo-mutants ~ */
             "RSA_SIGN" => Some(Notification::RsaSign {
                 data: payload.to_string(),
             }),
             "PK_SIGN" => parse_pk_sign(payload),
             "INFOMSG" => Some(Notification::InfoMsg {
                 extra: payload.to_string(),
             }),
             "NEED-CERTIFICATE" => Some(Notification::NeedCertificate {

---- need_str_valid stdout ----

thread 'need_str_valid' (14516) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:496:5:
assertion failed: matches!(notification, Notification::NeedStr { ref name, ref message } if name
    == "username" && message == "Enter username")

failures:
    need_str_valid

test result: FAILED. 58 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
