*** openvpn-mgmt-codec/src/codec.rs:951:13: delete match arm "RSA_SIGN" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "RSA_SIGN" in OvpnCodec::parse_notification
@@ -943,19 +943,17 @@
                 text: payload.to_string(),
             }),
             "FATAL" => Some(Notification::Fatal {
                 message: payload.to_string(),
             }),
             "PKCS11ID-COUNT" => parse_pkcs11id_count(payload),
             "NEED-OK" => parse_need_ok(payload),
             "NEED-STR" => parse_need_str(payload),
-            "RSA_SIGN" => Some(Notification::RsaSign {
-                data: payload.to_string(),
-            }),
+             /* ~ changed by cargo-mutants ~ */
             "PK_SIGN" => parse_pk_sign(payload),
             "INFOMSG" => Some(Notification::InfoMsg {
                 extra: payload.to_string(),
             }),
             "NEED-CERTIFICATE" => Some(Notification::NeedCertificate {
                 hint: payload.to_string(),
             }),
             "REMOTE" => parse_remote(payload),

---- rsa_sign_preserves_data stdout ----

thread 'rsa_sign_preserves_data' (32092) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:579:5:
assertion failed: matches!(notification, Notification::RsaSign { ref data } if data ==
    "AQID/base64data==")

failures:
    rsa_sign_preserves_data

test result: FAILED. 58 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
