*** openvpn-mgmt-codec/src/codec.rs:954:13: delete match arm "PK_SIGN" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "PK_SIGN" in OvpnCodec::parse_notification
@@ -946,17 +946,17 @@
                 message: payload.to_string(),
             }),
             "PKCS11ID-COUNT" => parse_pkcs11id_count(payload),
             "NEED-OK" => parse_need_ok(payload),
             "NEED-STR" => parse_need_str(payload),
             "RSA_SIGN" => Some(Notification::RsaSign {
                 data: payload.to_string(),
             }),
-            "PK_SIGN" => parse_pk_sign(payload),
+             /* ~ changed by cargo-mutants ~ */
             "INFOMSG" => Some(Notification::InfoMsg {
                 extra: payload.to_string(),
             }),
             "NEED-CERTIFICATE" => Some(Notification::NeedCertificate {
                 hint: payload.to_string(),
             }),
             "REMOTE" => parse_remote(payload),
             "PROXY" => parse_proxy(payload),

---- real_world::pk_sign_with_algorithm_parsed stdout ----

thread 'real_world::pk_sign_with_algorithm_parsed' (31124) panicked at openvpn-mgmt-codec\tests\defensive\real_world.rs:351:5:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::PkSign
    { data, algorithm: Some(algo), }) if data == "AABBCCDD==" && algo ==
    "RSA_PKCS1_PSS_PADDING")

---- real_world::pk_sign_with_ecdsa_algorithm stdout ----

thread 'real_world::pk_sign_with_ecdsa_algorithm' (30580) panicked at openvpn-mgmt-codec\tests\defensive\real_world.rs:1279:5:
assertion failed: matches!(&msgs[0],
    OvpnMessage::Notification(Notification::PkSign
    { data, algorithm: Some(algo), }) if data == "EEFF0011==" && algo ==
    "ECDSA")

---- real_world::pk_sign_with_pss_padding_and_hash_params stdout ----

thread 'real_world::pk_sign_with_pss_padding_and_hash_params' (4392) panicked at openvpn-mgmt-codec\tests\defensive\real_world.rs:1271:18:
expected PkSign, got: Notification(Simple { kind: "PK_SIGN", payload: "AABBCCDD==,RSA_PKCS1_PSS_PADDING,hashalg=SHA256,saltlen=max" })

failures:
    real_world::pk_sign_with_algorithm_parsed
    real_world::pk_sign_with_ecdsa_algorithm
    real_world::pk_sign_with_large_base64_payload
    real_world::pk_sign_with_pss_padding_and_hash_params
    real_world::pk_sign_without_algorithm_parsed

test result: FAILED. 128 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
