*** openvpn-mgmt-codec/src/codec.rs:955:13: delete match arm "INFOMSG" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "INFOMSG" in OvpnCodec::parse_notification
@@ -947,19 +947,17 @@
             }),
             "PKCS11ID-COUNT" => parse_pkcs11id_count(payload),
             "NEED-OK" => parse_need_ok(payload),
             "NEED-STR" => parse_need_str(payload),
             "RSA_SIGN" => Some(Notification::RsaSign {
                 data: payload.to_string(),
             }),
             "PK_SIGN" => parse_pk_sign(payload),
-            "INFOMSG" => Some(Notification::InfoMsg {
-                extra: payload.to_string(),
-            }),
+             /* ~ changed by cargo-mutants ~ */
             "NEED-CERTIFICATE" => Some(Notification::NeedCertificate {
                 hint: payload.to_string(),
             }),
             "REMOTE" => parse_remote(payload),
             "PROXY" => parse_proxy(payload),
             "PASSWORD" => parse_password(payload),
             "PKCS11ID-ENTRY" => {
                 return parse_pkcs11id_entry_notif(payload).or_else(|| {

---- real_world::infomsg_web_auth_is_first_class stdout ----

thread 'real_world::infomsg_web_auth_is_first_class' (42492) panicked at openvpn-mgmt-codec\tests\defensive\real_world.rs:336:18:
expected InfoMsg, got: Notification(Simple { kind: "INFOMSG", payload: "WEB_AUTH::https://auth.example.com/verify?session=abc123" })

failures:
    real_world::infomsg_web_auth_is_first_class

test result: FAILED. 132 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
