*** openvpn-mgmt-codec/src/codec.rs:958:13: delete match arm "NEED-CERTIFICATE" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "NEED-CERTIFICATE" in OvpnCodec::parse_notification
@@ -950,19 +950,17 @@
             "NEED-STR" => parse_need_str(payload),
             "RSA_SIGN" => Some(Notification::RsaSign {
                 data: payload.to_string(),
             }),
             "PK_SIGN" => parse_pk_sign(payload),
             "INFOMSG" => Some(Notification::InfoMsg {
                 extra: payload.to_string(),
             }),
-            "NEED-CERTIFICATE" => Some(Notification::NeedCertificate {
-                hint: payload.to_string(),
-            }),
+             /* ~ changed by cargo-mutants ~ */
             "REMOTE" => parse_remote(payload),
             "PROXY" => parse_proxy(payload),
             "PASSWORD" => parse_password(payload),
             "PKCS11ID-ENTRY" => {
                 return parse_pkcs11id_entry_notif(payload).or_else(|| {
                     Some(OvpnMessage::Notification(Notification::Simple {
                         kind: kind.to_string(),
                         payload: payload.to_string(),

---- notification_interleaved_in_multiline_is_safe stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: Saving this and future failures in C:\Users\RBACHM~1\AppData\Local\Temp\cargo-mutants-ovpn-mgmt-codec-AxKYiK.tmp\openvpn-mgmt-codec\tests\proptest_roundtrip.proptest-regressions
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc a18d9740eac82913f39a64afa7527c237236c0fdca8fe96492b093348d359a07

thread 'notification_interleaved_in_multiline_is_safe' (33920) panicked at openvpn-mgmt-codec\tests\proptest_roundtrip.rs:1072:1:
Test failed: assertion failed: `(left == right)` 
  left: `Notification(Simple { kind: "NEED-CERTIFICATE", payload: "" })`,
 right: `Notification(NeedCertif

failures:
    notification_interleaved_in_multiline_is_safe

test result: FAILED. 34 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.71s

*** result: Failure(101)
