*** openvpn-mgmt-codec/src/codec.rs:961:13: delete match arm "REMOTE" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "REMOTE" in OvpnCodec::parse_notification
@@ -953,17 +953,17 @@
             }),
             "PK_SIGN" => parse_pk_sign(payload),
             "INFOMSG" => Some(Notification::InfoMsg {
                 extra: payload.to_string(),
             }),
             "NEED-CERTIFICATE" => Some(Notification::NeedCertificate {
                 hint: payload.to_string(),
             }),
-            "REMOTE" => parse_remote(payload),
+             /* ~ changed by cargo-mutants ~ */
             "PROXY" => parse_proxy(payload),
             "PASSWORD" => parse_password(payload),
             "PKCS11ID-ENTRY" => {
                 return parse_pkcs11id_entry_notif(payload).or_else(|| {
                     Some(OvpnMessage::Notification(Notification::Simple {
                         kind: kind.to_string(),
                         payload: payload.to_string(),
                     }))

---- remote_valid stdout ----

thread 'remote_valid' (21732) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:435:5:
assertion failed: matches!(notification, Notification::Remote { port: 1194, .. })

failures:
    remote_valid

test result: FAILED. 58 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
