*** openvpn-mgmt-codec/src/codec.rs:962:13: delete match arm "PROXY" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "PROXY" in OvpnCodec::parse_notification
@@ -954,17 +954,17 @@
             "PK_SIGN" => parse_pk_sign(payload),
             "INFOMSG" => Some(Notification::InfoMsg {
                 extra: payload.to_string(),
             }),
             "NEED-CERTIFICATE" => Some(Notification::NeedCertificate {
                 hint: payload.to_string(),
             }),
             "REMOTE" => parse_remote(payload),
-            "PROXY" => parse_proxy(payload),
+             /* ~ changed by cargo-mutants ~ */
             "PASSWORD" => parse_password(payload),
             "PKCS11ID-ENTRY" => {
                 return parse_pkcs11id_entry_notif(payload).or_else(|| {
                     Some(OvpnMessage::Notification(Notification::Simple {
                         kind: kind.to_string(),
                         payload: payload.to_string(),
                     }))
                 });

---- proxy_valid stdout ----

thread 'proxy_valid' (31028) panicked at openvpn-mgmt-codec\tests\notification_edge_cases.rs:456:5:
assertion failed: matches!(notification, Notification::Proxy { index: 1, .. })

failures:
    proxy_valid

test result: FAILED. 58 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
