*** openvpn-mgmt-codec/src/codec.rs:964:13: delete match arm "PKCS11ID-ENTRY" in OvpnCodec::parse_notification

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm "PKCS11ID-ENTRY" in OvpnCodec::parse_notification
@@ -956,24 +956,17 @@
                 extra: payload.to_string(),
             }),
             "NEED-CERTIFICATE" => Some(Notification::NeedCertificate {
                 hint: payload.to_string(),
             }),
             "REMOTE" => parse_remote(payload),
             "PROXY" => parse_proxy(payload),
             "PASSWORD" => parse_password(payload),
-            "PKCS11ID-ENTRY" => {
-                return parse_pkcs11id_entry_notif(payload).or_else(|| {
-                    Some(OvpnMessage::Notification(Notification::Simple {
-                        kind: kind.to_string(),
-                        payload: payload.to_string(),
-                    }))
-                });
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         };
 
         Some(OvpnMessage::Notification(notification.unwrap_or(
             Notification::Simple {
                 kind: kind.to_string(),
                 payload: payload.to_string(),
             },

---- real_world::pkcs11id_entry_with_realistic_token_data stdout ----

thread 'real_world::pkcs11id_entry_with_realistic_token_data' (35564) panicked at openvpn-mgmt-codec\tests\defensive\real_world.rs:857:18:
expected Pkcs11IdEntry, got: Notification(Simple { kind: "PKCS11ID-ENTRY", payload: "'0', ID:'pkcs11:model=SoftHSM%20v2;manufacturer=SoftHSM%20project;serial=a1b2c3d4e5f6;token=My%20Token;id=%01%02%03;object=my-cert;type=cert', BLOB:'MIICpDCCAYwCCQDU+pQ4pHgSpDANBgkqhkiG9w0BAQsFADAU'" })

failures:
    real_world::pkcs11id_entry_with_realistic_token_data

test result: FAILED. 132 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
