*** openvpn-mgmt-codec/src/codec.rs:96:13: delete match arm '\\' in escape

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm '\\' in escape
@@ -88,17 +88,17 @@
 ///   `"` → `\"`
 ///
 /// This function performs *only* lexer escaping. Wire-safety validation
 /// or sanitization must happen upstream via [`wire_safe`].
 fn escape(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     for c in s.chars() {
         match c {
-            '\\' => out.push_str("\\\\"),
+             /* ~ changed by cargo-mutants ~ */
             '"' => out.push_str("\\\""),
             _ => out.push(c),
         }
     }
     out
 }
 
 /// Wrap an already-escaped string in double quotes for the wire format.

---- codec::tests::encode_password_escaping stdout ----
2026-03-29T10:51:00.302811Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=password expected=SuccessOrError queue_depth=1

thread 'codec::tests::encode_password_escaping' (33568) panicked at openvpn-mgmt-codec\src\codec.rs:1369:9:
assertion `left == right` failed
  left: "password \"Private Key\" \"foo\\\\\"bar\"\n"
 right: "password \"Private Key\" \"foo\\\\\\\"bar\"\n"

---- codec::tests::escape_and_quote_special_chars stdout ----

thread 'codec::tests::escape_and_quote_special_chars' (24388) panicked at openvpn-mgmt-codec\src\codec.rs:1811:9:
assertion `left == right` failed
  left: "\"a\\b\""
 right: "\"a\\\\b\""

failures:
    codec::tests::encode_password_escaping
    codec::tests::escape_and_quote_special_chars

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
