*** openvpn-mgmt-codec/src/codec.rs:97:13: delete match arm '"' in escape

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ delete match arm '"' in escape
@@ -89,17 +89,17 @@
 ///
 /// This function performs *only* lexer escaping. Wire-safety validation
 /// or sanitization must happen upstream via [`wire_safe`].
 fn escape(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     for c in s.chars() {
         match c {
             '\\' => out.push_str("\\\\"),
-            '"' => out.push_str("\\\""),
+             /* ~ changed by cargo-mutants ~ */
             _ => out.push(c),
         }
     }
     out
 }
 
 /// Wrap an already-escaped string in double quotes for the wire format.
 ///

---- codec::tests::encode_password_escaping stdout ----
2026-03-29T10:51:03.425156Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=password expected=SuccessOrError queue_depth=1

thread 'codec::tests::encode_password_escaping' (43332) panicked at openvpn-mgmt-codec\src\codec.rs:1369:9:
assertion `left == right` failed
  left: "password \"Private Key\" \"foo\\\\\"bar\"\n"
 right: "password \"Private Key\" \"foo\\\\\\\"bar\"\n"

---- codec::tests::escape_and_quote_special_chars stdout ----

thread 'codec::tests::escape_and_quote_special_chars' (36032) panicked at openvpn-mgmt-codec\src\codec.rs:1810:9:
assertion `left == right` failed
  left: "\"foo\"bar\""
 right: "\"foo\\\"bar\""

failures:
    codec::tests::encode_password_escaping
    codec::tests::escape_and_quote_special_chars

test result: FAILED. 368 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
