*** openvpn-mgmt-codec/src/codec.rs:995:5: replace parse_optional_port -> Option<u16> with Some(1)

*** mutation diff:
--- openvpn-mgmt-codec/src/codec.rs
+++ replace parse_optional_port -> Option<u16> with Some(1)
@@ -987,26 +987,17 @@
 // fall back to Simple". This is intentional — the protocol varies
 // across OpenVPN versions and we never want a parse failure to
 // produce an error.
 
 /// Parse a port field that may be empty. Empty or whitespace-only strings
 /// yield `None`; non-empty non-numeric strings also yield `None` (the STATE
 /// notification degrades gracefully via the caller's `?` on other fields).
 fn parse_optional_port(input: &str) -> Option<u16> {
-    let trimmed = input.trim();
-    if trimmed.is_empty() {
-        return None;
-    }
-    trimmed
-        .parse()
-        .inspect_err(
-            |error| warn!(%error, port = trimmed, "non-numeric port in STATE notification"),
-        )
-        .ok()
+    Some(1) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse a string into `T`, logging a warning on failure and returning `None`.
 ///
 /// Used by the notification parsers that degrade to `Notification::Simple`
 /// rather than failing hard.
 fn parse_field<T: std::str::FromStr>(value: &str, field: &str) -> Option<T>
 where

---- real_world::state_all_fields_empty_trailing_commas stdout ----

thread 'real_world::state_all_fields_empty_trailing_commas' (42760) panicked at openvpn-mgmt-codec\tests\defensive\real_world.rs:44:13:
assertion `left == right` failed
  left: Some(1)
 right: None

---- real_world::state_with_hostname_as_remote stdout ----

thread 'real_world::state_with_hostname_as_remote' (21724) panicked at openvpn-mgmt-codec\tests\defensive\real_world.rs:1631:13:
assertion `left == right` failed
  left: Some(1)
 right: Some(1194)

failures:
    real_world::state_all_fields_empty_trailing_commas
    real_world::state_with_hostname_as_remote

test result: FAILED. 131 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
