*** openvpn-mgmt-codec/src/command.rs:1035:13: delete match arm "cr-response" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "cr-response" in <impl FromStr for OvpnCommand>::from_str
@@ -1027,24 +1027,17 @@
                     extra,
                     timeout,
                 })
             }
 
             // Wire format per management-notes.txt:
             //   cr-response <base64-response>
             // https://github.com/OpenVPN/openvpn/blob/master/doc/management-notes.txt
-            "cr-response" => {
-                let (response, _) = next_token(args).ok_or(CommandParseError::MissingArgs(
-                    "usage: cr-response <response>",
-                ))?;
-                Ok(Self::CrResponse {
-                    response: Redacted::new(response),
-                })
-            }
+             /* ~ changed by cargo-mutants ~ */
 
             // --- Raw multi-line ---
             "raw-ml" => {
                 if args.is_empty() {
                     return cmd_err("usage: raw-ml <command>");
                 }
                 Ok(Self::RawMultiLine(args.to_string()))
             }

---- command::tests::parse_cr_response stdout ----

thread 'command::tests::parse_cr_response' (29788) panicked at openvpn-mgmt-codec\src\command.rs:2026:9:
assertion `left == right` failed
  left: Raw("cr-response dGVzdA==")
 right: CrResponse { response: <redacted> }

---- command::tests::parse_cr_response_missing_arg stdout ----

thread 'command::tests::parse_cr_response_missing_arg' (5420) panicked at openvpn-mgmt-codec\src\command.rs:2036:9:
assertion failed: "cr-response".parse::<OvpnCommand>().is_err()

failures:
    command::tests::parse_cr_response
    command::tests::parse_cr_response_missing_arg

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
