*** openvpn-mgmt-codec/src/command.rs:1045:13: delete match arm "raw-ml" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "raw-ml" in <impl FromStr for OvpnCommand>::from_str
@@ -1037,22 +1037,17 @@
                     "usage: cr-response <response>",
                 ))?;
                 Ok(Self::CrResponse {
                     response: Redacted::new(response),
                 })
             }
 
             // --- Raw multi-line ---
-            "raw-ml" => {
-                if args.is_empty() {
-                    return cmd_err("usage: raw-ml <command>");
-                }
-                Ok(Self::RawMultiLine(args.to_string()))
-            }
+             /* ~ changed by cargo-mutants ~ */
 
             // --- Lifecycle ---
             "exit" => Ok(Self::Exit),
             "quit" => Ok(Self::Quit),
 
             // --- Fallback: send as raw command ---
             _ => Ok(Self::Raw(line.to_string())),
         }

---- command::tests::parse_raw_ml stdout ----

thread 'command::tests::parse_raw_ml' (34656) panicked at openvpn-mgmt-codec\src\command.rs:1663:9:
assertion `left == right` failed
  left: Ok(Raw("raw-ml some-cmd"))
 right: Ok(RawMultiLine("some-cmd"))

failures:
    command::tests::parse_raw_ml

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
