*** openvpn-mgmt-codec/src/command.rs:1053:13: delete match arm "exit" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "exit" in <impl FromStr for OvpnCommand>::from_str
@@ -1045,17 +1045,17 @@
             "raw-ml" => {
                 if args.is_empty() {
                     return cmd_err("usage: raw-ml <command>");
                 }
                 Ok(Self::RawMultiLine(args.to_string()))
             }
 
             // --- Lifecycle ---
-            "exit" => Ok(Self::Exit),
+             /* ~ changed by cargo-mutants ~ */
             "quit" => Ok(Self::Quit),
 
             // --- Fallback: send as raw command ---
             _ => Ok(Self::Raw(line.to_string())),
         }
     }
 }

---- command::tests::parse_simple_commands stdout ----

thread 'command::tests::parse_simple_commands' (37016) panicked at openvpn-mgmt-codec\src\command.rs:1242:9:
assertion `left == right` failed
  left: Ok(Raw("exit"))
 right: Ok(Exit)

failures:
    command::tests::parse_simple_commands

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
