*** openvpn-mgmt-codec/src/command.rs:1054:13: delete match arm "quit" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "quit" in <impl FromStr for OvpnCommand>::from_str
@@ -1046,17 +1046,17 @@
                 if args.is_empty() {
                     return cmd_err("usage: raw-ml <command>");
                 }
                 Ok(Self::RawMultiLine(args.to_string()))
             }
 
             // --- Lifecycle ---
             "exit" => Ok(Self::Exit),
-            "quit" => Ok(Self::Quit),
+             /* ~ changed by cargo-mutants ~ */
 
             // --- Fallback: send as raw command ---
             _ => Ok(Self::Raw(line.to_string())),
         }
     }
 }
 
 /// The standard startup sequence that most management clients send after

---- command::tests::parse_simple_commands stdout ----

thread 'command::tests::parse_simple_commands' (11636) panicked at openvpn-mgmt-codec\src\command.rs:1243:9:
assertion `left == right` failed
  left: Ok(Raw("quit"))
 right: Ok(Quit)

failures:
    command::tests::parse_simple_commands

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
