*** openvpn-mgmt-codec/src/command.rs:1130:5: replace connection_sequence -> Vec<OvpnCommand> with vec![]

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ replace connection_sequence -> Vec<OvpnCommand> with vec![]
@@ -1122,26 +1122,17 @@
 ///
 /// for cmd in connection_sequence(5) {
 ///     framed.send(cmd).await?;
 /// }
 /// # Ok(())
 /// # }
 /// ```
 pub fn connection_sequence(bytecount_interval: u32) -> Vec<OvpnCommand> {
-    let mut cmds = vec![
-        OvpnCommand::Log(StreamMode::OnAll),
-        OvpnCommand::StateStream(StreamMode::OnAll),
-        OvpnCommand::Pid,
-    ];
-    if bytecount_interval > 0 {
-        cmds.push(OvpnCommand::ByteCount(bytecount_interval));
-    }
-    cmds.push(OvpnCommand::HoldRelease);
-    cmds
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Standard startup sequence for **server-mode** management clients.
 ///
 /// Returns the commands that a management program typically sends when
 /// OpenVPN connects with `--management-client`. This covers the same
 /// basics as [`connection_sequence`] (log/state streaming, PID, bytecount,
 /// hold release) and additionally sets the `>CLIENT:ENV` filter level so

---- command::tests::connection_sequence_with_bytecount stdout ----

thread 'command::tests::connection_sequence_with_bytecount' (31912) panicked at openvpn-mgmt-codec\src\command.rs:1196:9:
assertion `left == right` failed
  left: []
 right: [Log(OnAll), StateStream(OnAll), Pid, ByteCount(5), HoldRelease]

---- command::tests::connection_sequence_without_bytecount stdout ----

thread 'command::tests::connection_sequence_without_bytecount' (33380) panicked at openvpn-mgmt-codec\src\command.rs:1211:9:
assertion `left == right` failed
  left: []
 right: [Log(OnAll), StateStream(OnAll), Pid, HoldRelease]

failures:
    command::tests::connection_sequence_with_bytecount
    command::tests::connection_sequence_without_bytecount

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
