*** openvpn-mgmt-codec/src/command.rs:1135:27: replace > with == in connection_sequence

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ replace > with == in connection_sequence
@@ -1127,17 +1127,17 @@
 /// # }
 /// ```
 pub fn connection_sequence(bytecount_interval: u32) -> Vec<OvpnCommand> {
     let mut cmds = vec![
         OvpnCommand::Log(StreamMode::OnAll),
         OvpnCommand::StateStream(StreamMode::OnAll),
         OvpnCommand::Pid,
     ];
-    if bytecount_interval > 0 {
+    if bytecount_interval == /* ~ changed by cargo-mutants ~ */ 0 {
         cmds.push(OvpnCommand::ByteCount(bytecount_interval));
     }
     cmds.push(OvpnCommand::HoldRelease);
     cmds
 }
 
 /// Standard startup sequence for **server-mode** management clients.
 ///

---- command::tests::connection_sequence_with_bytecount stdout ----

thread 'command::tests::connection_sequence_with_bytecount' (43024) panicked at openvpn-mgmt-codec\src\command.rs:1205:9:
assertion `left == right` failed
  left: [Log(OnAll), StateStream(OnAll), Pid, HoldRelease]
 right: [Log(OnAll), StateStream(OnAll), Pid, ByteCount(5), HoldRelease]

---- command::tests::connection_sequence_without_bytecount stdout ----

thread 'command::tests::connection_sequence_without_bytecount' (7852) panicked at openvpn-mgmt-codec\src\command.rs:1220:9:
assertion `left == right` failed
  left: [Log(OnAll), StateStream(OnAll), Pid, ByteCount(0), HoldRelease]
 right: [Log(OnAll), StateStream(OnAll), Pid, HoldRelease]

failures:
    command::tests::connection_sequence_with_bytecount
    command::tests::connection_sequence_without_bytecount

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
