*** openvpn-mgmt-codec/src/command.rs:1171:5: replace server_connection_sequence -> Vec<OvpnCommand> with vec![]

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ replace server_connection_sequence -> Vec<OvpnCommand> with vec![]
@@ -1163,27 +1163,17 @@
 ///
 /// let cmds = server_connection_sequence(5, 0);
 ///
 /// // Contains env-filter for server-mode client notifications.
 /// assert!(cmds.iter().any(|cmd| matches!(cmd, OvpnCommand::EnvFilter(0))));
 /// assert!(cmds.iter().any(|cmd| matches!(cmd, OvpnCommand::HoldRelease)));
 /// ```
 pub fn server_connection_sequence(bytecount_interval: u32, env_filter: u32) -> Vec<OvpnCommand> {
-    let mut cmds = vec![
-        OvpnCommand::Log(StreamMode::OnAll),
-        OvpnCommand::StateStream(StreamMode::OnAll),
-        OvpnCommand::Pid,
-        OvpnCommand::EnvFilter(env_filter),
-    ];
-    if bytecount_interval > 0 {
-        cmds.push(OvpnCommand::ByteCount(bytecount_interval));
-    }
-    cmds.push(OvpnCommand::HoldRelease);
-    cmds
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn into_static_str_labels() {

error: doctest failed, to rerun pass `-p openvpn-mgmt-codec --doc`

---- openvpn-mgmt-codec\src\command.rs - command::server_connection_sequence (line 1160) stdout ----
Test executable failed (exit status: 101).

stderr:

thread 'main' (5748) panicked at C:\Users\RBACHM~1\AppData\Local\Temp\rustdoctestTEEp64\doctest_bundle_2024.rs:154:1:
assertion failed: cmds.iter().any(|cmd| matches!(cmd, OvpnCommand::EnvFilter(0)))

failures:
    openvpn-mgmt-codec\src\command.rs - command::server_connection_sequence (line 1160)

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
