*** openvpn-mgmt-codec/src/command.rs:135:9: replace <impl fmt::Display for RemoteEntryRange>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ replace <impl fmt::Display for RemoteEntryRange>::fmt -> fmt::Result with Ok(Default::default())
@@ -127,21 +127,17 @@
     },
 
     /// All entries.
     All,
 }
 
 impl fmt::Display for RemoteEntryRange {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Single(index) => write!(f, "{index}"),
-            Self::Range { from, end } => write!(f, "{from} {end}"),
-            Self::All => f.write_str("all"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Every command the management interface accepts, modeled as a typed enum.
 ///
 /// The encoder handles all serialization — escaping, quoting, multi-line
 /// block framing — so callers never assemble raw strings. The `Raw` variant
 /// exists as an escape hatch for commands not yet modeled here.

---- codec::tests::encode_remote_entry_get stdout ----
2026-03-29T11:02:23.232269Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=remote-entry-get expected=MultiLine queue_depth=1

thread 'codec::tests::encode_remote_entry_get' (9232) panicked at openvpn-mgmt-codec\src\codec.rs:1509:9:
assertion `left == right` failed
  left: "remote-entry-get \n"
 right: "remote-entry-get 0\n"

failures:
    codec::tests::encode_remote_entry_get

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
