*** openvpn-mgmt-codec/src/command.rs:37:5: replace next_token -> Option<(String, &str)> with None

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ replace next_token -> Option<(String, &str)> with None
@@ -29,52 +29,17 @@
 /// [parse_line]: https://github.com/OpenVPN/openvpn/blob/master/src/openvpn/manage.c
 ///
 /// # Spec reference
 ///
 /// Escaping rules: [`management-notes.txt`][spec], "Command Parsing" section.
 ///
 /// [spec]: https://github.com/OpenVPN/openvpn/blob/master/doc/management-notes.txt
 fn next_token(input: &str) -> Option<(String, &str)> {
-    let input = input.trim_start();
-    if input.is_empty() {
-        return None;
-    }
-
-    if let Some(quoted) = input.strip_prefix('"') {
-        // Quoted token: consume until unescaped closing quote.
-        let mut chars = quoted.chars();
-        let mut token = String::new();
-        let mut closed = false;
-        loop {
-            match chars.next() {
-                None => break,
-                Some('"') => {
-                    closed = true;
-                    break;
-                }
-                Some('\\') => match chars.next() {
-                    Some(escaped) => token.push(escaped),
-                    None => break,
-                },
-                Some(plain) => token.push(plain),
-            }
-        }
-        if !closed {
-            return None;
-        }
-        let rest = chars.as_str().trim_start();
-        Some((token, rest))
-    } else {
-        // Unquoted token: delimited by whitespace.
-        match input.split_once(char::is_whitespace) {
-            Some((tok, rest)) => Some((tok.to_string(), rest.trim_start())),
-            None => Some((input.to_string(), "")),
-        }
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Error returned when parsing a command string fails.
 #[derive(Debug, Clone, PartialEq, Eq, thiserror::Error)]
 pub enum CommandParseError {
     /// Unrecognized signal name.
     #[error(transparent)]
     Signal(#[from] ParseSignalError),

---- command::tests::next_token_last_token_no_trailing stdout ----

thread 'command::tests::next_token_last_token_no_trailing' (35492) panicked at openvpn-mgmt-codec\src\command.rs:1391:49:
called `Option::unwrap()` on a `None` value

---- command::tests::next_token_quoted_simple stdout ----

thread 'command::tests::next_token_quoted_simple' (1040) panicked at openvpn-mgmt-codec\src\command.rs:1371:67:
called `Option::unwrap()` on a `None` value

---- command::tests::next_token_quoted_with_escapes stdout ----

thread 'command::tests::next_token_quoted_with_escapes' (45360) panicked at openvpn-mgmt-codec\src\command.rs:1379:54:
called `Option::unwrap()` on a `None` value

failures:
    command::tests::next_token_last_token_no_trailing
    command::tests::next_token_quoted_simple
    command::tests::next_token_quoted_with_escapes
    command::tests::next_token_unquoted
    command::tests::parse_client_deny
    command::tests::parse_client_pending_auth
    command::tests::parse_cr_response
    command::tests::parse_needstr
    command::tests::parse_password
    command::tests::parse_password_quoted_http_proxy
    command::tests::parse_password_quoted_socks_proxy
    command::tests::parse_password_quoted_spaced_auth_type

test result: FAILED. 344 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
