*** openvpn-mgmt-codec/src/command.rs:37:5: replace next_token -> Option<(String, &str)> with Some(("xyzzy".into(), ""))

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ replace next_token -> Option<(String, &str)> with Some(("xyzzy".into(), ""))
@@ -29,52 +29,17 @@
 /// [parse_line]: https://github.com/OpenVPN/openvpn/blob/master/src/openvpn/manage.c
 ///
 /// # Spec reference
 ///
 /// Escaping rules: [`management-notes.txt`][spec], "Command Parsing" section.
 ///
 /// [spec]: https://github.com/OpenVPN/openvpn/blob/master/doc/management-notes.txt
 fn next_token(input: &str) -> Option<(String, &str)> {
-    let input = input.trim_start();
-    if input.is_empty() {
-        return None;
-    }
-
-    if let Some(quoted) = input.strip_prefix('"') {
-        // Quoted token: consume until unescaped closing quote.
-        let mut chars = quoted.chars();
-        let mut token = String::new();
-        let mut closed = false;
-        loop {
-            match chars.next() {
-                None => break,
-                Some('"') => {
-                    closed = true;
-                    break;
-                }
-                Some('\\') => match chars.next() {
-                    Some(escaped) => token.push(escaped),
-                    None => break,
-                },
-                Some(plain) => token.push(plain),
-            }
-        }
-        if !closed {
-            return None;
-        }
-        let rest = chars.as_str().trim_start();
-        Some((token, rest))
-    } else {
-        // Unquoted token: delimited by whitespace.
-        match input.split_once(char::is_whitespace) {
-            Some((tok, rest)) => Some((tok.to_string(), rest.trim_start())),
-            None => Some((input.to_string(), "")),
-        }
-    }
+    Some(("xyzzy".into(), "")) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Error returned when parsing a command string fails.
 #[derive(Debug, Clone, PartialEq, Eq, thiserror::Error)]
 pub enum CommandParseError {
     /// Unrecognized signal name.
     #[error(transparent)]
     Signal(#[from] ParseSignalError),

---- command::tests::next_token_last_token_no_trailing stdout ----

thread 'command::tests::next_token_last_token_no_trailing' (34460) panicked at openvpn-mgmt-codec\src\command.rs:1392:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "onlyone"

---- command::tests::next_token_empty stdout ----

thread 'command::tests::next_token_empty' (48068) panicked at openvpn-mgmt-codec\src\command.rs:1385:9:
assertion failed: next_token("").is_none()

---- command::tests::next_token_quoted_with_escapes stdout ----

thread 'command::tests::next_token_quoted_with_escapes' (17312) panicked at openvpn-mgmt-codec\src\command.rs:1380:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "foo\\\"bar"

failures:
    command::tests::next_token_empty
    command::tests::next_token_last_token_no_trailing
    command::tests::next_token_quoted_simple
    command::tests::next_token_quoted_with_escapes
    command::tests::next_token_unclosed_quote_returns_none
    command::tests::next_token_unquoted
    command::tests::parse_client_deny
    command::tests::parse_client_pending_auth
    command::tests::parse_cr_response
    command::tests::parse_cr_response_missing_arg
    command::tests::parse_needstr
    command::tests::parse_needstr_missing_value

test result: FAILED. 338 passed; 25 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
