*** openvpn-mgmt-codec/src/command.rs:519:13: delete match arm Self::Status(_) | Self::Version | Self::Help | Self::Net | Self::RemoteEntryCount | Self::RemoteEntryGet(_) in OvpnCommand::expected_response

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm Self::Status(_) | Self::Version | Self::Help | Self::Net | Self::RemoteEntryCount | Self::RemoteEntryGet(_) in OvpnCommand::expected_response
@@ -511,22 +511,17 @@
 }
 
 impl OvpnCommand {
     /// Determine what kind of response this command produces, so the
     /// decoder knows how to frame the next incoming bytes.
     pub(crate) fn expected_response(&self) -> ResponseKind {
         match self {
             // These always produce multi-line (END-terminated) responses.
-            Self::Status(_)
-            | Self::Version
-            | Self::Help
-            | Self::Net
-            | Self::RemoteEntryCount
-            | Self::RemoteEntryGet(_) => ResponseKind::MultiLine,
+             /* ~ changed by cargo-mutants ~ */
 
             // state/log/echo: depends on the specific sub-mode.
             Self::StateStream(mode) | Self::Log(mode) | Self::Echo(mode) => match mode {
                 StreamMode::All | StreamMode::OnAll | StreamMode::Recent(_) => {
                     ResponseKind::MultiLine
                 }
                 StreamMode::On | StreamMode::Off => ResponseKind::SuccessOrError,
             },

---- client::tests::help_returns_lines stdout ----

thread 'client::tests::help_returns_lines' (46932) panicked at openvpn-mgmt-codec\src\client.rs:1024:41:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(Unrecognized { line: "Management Interface for OpenVPN", kind: UnexpectedLine })

---- client::tests::net_returns_lines stdout ----

thread 'client::tests::net_returns_lines' (39880) panicked at openvpn-mgmt-codec\src\client.rs:1031:40:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(Unrecognized { line: "Adapter: eth0", kind: UnexpectedLine })

---- client::tests::remote_entry_get_returns_lines stdout ----

thread 'client::tests::remote_entry_get_returns_lines' (2588) panicked at openvpn-mgmt-codec\src\client.rs:1061:14:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(Unrecognized { line: "vpn1.example.com 1194 udp", kind: UnexpectedLine })

failures:
    client::tests::help_returns_lines
    client::tests::net_returns_lines
    client::tests::remote_entry_count_returns_lines
    client::tests::remote_entry_get_returns_lines
    client::tests::status_raw_returns_lines
    codec::tests::decode_empty_multiline
    codec::tests::decode_multiline_with_command_tracking
    codec::tests::decode_notification_during_multiline
    codec::tests::default_accumulation_limit_allows_reasonable_responses
    codec::tests::encode_during_multiline_accumulation_warns_but_succeeds
    codec::tests::multi_line_limit_exact_boundary_passes
    codec::tests::multi_line_limit_exceeded

test result: FAILED. 347 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
