*** openvpn-mgmt-codec/src/command.rs:527:13: delete match arm Self::StateStream(mode) | Self::Log(mode) | Self::Echo(mode) in OvpnCommand::expected_response

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm Self::StateStream(mode) | Self::Log(mode) | Self::Echo(mode) in OvpnCommand::expected_response
@@ -519,22 +519,17 @@
             Self::Status(_)
             | Self::Version
             | Self::Help
             | Self::Net
             | Self::RemoteEntryCount
             | Self::RemoteEntryGet(_) => ResponseKind::MultiLine,
 
             // state/log/echo: depends on the specific sub-mode.
-            Self::StateStream(mode) | Self::Log(mode) | Self::Echo(mode) => match mode {
-                StreamMode::All | StreamMode::OnAll | StreamMode::Recent(_) => {
-                    ResponseKind::MultiLine
-                }
-                StreamMode::On | StreamMode::Off => ResponseKind::SuccessOrError,
-            },
+             /* ~ changed by cargo-mutants ~ */
 
             // Bare `state` returns state history (END-terminated).
             Self::State => ResponseKind::MultiLine,
 
             // Raw multi-line expects END-terminated response.
             Self::RawMultiLine(_) => ResponseKind::MultiLine,
 
             // exit/quit close the connection.

---- client::tests::log_all_returns_history stdout ----

thread 'client::tests::log_all_returns_history' (35844) panicked at openvpn-mgmt-codec\src\client.rs:1110:55:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(Unrecognized { line: "1700000000,I,Log entry one", kind: UnexpectedLine })

---- client::tests::state_stream_all_returns_parsed_history stdout ----

thread 'client::tests::state_stream_all_returns_parsed_history' (37772) panicked at openvpn-mgmt-codec\src\client.rs:1135:66:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(Unrecognized { line: "1700000000,CONNECTED,SUCCESS,10.8.0.1,1.2.3.4,1194,,,", kind: UnexpectedLine })

failures:
    client::tests::log_all_returns_history
    client::tests::state_stream_all_returns_parsed_history

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
