*** openvpn-mgmt-codec/src/command.rs:535:13: delete match arm Self::State in OvpnCommand::expected_response

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm Self::State in OvpnCommand::expected_response
@@ -527,17 +527,17 @@
             Self::StateStream(mode) | Self::Log(mode) | Self::Echo(mode) => match mode {
                 StreamMode::All | StreamMode::OnAll | StreamMode::Recent(_) => {
                     ResponseKind::MultiLine
                 }
                 StreamMode::On | StreamMode::Off => ResponseKind::SuccessOrError,
             },
 
             // Bare `state` returns state history (END-terminated).
-            Self::State => ResponseKind::MultiLine,
+             /* ~ changed by cargo-mutants ~ */
 
             // Raw multi-line expects END-terminated response.
             Self::RawMultiLine(_) => ResponseKind::MultiLine,
 
             // exit/quit close the connection.
             Self::Exit | Self::Quit => ResponseKind::NoResponse,
 
             // `version N` for N < 4 produces no response; N >= 4 returns SUCCESS:.

---- client::tests::current_state_returns_single_entry stdout ----

thread 'client::tests::current_state_returns_single_entry' (9116) panicked at openvpn-mgmt-codec\src\client.rs:1089:50:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(Unrecognized { line: "1700000000,CONNECTED,SUCCESS,10.8.0.1,1.2.3.4,1194,,,", kind: UnexpectedLine })

---- client::tests::state_returns_parsed_entries stdout ----

thread 'client::tests::state_returns_parsed_entries' (29340) panicked at openvpn-mgmt-codec\src\client.rs:1074:44:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(Unrecognized { line: "1700000000,CONNECTED,SUCCESS,10.8.0.1,1.2.3.4,1194,,,", kind: UnexpectedLine })

---- codec::tests::decode_bare_state_multiline stdout ----

thread 'codec::tests::decode_bare_state_multiline' (47292) panicked at openvpn-mgmt-codec\src\codec.rs:1678:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    client::tests::current_state_returns_single_entry
    client::tests::state_returns_parsed_entries
    codec::tests::decode_bare_state_multiline

test result: FAILED. 360 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
