*** openvpn-mgmt-codec/src/command.rs:538:13: delete match arm Self::RawMultiLine(_) in OvpnCommand::expected_response

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm Self::RawMultiLine(_) in OvpnCommand::expected_response
@@ -530,17 +530,17 @@
                 }
                 StreamMode::On | StreamMode::Off => ResponseKind::SuccessOrError,
             },
 
             // Bare `state` returns state history (END-terminated).
             Self::State => ResponseKind::MultiLine,
 
             // Raw multi-line expects END-terminated response.
-            Self::RawMultiLine(_) => ResponseKind::MultiLine,
+             /* ~ changed by cargo-mutants ~ */
 
             // exit/quit close the connection.
             Self::Exit | Self::Quit => ResponseKind::NoResponse,
 
             // `version N` for N < 4 produces no response; N >= 4 returns SUCCESS:.
             Self::SetVersion(n) if *n < 4 => ResponseKind::NoResponse,
 
             // Everything else (including Raw) produces SUCCESS: or ERROR:.

---- client::tests::raw_multi_line_returns_lines stdout ----

thread 'client::tests::raw_multi_line_returns_lines' (27560) panicked at openvpn-mgmt-codec\src\client.rs:1039:63:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(Unrecognized { line: "line one", kind: UnexpectedLine })

---- codec::tests::raw_multiline_expects_multiline_response stdout ----
2026-03-29T11:02:43.371262Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=raw-multi-line expected=SuccessOrError queue_depth=1
2026-03-29T11:02:43.371362Z  WARN openvpn_mgmt_codec::codec: unrecognized line from server line=line1
2026-03-29T11:02:43.371375Z  WARN openvpn_mgmt_codec::codec: unrecognized line from server line=line2
2026-03-29T11:02:43.371384Z  WARN openvpn_mgmt_codec::codec: unrecognized line from server line=END

thread 'codec::tests::raw_multiline_expects_multiline_response' (1456) panicked at openvpn-mgmt-codec\src\codec.rs:1863:9:
assertion `left == right` failed
  left: 3
 right: 1

failures:
    client::tests::raw_multi_line_returns_lines
    codec::tests::raw_multiline_expects_multiline_response

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
