*** openvpn-mgmt-codec/src/command.rs:541:13: delete match arm Self::Exit | Self::Quit in OvpnCommand::expected_response

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm Self::Exit | Self::Quit in OvpnCommand::expected_response
@@ -533,17 +533,17 @@
 
             // Bare `state` returns state history (END-terminated).
             Self::State => ResponseKind::MultiLine,
 
             // Raw multi-line expects END-terminated response.
             Self::RawMultiLine(_) => ResponseKind::MultiLine,
 
             // exit/quit close the connection.
-            Self::Exit | Self::Quit => ResponseKind::NoResponse,
+             /* ~ changed by cargo-mutants ~ */
 
             // `version N` for N < 4 produces no response; N >= 4 returns SUCCESS:.
             Self::SetVersion(n) if *n < 4 => ResponseKind::NoResponse,
 
             // Everything else (including Raw) produces SUCCESS: or ERROR:.
             _ => ResponseKind::SuccessOrError,
         }
     }

---- command::tests::exit_quit_expect_no_response stdout ----

thread 'command::tests::exit_quit_expect_no_response' (5928) panicked at openvpn-mgmt-codec\src\command.rs:1949:9:
assertion `left == right` failed
  left: SuccessOrError
 right: NoResponse

failures:
    command::tests::exit_quit_expect_no_response

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
