*** openvpn-mgmt-codec/src/command.rs:544:39: replace < with <= in OvpnCommand::expected_response

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ replace < with <= in OvpnCommand::expected_response
@@ -536,17 +536,17 @@
 
             // Raw multi-line expects END-terminated response.
             Self::RawMultiLine(_) => ResponseKind::MultiLine,
 
             // exit/quit close the connection.
             Self::Exit | Self::Quit => ResponseKind::NoResponse,
 
             // `version N` for N < 4 produces no response; N >= 4 returns SUCCESS:.
-            Self::SetVersion(n) if *n < 4 => ResponseKind::NoResponse,
+            Self::SetVersion(n) if *n <= /* ~ changed by cargo-mutants ~ */ 4 => ResponseKind::NoResponse,
 
             // Everything else (including Raw) produces SUCCESS: or ERROR:.
             _ => ResponseKind::SuccessOrError,
         }
     }
 }
 
 impl FromStr for OvpnCommand {

*** result: Success
