*** openvpn-mgmt-codec/src/command.rs:591:26: replace match guard args.is_empty() with true in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ replace match guard args.is_empty() with true in <impl FromStr for OvpnCommand>::from_str
@@ -583,17 +583,17 @@
         let line = line.trim();
         let (cmd, args) = line
             .split_once(char::is_whitespace)
             .map(|(c, a)| (c, a.trim()))
             .unwrap_or((line, ""));
 
         match cmd {
             // --- Informational ---
-            "version" if args.is_empty() => Ok(Self::Version),
+            "version" if true /* ~ changed by cargo-mutants ~ */ => Ok(Self::Version),
             "version" => Ok(Self::SetVersion(args.parse().map_err(|_| {
                 CommandParseError::InvalidChoice {
                     field: "version number",
                     input: args.to_string(),
                     hint: "expected a positive integer (e.g. version 2)",
                 }
             })?)),
             "pid" => Ok(Self::Pid),

---- command_encode_parse_roundtrip stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'command_encode_parse_roundtrip' (8280) panicked at openvpn-mgmt-codec\tests\proptest_roundtrip.rs:1072:1:
Test failed: assertion failed: `(left == right)` 
  left: `Version`, 
 right: `SetVersion(1)`: roundtrip mismatch: wire="version 1" at openvpn-mgmt-codec\tests\proptest_roundtrip.rs:1430.
minimal failing input: cmd = SetVersion(
    1,
)
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    command_encode_parse_roundtrip

test result: FAILED. 34 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.33s

*** result: Failure(101)
