*** openvpn-mgmt-codec/src/command.rs:591:26: replace match guard args.is_empty() with false in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ replace match guard args.is_empty() with false in <impl FromStr for OvpnCommand>::from_str
@@ -583,17 +583,17 @@
         let line = line.trim();
         let (cmd, args) = line
             .split_once(char::is_whitespace)
             .map(|(c, a)| (c, a.trim()))
             .unwrap_or((line, ""));
 
         match cmd {
             // --- Informational ---
-            "version" if args.is_empty() => Ok(Self::Version),
+            "version" if false /* ~ changed by cargo-mutants ~ */ => Ok(Self::Version),
             "version" => Ok(Self::SetVersion(args.parse().map_err(|_| {
                 CommandParseError::InvalidChoice {
                     field: "version number",
                     input: args.to_string(),
                     hint: "expected a positive integer (e.g. version 2)",
                 }
             })?)),
             "pid" => Ok(Self::Pid),

---- command::tests::parse_simple_commands stdout ----

thread 'command::tests::parse_simple_commands' (45676) panicked at openvpn-mgmt-codec\src\command.rs:1235:9:
assertion `left == right` failed
  left: Err(InvalidChoice { field: "version number", input: "", hint: "expected a positive integer (e.g. version 2)" })
 right: Ok(Version)

---- command::tests::parse_trims_whitespace stdout ----

thread 'command::tests::parse_trims_whitespace' (17424) panicked at openvpn-mgmt-codec\src\command.rs:1685:9:
assertion `left == right` failed
  left: Err(InvalidChoice { field: "version number", input: "", hint: "expected a positive integer (e.g. version 2)" })
 right: Ok(Version)

failures:
    command::tests::parse_simple_commands
    command::tests::parse_trims_whitespace

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
