*** openvpn-mgmt-codec/src/command.rs:592:13: delete match arm "version" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "version" in <impl FromStr for OvpnCommand>::from_str
@@ -584,23 +584,17 @@
         let (cmd, args) = line
             .split_once(char::is_whitespace)
             .map(|(c, a)| (c, a.trim()))
             .unwrap_or((line, ""));
 
         match cmd {
             // --- Informational ---
             "version" if args.is_empty() => Ok(Self::Version),
-            "version" => Ok(Self::SetVersion(args.parse().map_err(|_| {
-                CommandParseError::InvalidChoice {
-                    field: "version number",
-                    input: args.to_string(),
-                    hint: "expected a positive integer (e.g. version 2)",
-                }
-            })?)),
+             /* ~ changed by cargo-mutants ~ */
             "pid" => Ok(Self::Pid),
             "help" => Ok(Self::Help),
             "net" => Ok(Self::Net),
             "load-stats" => Ok(Self::LoadStats),
 
             "status" => match args {
                 "" | "1" => Ok(Self::Status(StatusFormat::V1)),
                 "2" => Ok(Self::Status(StatusFormat::V2)),

---- command_encode_parse_roundtrip stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: Saving this and future failures in C:\Users\RBACHM~1\AppData\Local\Temp\cargo-mutants-ovpn-mgmt-codec-20dG1m.tmp\openvpn-mgmt-codec\tests\proptest_roundtrip.proptest-regressions
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc 9814d3c97e5194ee7a366be103a12bbe4e95396a8672e7ead88f8ff47b5e2243

thread 'command_encode_parse_roundtrip' (36544) panicked at openvpn-mgmt-codec\tests\proptest_roundtrip.rs:1072:1:
Test failed: assertion failed: `(left == right)` 
  left: `Raw("version 1")`, 
 right: `SetVersion(1)`: roundtrip mismatch: wire="version 1" at openvpn-mgmt-codec\tests\proptest_roundtri

failures:
    command_encode_parse_roundtrip

test result: FAILED. 34 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.83s

*** result: Failure(101)
