*** openvpn-mgmt-codec/src/command.rs:599:13: delete match arm "pid" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "pid" in <impl FromStr for OvpnCommand>::from_str
@@ -591,17 +591,17 @@
             "version" if args.is_empty() => Ok(Self::Version),
             "version" => Ok(Self::SetVersion(args.parse().map_err(|_| {
                 CommandParseError::InvalidChoice {
                     field: "version number",
                     input: args.to_string(),
                     hint: "expected a positive integer (e.g. version 2)",
                 }
             })?)),
-            "pid" => Ok(Self::Pid),
+             /* ~ changed by cargo-mutants ~ */
             "help" => Ok(Self::Help),
             "net" => Ok(Self::Net),
             "load-stats" => Ok(Self::LoadStats),
 
             "status" => match args {
                 "" | "1" => Ok(Self::Status(StatusFormat::V1)),
                 "2" => Ok(Self::Status(StatusFormat::V2)),
                 "3" => Ok(Self::Status(StatusFormat::V3)),

---- command::tests::parse_simple_commands stdout ----

thread 'command::tests::parse_simple_commands' (32540) panicked at openvpn-mgmt-codec\src\command.rs:1236:9:
assertion `left == right` failed
  left: Ok(Raw("pid"))
 right: Ok(Pid)

failures:
    command::tests::parse_simple_commands

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
