*** openvpn-mgmt-codec/src/command.rs:600:13: delete match arm "help" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "help" in <impl FromStr for OvpnCommand>::from_str
@@ -592,17 +592,17 @@
             "version" => Ok(Self::SetVersion(args.parse().map_err(|_| {
                 CommandParseError::InvalidChoice {
                     field: "version number",
                     input: args.to_string(),
                     hint: "expected a positive integer (e.g. version 2)",
                 }
             })?)),
             "pid" => Ok(Self::Pid),
-            "help" => Ok(Self::Help),
+             /* ~ changed by cargo-mutants ~ */
             "net" => Ok(Self::Net),
             "load-stats" => Ok(Self::LoadStats),
 
             "status" => match args {
                 "" | "1" => Ok(Self::Status(StatusFormat::V1)),
                 "2" => Ok(Self::Status(StatusFormat::V2)),
                 "3" => Ok(Self::Status(StatusFormat::V3)),
                 _ => Err(CommandParseError::InvalidChoice {

---- command::tests::parse_simple_commands stdout ----

thread 'command::tests::parse_simple_commands' (1732) panicked at openvpn-mgmt-codec\src\command.rs:1237:9:
assertion `left == right` failed
  left: Ok(Raw("help"))
 right: Ok(Help)

failures:
    command::tests::parse_simple_commands

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
