*** openvpn-mgmt-codec/src/command.rs:601:13: delete match arm "net" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "net" in <impl FromStr for OvpnCommand>::from_str
@@ -593,17 +593,17 @@
                 CommandParseError::InvalidChoice {
                     field: "version number",
                     input: args.to_string(),
                     hint: "expected a positive integer (e.g. version 2)",
                 }
             })?)),
             "pid" => Ok(Self::Pid),
             "help" => Ok(Self::Help),
-            "net" => Ok(Self::Net),
+             /* ~ changed by cargo-mutants ~ */
             "load-stats" => Ok(Self::LoadStats),
 
             "status" => match args {
                 "" | "1" => Ok(Self::Status(StatusFormat::V1)),
                 "2" => Ok(Self::Status(StatusFormat::V2)),
                 "3" => Ok(Self::Status(StatusFormat::V3)),
                 _ => Err(CommandParseError::InvalidChoice {
                     field: "status format",

---- command::tests::parse_simple_commands stdout ----

thread 'command::tests::parse_simple_commands' (45528) panicked at openvpn-mgmt-codec\src\command.rs:1238:9:
assertion `left == right` failed
  left: Ok(Raw("net"))
 right: Ok(Net)

failures:
    command::tests::parse_simple_commands

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
