*** openvpn-mgmt-codec/src/command.rs:602:13: delete match arm "load-stats" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "load-stats" in <impl FromStr for OvpnCommand>::from_str
@@ -594,17 +594,17 @@
                     field: "version number",
                     input: args.to_string(),
                     hint: "expected a positive integer (e.g. version 2)",
                 }
             })?)),
             "pid" => Ok(Self::Pid),
             "help" => Ok(Self::Help),
             "net" => Ok(Self::Net),
-            "load-stats" => Ok(Self::LoadStats),
+             /* ~ changed by cargo-mutants ~ */
 
             "status" => match args {
                 "" | "1" => Ok(Self::Status(StatusFormat::V1)),
                 "2" => Ok(Self::Status(StatusFormat::V2)),
                 "3" => Ok(Self::Status(StatusFormat::V3)),
                 _ => Err(CommandParseError::InvalidChoice {
                     field: "status format",
                     input: args.to_string(),

---- command::tests::parse_simple_commands stdout ----

thread 'command::tests::parse_simple_commands' (28888) panicked at openvpn-mgmt-codec\src\command.rs:1239:9:
assertion `left == right` failed
  left: Ok(Raw("load-stats"))
 right: Ok(LoadStats)

failures:
    command::tests::parse_simple_commands

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
