*** openvpn-mgmt-codec/src/command.rs:604:13: delete match arm "status" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "status" in <impl FromStr for OvpnCommand>::from_str
@@ -596,26 +596,17 @@
                     hint: "expected a positive integer (e.g. version 2)",
                 }
             })?)),
             "pid" => Ok(Self::Pid),
             "help" => Ok(Self::Help),
             "net" => Ok(Self::Net),
             "load-stats" => Ok(Self::LoadStats),
 
-            "status" => match args {
-                "" | "1" => Ok(Self::Status(StatusFormat::V1)),
-                "2" => Ok(Self::Status(StatusFormat::V2)),
-                "3" => Ok(Self::Status(StatusFormat::V3)),
-                _ => Err(CommandParseError::InvalidChoice {
-                    field: "status format",
-                    input: args.to_string(),
-                    hint: "use 1, 2, or 3",
-                }),
-            },
+             /* ~ changed by cargo-mutants ~ */
 
             "state" => match args {
                 "" => Ok(Self::State),
                 other => Ok(Self::StateStream(other.parse::<StreamMode>()?)),
             },
 
             "log" => Ok(Self::Log(args.parse::<StreamMode>()?)),
             "echo" => Ok(Self::Echo(args.parse::<StreamMode>()?)),

---- command::tests::parse_status stdout ----

thread 'command::tests::parse_status' (25168) panicked at openvpn-mgmt-codec\src\command.rs:1239:9:
assertion `left == right` failed
  left: Ok(Raw("status"))
 right: Ok(Status(V1))

failures:
    command::tests::parse_status

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
