*** openvpn-mgmt-codec/src/command.rs:605:17: delete match arm "" | "1" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "" | "1" in <impl FromStr for OvpnCommand>::from_str
@@ -597,17 +597,17 @@
                 }
             })?)),
             "pid" => Ok(Self::Pid),
             "help" => Ok(Self::Help),
             "net" => Ok(Self::Net),
             "load-stats" => Ok(Self::LoadStats),
 
             "status" => match args {
-                "" | "1" => Ok(Self::Status(StatusFormat::V1)),
+                 /* ~ changed by cargo-mutants ~ */
                 "2" => Ok(Self::Status(StatusFormat::V2)),
                 "3" => Ok(Self::Status(StatusFormat::V3)),
                 _ => Err(CommandParseError::InvalidChoice {
                     field: "status format",
                     input: args.to_string(),
                     hint: "use 1, 2, or 3",
                 }),
             },

---- command::tests::parse_status stdout ----

thread 'command::tests::parse_status' (45600) panicked at openvpn-mgmt-codec\src\command.rs:1248:9:
assertion `left == right` failed
  left: Err(InvalidChoice { field: "status format", input: "", hint: "use 1, 2, or 3" })
 right: Ok(Status(V1))

failures:
    command::tests::parse_status

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
