*** openvpn-mgmt-codec/src/command.rs:607:17: delete match arm "3" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "3" in <impl FromStr for OvpnCommand>::from_str
@@ -599,17 +599,17 @@
             "pid" => Ok(Self::Pid),
             "help" => Ok(Self::Help),
             "net" => Ok(Self::Net),
             "load-stats" => Ok(Self::LoadStats),
 
             "status" => match args {
                 "" | "1" => Ok(Self::Status(StatusFormat::V1)),
                 "2" => Ok(Self::Status(StatusFormat::V2)),
-                "3" => Ok(Self::Status(StatusFormat::V3)),
+                 /* ~ changed by cargo-mutants ~ */
                 _ => Err(CommandParseError::InvalidChoice {
                     field: "status format",
                     input: args.to_string(),
                     hint: "use 1, 2, or 3",
                 }),
             },
 
             "state" => match args {

---- command::tests::parse_status stdout ----

thread 'command::tests::parse_status' (32304) panicked at openvpn-mgmt-codec\src\command.rs:1257:9:
assertion `left == right` failed
  left: Err(InvalidChoice { field: "status format", input: "3", hint: "use 1, 2, or 3" })
 right: Ok(Status(V3))

failures:
    command::tests::parse_status

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
