*** openvpn-mgmt-codec/src/command.rs:615:13: delete match arm "state" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "state" in <impl FromStr for OvpnCommand>::from_str
@@ -607,20 +607,17 @@
                 "3" => Ok(Self::Status(StatusFormat::V3)),
                 _ => Err(CommandParseError::InvalidChoice {
                     field: "status format",
                     input: args.to_string(),
                     hint: "use 1, 2, or 3",
                 }),
             },
 
-            "state" => match args {
-                "" => Ok(Self::State),
-                other => Ok(Self::StateStream(other.parse::<StreamMode>()?)),
-            },
+             /* ~ changed by cargo-mutants ~ */
 
             "log" => Ok(Self::Log(args.parse::<StreamMode>()?)),
             "echo" => Ok(Self::Echo(args.parse::<StreamMode>()?)),
 
             "verb" => {
                 if args.is_empty() {
                     Ok(Self::Verb(None))
                 } else {

---- command::tests::parse_state_bare stdout ----

thread 'command::tests::parse_state_bare' (7224) panicked at openvpn-mgmt-codec\src\command.rs:1265:9:
assertion `left == right` failed
  left: Ok(Raw("state"))
 right: Ok(State)

---- command::tests::parse_state_stream_modes stdout ----

thread 'command::tests::parse_state_stream_modes' (2416) panicked at openvpn-mgmt-codec\src\command.rs:1270:9:
assertion `left == right` failed
  left: Ok(Raw("state on"))
 right: Ok(StateStream(On))

---- command::tests::parse_state_invalid_stream_mode stdout ----

thread 'command::tests::parse_state_invalid_stream_mode' (43708) panicked at openvpn-mgmt-codec\src\command.rs:1693:9:
assertion failed: "state bogus".parse::<OvpnCommand>().is_err()

failures:
    command::tests::parse_state_bare
    command::tests::parse_state_invalid_stream_mode
    command::tests::parse_state_stream_modes
    command::tests::parse_trims_whitespace

test result: FAILED. 357 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
