*** openvpn-mgmt-codec/src/command.rs:61:12: delete ! in next_token

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete ! in next_token
@@ -53,17 +53,17 @@
                 }
                 Some('\\') => match chars.next() {
                     Some(escaped) => token.push(escaped),
                     None => break,
                 },
                 Some(plain) => token.push(plain),
             }
         }
-        if !closed {
+        if  /* ~ changed by cargo-mutants ~ */closed {
             return None;
         }
         let rest = chars.as_str().trim_start();
         Some((token, rest))
     } else {
         // Unquoted token: delimited by whitespace.
         match input.split_once(char::is_whitespace) {
             Some((tok, rest)) => Some((tok.to_string(), rest.trim_start())),

---- command::tests::next_token_quoted_simple stdout ----

thread 'command::tests::next_token_quoted_simple' (32720) panicked at openvpn-mgmt-codec\src\command.rs:1406:67:
called `Option::unwrap()` on a `None` value

---- command::tests::next_token_quoted_with_escapes stdout ----

thread 'command::tests::next_token_quoted_with_escapes' (22616) panicked at openvpn-mgmt-codec\src\command.rs:1414:54:
called `Option::unwrap()` on a `None` value

---- command::tests::next_token_unclosed_quote_returns_none stdout ----

thread 'command::tests::next_token_unclosed_quote_returns_none' (42900) panicked at openvpn-mgmt-codec\src\command.rs:1433:9:
assertion failed: next_token(r#""unclosed string"#).is_none()

failures:
    command::tests::next_token_quoted_simple
    command::tests::next_token_quoted_with_escapes
    command::tests::next_token_unclosed_quote_returns_none
    command::tests::parse_password_quoted_http_proxy
    command::tests::parse_password_quoted_socks_proxy
    command::tests::parse_password_quoted_spaced_auth_type
    command::tests::parse_password_roundtrip_spaced_auth_types
    command::tests::parse_push_update_broad
    command::tests::parse_push_update_cid
    command::tests::parse_username_quoted_spaced_auth_type

test result: FAILED. 353 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
