*** openvpn-mgmt-codec/src/command.rs:620:13: delete match arm "log" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "log" in <impl FromStr for OvpnCommand>::from_str
@@ -612,17 +612,17 @@
                 }),
             },
 
             "state" => match args {
                 "" => Ok(Self::State),
                 other => Ok(Self::StateStream(other.parse::<StreamMode>()?)),
             },
 
-            "log" => Ok(Self::Log(args.parse::<StreamMode>()?)),
+             /* ~ changed by cargo-mutants ~ */
             "echo" => Ok(Self::Echo(args.parse::<StreamMode>()?)),
 
             "verb" => {
                 if args.is_empty() {
                     Ok(Self::Verb(None))
                 } else {
                     args.parse::<u8>()
                         .map(|level| Self::Verb(Some(level)))

---- command::tests::parse_log_invalid_stream_mode stdout ----

thread 'command::tests::parse_log_invalid_stream_mode' (30064) panicked at openvpn-mgmt-codec\src\command.rs:1701:9:
assertion failed: "log bogus".parse::<OvpnCommand>().is_err()

---- command::tests::parse_log_and_echo stdout ----

thread 'command::tests::parse_log_and_echo' (41280) panicked at openvpn-mgmt-codec\src\command.rs:1297:9:
assertion `left == right` failed
  left: Ok(Raw("log on"))
 right: Ok(Log(On))

failures:
    command::tests::parse_log_and_echo
    command::tests::parse_log_invalid_stream_mode

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
