*** openvpn-mgmt-codec/src/command.rs:621:13: delete match arm "echo" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "echo" in <impl FromStr for OvpnCommand>::from_str
@@ -613,17 +613,17 @@
             },
 
             "state" => match args {
                 "" => Ok(Self::State),
                 other => Ok(Self::StateStream(other.parse::<StreamMode>()?)),
             },
 
             "log" => Ok(Self::Log(args.parse::<StreamMode>()?)),
-            "echo" => Ok(Self::Echo(args.parse::<StreamMode>()?)),
+             /* ~ changed by cargo-mutants ~ */
 
             "verb" => {
                 if args.is_empty() {
                     Ok(Self::Verb(None))
                 } else {
                     args.parse::<u8>()
                         .map(|level| Self::Verb(Some(level)))
                         .map_err(|_| CommandParseError::InvalidNumber {

---- command::tests::parse_echo_invalid_stream_mode stdout ----

thread 'command::tests::parse_echo_invalid_stream_mode' (45384) panicked at openvpn-mgmt-codec\src\command.rs:1706:9:
assertion failed: "echo bogus".parse::<OvpnCommand>().is_err()

---- command::tests::parse_log_and_echo stdout ----

thread 'command::tests::parse_log_and_echo' (23768) panicked at openvpn-mgmt-codec\src\command.rs:1302:9:
assertion `left == right` failed
  left: Ok(Raw("echo off"))
 right: Ok(Echo(Off))

failures:
    command::tests::parse_echo_invalid_stream_mode
    command::tests::parse_log_and_echo

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
