*** openvpn-mgmt-codec/src/command.rs:623:13: delete match arm "verb" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "verb" in <impl FromStr for OvpnCommand>::from_str
@@ -615,28 +615,17 @@
             "state" => match args {
                 "" => Ok(Self::State),
                 other => Ok(Self::StateStream(other.parse::<StreamMode>()?)),
             },
 
             "log" => Ok(Self::Log(args.parse::<StreamMode>()?)),
             "echo" => Ok(Self::Echo(args.parse::<StreamMode>()?)),
 
-            "verb" => {
-                if args.is_empty() {
-                    Ok(Self::Verb(None))
-                } else {
-                    args.parse::<u8>()
-                        .map(|level| Self::Verb(Some(level)))
-                        .map_err(|_| CommandParseError::InvalidNumber {
-                            field: "verbosity",
-                            input: args.to_string(),
-                        })
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
 
             "mute" => {
                 if args.is_empty() {
                     Ok(Self::Mute(None))
                 } else {
                     args.parse::<u32>()
                         .map(|threshold| Self::Mute(Some(threshold)))
                         .map_err(|_| CommandParseError::InvalidNumber {

---- command::tests::parse_verb stdout ----

thread 'command::tests::parse_verb' (15608) panicked at openvpn-mgmt-codec\src\command.rs:1302:9:
assertion `left == right` failed
  left: Ok(Raw("verb"))
 right: Ok(Verb(None))

failures:
    command::tests::parse_verb

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
