*** openvpn-mgmt-codec/src/command.rs:636:13: delete match arm "mute" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "mute" in <impl FromStr for OvpnCommand>::from_str
@@ -628,28 +628,17 @@
                         .map(|level| Self::Verb(Some(level)))
                         .map_err(|_| CommandParseError::InvalidNumber {
                             field: "verbosity",
                             input: args.to_string(),
                         })
                 }
             }
 
-            "mute" => {
-                if args.is_empty() {
-                    Ok(Self::Mute(None))
-                } else {
-                    args.parse::<u32>()
-                        .map(|threshold| Self::Mute(Some(threshold)))
-                        .map_err(|_| CommandParseError::InvalidNumber {
-                            field: "mute threshold",
-                            input: args.to_string(),
-                        })
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
 
             "bytecount" => args.parse::<u32>().map(Self::ByteCount).map_err(|_| {
                 CommandParseError::InvalidNumber {
                     field: "bytecount interval",
                     input: args.to_string(),
                 }
             }),

---- command::tests::parse_mute stdout ----

thread 'command::tests::parse_mute' (36144) panicked at openvpn-mgmt-codec\src\command.rs:1309:9:
assertion `left == right` failed
  left: Ok(Raw("mute"))
 right: Ok(Mute(None))

failures:
    command::tests::parse_mute

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
