*** openvpn-mgmt-codec/src/command.rs:649:13: delete match arm "bytecount" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "bytecount" in <impl FromStr for OvpnCommand>::from_str
@@ -641,22 +641,17 @@
                         .map(|threshold| Self::Mute(Some(threshold)))
                         .map_err(|_| CommandParseError::InvalidNumber {
                             field: "mute threshold",
                             input: args.to_string(),
                         })
                 }
             }
 
-            "bytecount" => args.parse::<u32>().map(Self::ByteCount).map_err(|_| {
-                CommandParseError::InvalidNumber {
-                    field: "bytecount interval",
-                    input: args.to_string(),
-                }
-            }),
+             /* ~ changed by cargo-mutants ~ */
 
             // --- Connection control ---
             "signal" => Ok(Self::Signal(args.parse::<Signal>()?)),
 
             "kill" => {
                 if args.is_empty() {
                     return cmd_err("kill requires a target (common name or proto:ip:port)");
                 }

---- command::tests::parse_bytecount stdout ----

thread 'command::tests::parse_bytecount' (2024) panicked at openvpn-mgmt-codec\src\command.rs:1322:9:
assertion `left == right` failed
  left: Ok(Raw("bytecount 5"))
 right: Ok(ByteCount(5))

---- command::tests::parse_bytecount_non_numeric stdout ----

thread 'command::tests::parse_bytecount_non_numeric' (43368) panicked at openvpn-mgmt-codec\src\command.rs:1878:9:
assertion failed: "bytecount abc".parse::<OvpnCommand>().is_err()

failures:
    command::tests::parse_bytecount
    command::tests::parse_bytecount_non_numeric

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
