*** openvpn-mgmt-codec/src/command.rs:657:13: delete match arm "signal" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "signal" in <impl FromStr for OvpnCommand>::from_str
@@ -649,17 +649,17 @@
             "bytecount" => args.parse::<u32>().map(Self::ByteCount).map_err(|_| {
                 CommandParseError::InvalidNumber {
                     field: "bytecount interval",
                     input: args.to_string(),
                 }
             }),
 
             // --- Connection control ---
-            "signal" => Ok(Self::Signal(args.parse::<Signal>()?)),
+             /* ~ changed by cargo-mutants ~ */
 
             "kill" => {
                 if args.is_empty() {
                     return cmd_err("kill requires a target (common name or proto:ip:port)");
                 }
                 let parts: Vec<&str> = args.splitn(3, ':').collect();
                 if parts.len() == 3
                     && let Ok(port) = parts[2].parse::<u16>()

---- command::tests::parse_signal stdout ----

thread 'command::tests::parse_signal' (27216) panicked at openvpn-mgmt-codec\src\command.rs:1336:9:
assertion `left == right` failed
  left: Ok(Raw("signal SIGHUP"))
 right: Ok(Signal(SigHup))

failures:
    command::tests::parse_signal

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
