*** openvpn-mgmt-codec/src/command.rs:659:13: delete match arm "kill" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "kill" in <impl FromStr for OvpnCommand>::from_str
@@ -651,35 +651,17 @@
                     field: "bytecount interval",
                     input: args.to_string(),
                 }
             }),
 
             // --- Connection control ---
             "signal" => Ok(Self::Signal(args.parse::<Signal>()?)),
 
-            "kill" => {
-                if args.is_empty() {
-                    return cmd_err("kill requires a target (common name or proto:ip:port)");
-                }
-                let parts: Vec<&str> = args.splitn(3, ':').collect();
-                if parts.len() == 3
-                    && let Ok(port) = parts[2].parse::<u16>()
-                {
-                    return Ok(Self::Kill(KillTarget::Address {
-                        protocol: parts[0]
-                            .parse()
-                            .inspect_err(|error| warn!(%error, "unknown transport protocol"))
-                            .unwrap_or_else(|_| TransportProtocol::Unknown(parts[0].to_string())),
-                        ip: parts[1].to_string(),
-                        port,
-                    }));
-                }
-                Ok(Self::Kill(KillTarget::CommonName(args.to_string())))
-            }
+             /* ~ changed by cargo-mutants ~ */
 
             "hold" => match args {
                 "" => Ok(Self::HoldQuery),
                 "on" => Ok(Self::HoldOn),
                 "off" => Ok(Self::HoldOff),
                 "release" => Ok(Self::HoldRelease),
                 _ => Err(CommandParseError::InvalidChoice {
                     field: "hold argument",

---- command::tests::parse_kill_address stdout ----

thread 'command::tests::parse_kill_address' (22812) panicked at openvpn-mgmt-codec\src\command.rs:1351:9:
assertion `left == right` failed
  left: Ok(Raw("kill tcp:1.2.3.4:4000"))
 right: Ok(Kill(Address { protocol: Tcp, ip: "1.2.3.4", port: 4000 }))

---- command::tests::parse_kill_empty_is_err stdout ----

thread 'command::tests::parse_kill_empty_is_err' (26124) panicked at openvpn-mgmt-codec\src\command.rs:1363:9:
assertion failed: "kill".parse::<OvpnCommand>().is_err()

---- command::tests::parse_kill_common_name stdout ----

thread 'command::tests::parse_kill_common_name' (31876) panicked at openvpn-mgmt-codec\src\command.rs:1341:9:
assertion `left == right` failed
  left: Ok(Raw("kill TestClient"))
 right: Ok(Kill(CommonName("TestClient")))

failures:
    command::tests::parse_kill_address
    command::tests::parse_kill_common_name
    command::tests::parse_kill_empty_is_err
    command::tests::parse_kill_unknown_protocol_falls_back

test result: FAILED. 359 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
