*** openvpn-mgmt-codec/src/command.rs:664:32: replace == with != in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ replace == with != in <impl FromStr for OvpnCommand>::from_str
@@ -656,17 +656,17 @@
             // --- Connection control ---
             "signal" => Ok(Self::Signal(args.parse::<Signal>()?)),
 
             "kill" => {
                 if args.is_empty() {
                     return cmd_err("kill requires a target (common name or proto:ip:port)");
                 }
                 let parts: Vec<&str> = args.splitn(3, ':').collect();
-                if parts.len() == 3
+                if parts.len() != /* ~ changed by cargo-mutants ~ */ 3
                     && let Ok(port) = parts[2].parse::<u16>()
                 {
                     return Ok(Self::Kill(KillTarget::Address {
                         protocol: parts[0]
                             .parse()
                             .inspect_err(|error| warn!(%error, "unknown transport protocol"))
                             .unwrap_or_else(|_| TransportProtocol::Unknown(parts[0].to_string())),
                         ip: parts[1].to_string(),

---- command::tests::parse_kill_address stdout ----

thread 'command::tests::parse_kill_address' (31624) panicked at openvpn-mgmt-codec\src\command.rs:1369:9:
assertion `left == right` failed
  left: Ok(Kill(CommonName("tcp:1.2.3.4:4000")))
 right: Ok(Kill(Address { protocol: Tcp, ip: "1.2.3.4", port: 4000 }))

---- command::tests::parse_kill_common_name stdout ----

thread 'command::tests::parse_kill_common_name' (28928) panicked at openvpn-mgmt-codec\src\command.rs:665:44:
index out of bounds: the len is 1 but the index is 2

---- command::tests::parse_kill_unknown_protocol_falls_back stdout ----

thread 'command::tests::parse_kill_unknown_protocol_falls_back' (12760) panicked at openvpn-mgmt-codec\src\command.rs:1712:9:
assertion `left == right` failed
  left: Kill(CommonName("sctp:1.2.3.4:4000"))
 right: Kill(Address { protocol: Unknown("sctp"), ip: "1.2.3.4", port: 4000 })

failures:
    command::tests::parse_kill_address
    command::tests::parse_kill_common_name
    command::tests::parse_kill_unknown_protocol_falls_back

test result: FAILED. 358 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
