*** openvpn-mgmt-codec/src/command.rs:679:13: delete match arm "hold" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "hold" in <impl FromStr for OvpnCommand>::from_str
@@ -671,27 +671,17 @@
                             .unwrap_or_else(|_| TransportProtocol::Unknown(parts[0].to_string())),
                         ip: parts[1].to_string(),
                         port,
                     }));
                 }
                 Ok(Self::Kill(KillTarget::CommonName(args.to_string())))
             }
 
-            "hold" => match args {
-                "" => Ok(Self::HoldQuery),
-                "on" => Ok(Self::HoldOn),
-                "off" => Ok(Self::HoldOff),
-                "release" => Ok(Self::HoldRelease),
-                _ => Err(CommandParseError::InvalidChoice {
-                    field: "hold argument",
-                    input: args.to_string(),
-                    hint: "use on, off, or release",
-                }),
-            },
+             /* ~ changed by cargo-mutants ~ */
 
             // --- Authentication ---
             // Wire format per management-notes.txt:
             //   username "Auth" myuser
             //   password "Private Key" "foo\"bar"
             // https://github.com/OpenVPN/openvpn/blob/master/doc/management-notes.txt
             //
             // Auth types are quoted and may contain spaces ("HTTP Proxy",

---- command::tests::parse_hold stdout ----

thread 'command::tests::parse_hold' (25316) panicked at openvpn-mgmt-codec\src\command.rs:1378:9:
assertion `left == right` failed
  left: Ok(Raw("hold"))
 right: Ok(HoldQuery)

failures:
    command::tests::parse_hold

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
