*** openvpn-mgmt-codec/src/command.rs:680:17: delete match arm "" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "" in <impl FromStr for OvpnCommand>::from_str
@@ -672,17 +672,17 @@
                         ip: parts[1].to_string(),
                         port,
                     }));
                 }
                 Ok(Self::Kill(KillTarget::CommonName(args.to_string())))
             }
 
             "hold" => match args {
-                "" => Ok(Self::HoldQuery),
+                 /* ~ changed by cargo-mutants ~ */
                 "on" => Ok(Self::HoldOn),
                 "off" => Ok(Self::HoldOff),
                 "release" => Ok(Self::HoldRelease),
                 _ => Err(CommandParseError::InvalidChoice {
                     field: "hold argument",
                     input: args.to_string(),
                     hint: "use on, off, or release",
                 }),

---- command::tests::parse_hold stdout ----

thread 'command::tests::parse_hold' (32436) panicked at openvpn-mgmt-codec\src\command.rs:1388:9:
assertion `left == right` failed
  left: Err(InvalidChoice { field: "hold argument", input: "", hint: "use on, off, or release" })
 right: Ok(HoldQuery)

failures:
    command::tests::parse_hold

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
