*** openvpn-mgmt-codec/src/command.rs:681:17: delete match arm "on" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "on" in <impl FromStr for OvpnCommand>::from_str
@@ -673,17 +673,17 @@
                         port,
                     }));
                 }
                 Ok(Self::Kill(KillTarget::CommonName(args.to_string())))
             }
 
             "hold" => match args {
                 "" => Ok(Self::HoldQuery),
-                "on" => Ok(Self::HoldOn),
+                 /* ~ changed by cargo-mutants ~ */
                 "off" => Ok(Self::HoldOff),
                 "release" => Ok(Self::HoldRelease),
                 _ => Err(CommandParseError::InvalidChoice {
                     field: "hold argument",
                     input: args.to_string(),
                     hint: "use on, off, or release",
                 }),
             },

---- command::tests::parse_hold stdout ----

thread 'command::tests::parse_hold' (22872) panicked at openvpn-mgmt-codec\src\command.rs:1389:9:
assertion `left == right` failed
  left: Err(InvalidChoice { field: "hold argument", input: "on", hint: "use on, off, or release" })
 right: Ok(HoldOn)

failures:
    command::tests::parse_hold

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
