*** openvpn-mgmt-codec/src/command.rs:682:17: delete match arm "off" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "off" in <impl FromStr for OvpnCommand>::from_str
@@ -674,17 +674,17 @@
                     }));
                 }
                 Ok(Self::Kill(KillTarget::CommonName(args.to_string())))
             }
 
             "hold" => match args {
                 "" => Ok(Self::HoldQuery),
                 "on" => Ok(Self::HoldOn),
-                "off" => Ok(Self::HoldOff),
+                 /* ~ changed by cargo-mutants ~ */
                 "release" => Ok(Self::HoldRelease),
                 _ => Err(CommandParseError::InvalidChoice {
                     field: "hold argument",
                     input: args.to_string(),
                     hint: "use on, off, or release",
                 }),
             },

---- command::tests::parse_hold stdout ----

thread 'command::tests::parse_hold' (2272) panicked at openvpn-mgmt-codec\src\command.rs:1390:9:
assertion `left == right` failed
  left: Err(InvalidChoice { field: "hold argument", input: "off", hint: "use on, off, or release" })
 right: Ok(HoldOff)

failures:
    command::tests::parse_hold

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
