*** openvpn-mgmt-codec/src/command.rs:683:17: delete match arm "release" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "release" in <impl FromStr for OvpnCommand>::from_str
@@ -675,17 +675,17 @@
                 }
                 Ok(Self::Kill(KillTarget::CommonName(args.to_string())))
             }
 
             "hold" => match args {
                 "" => Ok(Self::HoldQuery),
                 "on" => Ok(Self::HoldOn),
                 "off" => Ok(Self::HoldOff),
-                "release" => Ok(Self::HoldRelease),
+                 /* ~ changed by cargo-mutants ~ */
                 _ => Err(CommandParseError::InvalidChoice {
                     field: "hold argument",
                     input: args.to_string(),
                     hint: "use on, off, or release",
                 }),
             },
 
             // --- Authentication ---

---- command::tests::parse_hold stdout ----

thread 'command::tests::parse_hold' (30104) panicked at openvpn-mgmt-codec\src\command.rs:1391:9:
assertion `left == right` failed
  left: Err(InvalidChoice { field: "hold argument", input: "release", hint: "use on, off, or release" })
 right: Ok(HoldRelease)

failures:
    command::tests::parse_hold

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
