*** openvpn-mgmt-codec/src/command.rs:701:13: delete match arm "username" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "username" in <impl FromStr for OvpnCommand>::from_str
@@ -693,31 +693,17 @@
             //   username "Auth" myuser
             //   password "Private Key" "foo\"bar"
             // https://github.com/OpenVPN/openvpn/blob/master/doc/management-notes.txt
             //
             // Auth types are quoted and may contain spaces ("HTTP Proxy",
             // "SOCKS Proxy", "Private Key"), so we use quote-aware
             // tokenization matching manage.c's parse_line() lexer.
             // https://github.com/OpenVPN/openvpn/blob/master/src/openvpn/manage.c
-            "username" => {
-                let (auth_type_str, rest) = next_token(args).ok_or(
-                    CommandParseError::MissingArgs("usage: username <auth-type> <value>"),
-                )?;
-                let (value, _) = next_token(rest).ok_or(CommandParseError::MissingArgs(
-                    "usage: username <auth-type> <value>",
-                ))?;
-                Ok(Self::Username {
-                    auth_type: auth_type_str
-                        .parse()
-                        .inspect_err(|error| warn!(%error, "unknown auth type"))
-                        .unwrap_or(AuthType::Unknown(auth_type_str)),
-                    value: value.into(),
-                })
-            }
+             /* ~ changed by cargo-mutants ~ */
 
             "password" => {
                 let (auth_type_str, rest) = next_token(args).ok_or(
                     CommandParseError::MissingArgs("usage: password <auth-type> <value>"),
                 )?;
                 let (value, _) = next_token(rest).ok_or(CommandParseError::MissingArgs(
                     "usage: password <auth-type> <value>",
                 ))?;

---- command::tests::parse_username stdout ----

thread 'command::tests::parse_username' (28148) panicked at openvpn-mgmt-codec\src\command.rs:1428:9:
assertion `left == right` failed
  left: Raw("username Auth alice")
 right: Username { auth_type: Auth, value: <redacted> }

---- command::tests::parse_username_missing_value_is_err stdout ----

thread 'command::tests::parse_username_missing_value_is_err' (45464) panicked at openvpn-mgmt-codec\src\command.rs:1451:9:
assertion failed: "username".parse::<OvpnCommand>().is_err()

---- command::tests::parse_username_quoted_spaced_auth_type stdout ----

thread 'command::tests::parse_username_quoted_spaced_auth_type' (46252) panicked at openvpn-mgmt-codec\src\command.rs:1787:9:
assertion `left == right` failed
  left: Raw("username \"HTTP Proxy\" \"proxyuser\"")
 right: Username { auth_type: HttpProxy, value: <redacted> }

failures:
    command::tests::parse_username
    command::tests::parse_username_missing_value_is_err
    command::tests::parse_username_quoted_spaced_auth_type
    command::tests::parse_username_unknown_auth_type_falls_back

test result: FAILED. 359 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
