*** openvpn-mgmt-codec/src/command.rs:745:21: delete match arm "ok" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "ok" in <impl FromStr for OvpnCommand>::from_str
@@ -737,17 +737,17 @@
             // --- Interactive prompts ---
             "needok" => {
                 let (name, resp) =
                     args.rsplit_once(char::is_whitespace)
                         .ok_or(CommandParseError::MissingArgs(
                             "usage: needok <name> ok|cancel",
                         ))?;
                 let response = match resp {
-                    "ok" => NeedOkResponse::Ok,
+                     /* ~ changed by cargo-mutants ~ */
                     "cancel" => NeedOkResponse::Cancel,
                     _ => {
                         return Err(CommandParseError::InvalidChoice {
                             field: "needok response",
                             input: resp.to_string(),
                             hint: "use ok or cancel",
                         });
                     }

---- command::tests::parse_needok stdout ----

thread 'command::tests::parse_needok' (9364) panicked at openvpn-mgmt-codec\src\command.rs:1490:9:
assertion `left == right` failed
  left: Err(InvalidChoice { field: "needok response", input: "ok", hint: "use ok or cancel" })
 right: Ok(NeedOk { name: "token-insertion", response: Ok })

failures:
    command::tests::parse_needok

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
