*** openvpn-mgmt-codec/src/command.rs:746:21: delete match arm "cancel" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "cancel" in <impl FromStr for OvpnCommand>::from_str
@@ -738,17 +738,17 @@
             "needok" => {
                 let (name, resp) =
                     args.rsplit_once(char::is_whitespace)
                         .ok_or(CommandParseError::MissingArgs(
                             "usage: needok <name> ok|cancel",
                         ))?;
                 let response = match resp {
                     "ok" => NeedOkResponse::Ok,
-                    "cancel" => NeedOkResponse::Cancel,
+                     /* ~ changed by cargo-mutants ~ */
                     _ => {
                         return Err(CommandParseError::InvalidChoice {
                             field: "needok response",
                             input: resp.to_string(),
                             hint: "use ok or cancel",
                         });
                     }
                 };

---- command::tests::parse_needok stdout ----

thread 'command::tests::parse_needok' (18952) panicked at openvpn-mgmt-codec\src\command.rs:1497:9:
assertion `left == right` failed
  left: Err(InvalidChoice { field: "needok response", input: "cancel", hint: "use ok or cancel" })
 right: Ok(NeedOk { name: "token-insertion", response: Cancel })

failures:
    command::tests::parse_needok

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
