*** openvpn-mgmt-codec/src/command.rs:765:13: delete match arm "needstr" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "needstr" in <impl FromStr for OvpnCommand>::from_str
@@ -757,25 +757,17 @@
                     response,
                 })
             }
 
             // Wire format per management-notes.txt:
             //   needstr <name> <value>
             // where <value> may be quoted+escaped.
             // https://github.com/OpenVPN/openvpn/blob/master/doc/management-notes.txt
-            "needstr" => {
-                let (name, rest) = next_token(args).ok_or(CommandParseError::MissingArgs(
-                    "usage: needstr <name> <value>",
-                ))?;
-                let (value, _) = next_token(rest).ok_or(CommandParseError::MissingArgs(
-                    "usage: needstr <name> <value>",
-                ))?;
-                Ok(Self::NeedStr { name, value })
-            }
+             /* ~ changed by cargo-mutants ~ */
 
             // --- PKCS#11 ---
             "pkcs11-id-count" => Ok(Self::Pkcs11IdCount),
 
             "pkcs11-id-get" => args.parse::<u32>().map(Self::Pkcs11IdGet).map_err(|_| {
                 CommandParseError::InvalidNumber {
                     field: "pkcs11-id-get index",
                     input: args.to_string(),

---- command::tests::parse_needstr_missing_value stdout ----

thread 'command::tests::parse_needstr_missing_value' (46376) panicked at openvpn-mgmt-codec\src\command.rs:1880:9:
assertion failed: "needstr".parse::<OvpnCommand>().is_err()

---- command::tests::parse_needstr stdout ----

thread 'command::tests::parse_needstr' (16840) panicked at openvpn-mgmt-codec\src\command.rs:1502:9:
assertion `left == right` failed
  left: Ok(Raw("needstr prompt-name John"))
 right: Ok(NeedStr { name: "prompt-name", value: "John" })

failures:
    command::tests::parse_needstr
    command::tests::parse_needstr_missing_value

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
