*** openvpn-mgmt-codec/src/command.rs:776:13: delete match arm "pkcs11-id-count" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "pkcs11-id-count" in <impl FromStr for OvpnCommand>::from_str
@@ -768,17 +768,17 @@
                 ))?;
                 let (value, _) = next_token(rest).ok_or(CommandParseError::MissingArgs(
                     "usage: needstr <name> <value>",
                 ))?;
                 Ok(Self::NeedStr { name, value })
             }
 
             // --- PKCS#11 ---
-            "pkcs11-id-count" => Ok(Self::Pkcs11IdCount),
+             /* ~ changed by cargo-mutants ~ */
 
             "pkcs11-id-get" => args.parse::<u32>().map(Self::Pkcs11IdGet).map_err(|_| {
                 CommandParseError::InvalidNumber {
                     field: "pkcs11-id-get index",
                     input: args.to_string(),
                 }
             }),

---- command::tests::parse_simple_commands stdout ----

thread 'command::tests::parse_simple_commands' (7756) panicked at openvpn-mgmt-codec\src\command.rs:1241:9:
assertion `left == right` failed
  left: Ok(Raw("pkcs11-id-count"))
 right: Ok(Pkcs11IdCount)

failures:
    command::tests::parse_simple_commands

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
