*** openvpn-mgmt-codec/src/command.rs:778:13: delete match arm "pkcs11-id-get" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "pkcs11-id-get" in <impl FromStr for OvpnCommand>::from_str
@@ -770,22 +770,17 @@
                     "usage: needstr <name> <value>",
                 ))?;
                 Ok(Self::NeedStr { name, value })
             }
 
             // --- PKCS#11 ---
             "pkcs11-id-count" => Ok(Self::Pkcs11IdCount),
 
-            "pkcs11-id-get" => args.parse::<u32>().map(Self::Pkcs11IdGet).map_err(|_| {
-                CommandParseError::InvalidNumber {
-                    field: "pkcs11-id-get index",
-                    input: args.to_string(),
-                }
-            }),
+             /* ~ changed by cargo-mutants ~ */
 
             // --- Client management (server mode) ---
             "client-auth" => {
                 let mut parts = args.splitn(3, char::is_whitespace);
                 let cid = parts
                     .next()
                     .ok_or(CommandParseError::MissingArgs(
                         "usage: client-auth <cid> <kid> [config-lines]",

---- command::tests::parse_pkcs11_id_get stdout ----

thread 'command::tests::parse_pkcs11_id_get' (39700) panicked at openvpn-mgmt-codec\src\command.rs:1519:9:
assertion `left == right` failed
  left: Ok(Raw("pkcs11-id-get 1"))
 right: Ok(Pkcs11IdGet(1))

---- command::tests::parse_pkcs11_id_get_missing_arg stdout ----

thread 'command::tests::parse_pkcs11_id_get_missing_arg' (24416) panicked at openvpn-mgmt-codec\src\command.rs:1873:9:
assertion failed: "pkcs11-id-get".parse::<OvpnCommand>().is_err()

failures:
    command::tests::parse_pkcs11_id_get
    command::tests::parse_pkcs11_id_get_missing_arg

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
