*** openvpn-mgmt-codec/src/command.rs:837:13: delete match arm "client-deny" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "client-deny" in <impl FromStr for OvpnCommand>::from_str
@@ -829,40 +829,17 @@
                         .map_err(|_| CommandParseError::MissingArgs("kid must be a number"))?,
                 })
             }
 
             // Wire format per management-notes.txt:
             //   client-deny <cid> <kid> "reason" ["client-reason"]
             // Reason strings are quoted+escaped on the wire.
             // https://github.com/OpenVPN/openvpn/blob/master/doc/management-notes.txt
-            "client-deny" => {
-                let (cid_str, rest) = next_token(args).ok_or(CommandParseError::MissingArgs(
-                    "usage: client-deny <cid> <kid> <reason> [client-reason]",
-                ))?;
-                let cid = cid_str
-                    .parse::<u64>()
-                    .map_err(|_| CommandParseError::MissingArgs("cid must be a number"))?;
-                let (kid_str, rest) = next_token(rest).ok_or(CommandParseError::MissingArgs(
-                    "usage: client-deny <cid> <kid> <reason> [client-reason]",
-                ))?;
-                let kid = kid_str
-                    .parse::<u64>()
-                    .map_err(|_| CommandParseError::MissingArgs("kid must be a number"))?;
-                let (reason, rest) = next_token(rest).ok_or(CommandParseError::MissingArgs(
-                    "usage: client-deny <cid> <kid> <reason> [client-reason]",
-                ))?;
-                let client_reason = next_token(rest).map(|(cr, _)| cr);
-                Ok(Self::ClientDeny(ClientDeny {
-                    cid,
-                    kid,
-                    reason,
-                    client_reason,
-                }))
-            }
+             /* ~ changed by cargo-mutants ~ */
 
             "client-kill" => {
                 let (cid_str, message) = match args.split_once(char::is_whitespace) {
                     Some((c, m)) => (c, Some(m.trim().to_string())),
                     None => (args, None),
                 };
                 let cid = cid_str
                     .parse::<u64>()

---- command::tests::parse_client_deny stdout ----

thread 'command::tests::parse_client_deny' (23304) panicked at openvpn-mgmt-codec\src\command.rs:1548:9:
assertion `left == right` failed
  left: Ok(Raw("client-deny 1 2 rejected"))
 right: Ok(ClientDeny(ClientDeny { cid: 1, kid: 2, reason: "rejected", client_reason: None }))

---- command::tests::parse_client_deny_missing_args stdout ----

thread 'command::tests::parse_client_deny_missing_args' (44524) panicked at openvpn-mgmt-codec\src\command.rs:1830:9:
assertion failed: "client-deny".parse::<OvpnCommand>().is_err()

---- command::tests::parse_client_deny_non_numeric_ids stdout ----

thread 'command::tests::parse_client_deny_non_numeric_ids' (15960) panicked at openvpn-mgmt-codec\src\command.rs:1837:9:
assertion failed: "client-deny abc 1 reason".parse::<OvpnCommand>().is_err()

failures:
    command::tests::parse_client_deny
    command::tests::parse_client_deny_missing_args
    command::tests::parse_client_deny_non_numeric_ids

test result: FAILED. 360 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
