*** openvpn-mgmt-codec/src/command.rs:877:13: delete match arm "remote" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "remote" in <impl FromStr for OvpnCommand>::from_str
@@ -869,34 +869,17 @@
                     .map_err(|_| CommandParseError::InvalidNumber {
                         field: "client-kill CID",
                         input: cid_str.to_string(),
                     })?;
                 Ok(Self::ClientKill { cid, message })
             }
 
             // --- Remote/Proxy override ---
-            "remote" => match args.split_whitespace().collect::<Vec<_>>().as_slice() {
-                ["accept" | "ACCEPT"] => Ok(Self::Remote(RemoteAction::Accept)),
-                ["skip" | "SKIP"] => Ok(Self::Remote(RemoteAction::Skip)),
-                ["skip" | "SKIP", n] => Ok(Self::Remote(RemoteAction::SkipN(n.parse().map_err(
-                    |_| CommandParseError::InvalidChoice {
-                        field: "remote skip count",
-                        input: n.to_string(),
-                        hint: "expected a positive integer (e.g. remote SKIP 3)",
-                    },
-                )?))),
-                ["mod" | "MOD", host, port] => Ok(Self::Remote(RemoteAction::Modify {
-                    host: host.to_string(),
-                    port: port
-                        .parse()
-                        .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
-                })),
-                _ => cmd_err("usage: remote accept|skip [n]|mod <host> <port>"),
-            },
+             /* ~ changed by cargo-mutants ~ */
 
             "proxy" => match args.split_whitespace().collect::<Vec<_>>().as_slice() {
                 ["none" | "NONE"] => Ok(Self::Proxy(ProxyAction::None)),
                 ["http" | "HTTP", host, port] => Ok(Self::Proxy(ProxyAction::Http {
                     host: host.to_string(),
                     port: port
                         .parse()
                         .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,

---- command::tests::parse_remote stdout ----

thread 'command::tests::parse_remote' (9172) panicked at openvpn-mgmt-codec\src\command.rs:1597:9:
assertion `left == right` failed
  left: Ok(Raw("remote accept"))
 right: Ok(Remote(Accept))

---- command::tests::parse_remote_non_numeric_port stdout ----

thread 'command::tests::parse_remote_non_numeric_port' (16532) panicked at openvpn-mgmt-codec\src\command.rs:1849:9:
assertion failed: "remote mod host abc".parse::<OvpnCommand>().is_err()

failures:
    command::tests::parse_remote
    command::tests::parse_remote_non_numeric_port

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
