*** openvpn-mgmt-codec/src/command.rs:879:17: delete match arm ["skip" | "SKIP"] in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm ["skip" | "SKIP"] in <impl FromStr for OvpnCommand>::from_str
@@ -871,17 +871,17 @@
                         input: cid_str.to_string(),
                     })?;
                 Ok(Self::ClientKill { cid, message })
             }
 
             // --- Remote/Proxy override ---
             "remote" => match args.split_whitespace().collect::<Vec<_>>().as_slice() {
                 ["accept" | "ACCEPT"] => Ok(Self::Remote(RemoteAction::Accept)),
-                ["skip" | "SKIP"] => Ok(Self::Remote(RemoteAction::Skip)),
+                 /* ~ changed by cargo-mutants ~ */
                 ["skip" | "SKIP", n] => Ok(Self::Remote(RemoteAction::SkipN(n.parse().map_err(
                     |_| CommandParseError::InvalidChoice {
                         field: "remote skip count",
                         input: n.to_string(),
                         hint: "expected a positive integer (e.g. remote SKIP 3)",
                     },
                 )?))),
                 ["mod" | "MOD", host, port] => Ok(Self::Remote(RemoteAction::Modify {

---- command::tests::parse_remote stdout ----

thread 'command::tests::parse_remote' (29208) panicked at openvpn-mgmt-codec\src\command.rs:1618:9:
assertion `left == right` failed
  left: Err(MissingArgs("usage: remote accept|skip [n]|mod <host> <port>"))
 right: Ok(Remote(Skip))

failures:
    command::tests::parse_remote

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
