*** openvpn-mgmt-codec/src/command.rs:880:17: delete match arm ["skip" | "SKIP", n] in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm ["skip" | "SKIP", n] in <impl FromStr for OvpnCommand>::from_str
@@ -872,23 +872,17 @@
                     })?;
                 Ok(Self::ClientKill { cid, message })
             }
 
             // --- Remote/Proxy override ---
             "remote" => match args.split_whitespace().collect::<Vec<_>>().as_slice() {
                 ["accept" | "ACCEPT"] => Ok(Self::Remote(RemoteAction::Accept)),
                 ["skip" | "SKIP"] => Ok(Self::Remote(RemoteAction::Skip)),
-                ["skip" | "SKIP", n] => Ok(Self::Remote(RemoteAction::SkipN(n.parse().map_err(
-                    |_| CommandParseError::InvalidChoice {
-                        field: "remote skip count",
-                        input: n.to_string(),
-                        hint: "expected a positive integer (e.g. remote SKIP 3)",
-                    },
-                )?))),
+                 /* ~ changed by cargo-mutants ~ */
                 ["mod" | "MOD", host, port] => Ok(Self::Remote(RemoteAction::Modify {
                     host: host.to_string(),
                     port: port
                         .parse()
                         .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
                 })),
                 _ => cmd_err("usage: remote accept|skip [n]|mod <host> <port>"),
             },

---- command_encode_parse_roundtrip stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'command_encode_parse_roundtrip' (40636) panicked at openvpn-mgmt-codec\tests\proptest_roundtrip.rs:1427:37:
FromStr failed on encoder output "remote SKIP 87": usage: remote accept|skip [n]|mod <host> <port>

thread 'command_encode_parse_roundtrip' (40636) panicked at openvpn-mgmt-codec\tests\proptest_roundtrip.rs:1427:37:
FromStr failed on encoder output "remote SKIP 44": usage: remote accept|skip [n]|mod <host> <port>

thread 'command_encode_parse_roundtrip' (40636) panicked at openvpn-mgmt-codec\tests\proptest_roundtrip.rs:1427:37:
FromStr failed on encoder output "remote SKIP 22": usage: remote accept|skip [n]|mod <host> <port>

thread 'command_encode_parse_roundtrip' (40636) panicked at openvpn-mgmt-codec\tests\proptest_roundtrip.rs:1427:

failures:
    command_encode_parse_roundtrip

test result: FAILED. 34 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
