*** openvpn-mgmt-codec/src/command.rs:887:17: delete match arm ["mod" | "MOD", host, port] in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm ["mod" | "MOD", host, port] in <impl FromStr for OvpnCommand>::from_str
@@ -879,22 +879,17 @@
                 ["skip" | "SKIP"] => Ok(Self::Remote(RemoteAction::Skip)),
                 ["skip" | "SKIP", n] => Ok(Self::Remote(RemoteAction::SkipN(n.parse().map_err(
                     |_| CommandParseError::InvalidChoice {
                         field: "remote skip count",
                         input: n.to_string(),
                         hint: "expected a positive integer (e.g. remote SKIP 3)",
                     },
                 )?))),
-                ["mod" | "MOD", host, port] => Ok(Self::Remote(RemoteAction::Modify {
-                    host: host.to_string(),
-                    port: port
-                        .parse()
-                        .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
-                })),
+                 /* ~ changed by cargo-mutants ~ */
                 _ => cmd_err("usage: remote accept|skip [n]|mod <host> <port>"),
             },
 
             "proxy" => match args.split_whitespace().collect::<Vec<_>>().as_slice() {
                 ["none" | "NONE"] => Ok(Self::Proxy(ProxyAction::None)),
                 ["http" | "HTTP", host, port] => Ok(Self::Proxy(ProxyAction::Http {
                     host: host.to_string(),
                     port: port

---- command::tests::parse_remote stdout ----

thread 'command::tests::parse_remote' (30176) panicked at openvpn-mgmt-codec\src\command.rs:1617:9:
assertion `left == right` failed
  left: Err(MissingArgs("usage: remote accept|skip [n]|mod <host> <port>"))
 right: Ok(Remote(Modify { host: "example.com", port: 443 }))

failures:
    command::tests::parse_remote

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
