*** openvpn-mgmt-codec/src/command.rs:896:13: delete match arm "proxy" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "proxy" in <impl FromStr for OvpnCommand>::from_str
@@ -888,40 +888,17 @@
                     host: host.to_string(),
                     port: port
                         .parse()
                         .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
                 })),
                 _ => cmd_err("usage: remote accept|skip [n]|mod <host> <port>"),
             },
 
-            "proxy" => match args.split_whitespace().collect::<Vec<_>>().as_slice() {
-                ["none" | "NONE"] => Ok(Self::Proxy(ProxyAction::None)),
-                ["http" | "HTTP", host, port] => Ok(Self::Proxy(ProxyAction::Http {
-                    host: host.to_string(),
-                    port: port
-                        .parse()
-                        .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
-                    non_cleartext_only: false,
-                })),
-                ["http" | "HTTP", host, port, "nct"] => Ok(Self::Proxy(ProxyAction::Http {
-                    host: host.to_string(),
-                    port: port
-                        .parse()
-                        .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
-                    non_cleartext_only: true,
-                })),
-                ["socks" | "SOCKS", host, port] => Ok(Self::Proxy(ProxyAction::Socks {
-                    host: host.to_string(),
-                    port: port
-                        .parse()
-                        .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
-                })),
-                _ => cmd_err("usage: proxy none|http <host> <port> [nct]|socks <host> <port>"),
-            },
+             /* ~ changed by cargo-mutants ~ */
 
             // --- ENV filter ---
             "env-filter" => {
                 let level = if args.is_empty() {
                     0
                 } else {
                     args.parse::<u32>()
                         .map_err(|_| CommandParseError::InvalidNumber {

---- command::tests::parse_proxy_non_numeric_port stdout ----

thread 'command::tests::parse_proxy_non_numeric_port' (44300) panicked at openvpn-mgmt-codec\src\command.rs:1848:9:
assertion failed: "proxy http host abc".parse::<OvpnCommand>().is_err()

---- command::tests::parse_proxy stdout ----

thread 'command::tests::parse_proxy' (21652) panicked at openvpn-mgmt-codec\src\command.rs:1611:9:
assertion `left == right` failed
  left: Ok(Raw("proxy none"))
 right: Ok(Proxy(None))

failures:
    command::tests::parse_proxy
    command::tests::parse_proxy_non_numeric_port

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
