*** openvpn-mgmt-codec/src/command.rs:897:17: delete match arm ["none" | "NONE"] in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm ["none" | "NONE"] in <impl FromStr for OvpnCommand>::from_str
@@ -889,17 +889,17 @@
                     port: port
                         .parse()
                         .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
                 })),
                 _ => cmd_err("usage: remote accept|skip [n]|mod <host> <port>"),
             },
 
             "proxy" => match args.split_whitespace().collect::<Vec<_>>().as_slice() {
-                ["none" | "NONE"] => Ok(Self::Proxy(ProxyAction::None)),
+                 /* ~ changed by cargo-mutants ~ */
                 ["http" | "HTTP", host, port] => Ok(Self::Proxy(ProxyAction::Http {
                     host: host.to_string(),
                     port: port
                         .parse()
                         .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
                     non_cleartext_only: false,
                 })),
                 ["http" | "HTTP", host, port, "nct"] => Ok(Self::Proxy(ProxyAction::Http {

---- command::tests::parse_proxy stdout ----

thread 'command::tests::parse_proxy' (14736) panicked at openvpn-mgmt-codec\src\command.rs:1634:9:
assertion `left == right` failed
  left: Err(MissingArgs("usage: proxy none|http <host> <port> [nct]|socks <host> <port>"))
 right: Ok(Proxy(None))

failures:
    command::tests::parse_proxy

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
