*** openvpn-mgmt-codec/src/command.rs:898:17: delete match arm ["http" | "HTTP", host, port] in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm ["http" | "HTTP", host, port] in <impl FromStr for OvpnCommand>::from_str
@@ -890,23 +890,17 @@
                         .parse()
                         .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
                 })),
                 _ => cmd_err("usage: remote accept|skip [n]|mod <host> <port>"),
             },
 
             "proxy" => match args.split_whitespace().collect::<Vec<_>>().as_slice() {
                 ["none" | "NONE"] => Ok(Self::Proxy(ProxyAction::None)),
-                ["http" | "HTTP", host, port] => Ok(Self::Proxy(ProxyAction::Http {
-                    host: host.to_string(),
-                    port: port
-                        .parse()
-                        .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
-                    non_cleartext_only: false,
-                })),
+                 /* ~ changed by cargo-mutants ~ */
                 ["http" | "HTTP", host, port, "nct"] => Ok(Self::Proxy(ProxyAction::Http {
                     host: host.to_string(),
                     port: port
                         .parse()
                         .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
                     non_cleartext_only: true,
                 })),
                 ["socks" | "SOCKS", host, port] => Ok(Self::Proxy(ProxyAction::Socks {

---- command::tests::parse_proxy stdout ----

thread 'command::tests::parse_proxy' (31504) panicked at openvpn-mgmt-codec\src\command.rs:1632:9:
assertion `left == right` failed
  left: Err(MissingArgs("usage: proxy none|http <host> <port> [nct]|socks <host> <port>"))
 right: Ok(Proxy(Http { host: "proxy.local", port: 8080, non_cleartext_only: false }))

failures:
    command::tests::parse_proxy

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
