*** openvpn-mgmt-codec/src/command.rs:905:17: delete match arm ["http" | "HTTP", host, port, "nct"] in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm ["http" | "HTTP", host, port, "nct"] in <impl FromStr for OvpnCommand>::from_str
@@ -897,23 +897,17 @@
                 ["none" | "NONE"] => Ok(Self::Proxy(ProxyAction::None)),
                 ["http" | "HTTP", host, port] => Ok(Self::Proxy(ProxyAction::Http {
                     host: host.to_string(),
                     port: port
                         .parse()
                         .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
                     non_cleartext_only: false,
                 })),
-                ["http" | "HTTP", host, port, "nct"] => Ok(Self::Proxy(ProxyAction::Http {
-                    host: host.to_string(),
-                    port: port
-                        .parse()
-                        .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
-                    non_cleartext_only: true,
-                })),
+                 /* ~ changed by cargo-mutants ~ */
                 ["socks" | "SOCKS", host, port] => Ok(Self::Proxy(ProxyAction::Socks {
                     host: host.to_string(),
                     port: port
                         .parse()
                         .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
                 })),
                 _ => cmd_err("usage: proxy none|http <host> <port> [nct]|socks <host> <port>"),
             },

---- command::tests::parse_proxy stdout ----

thread 'command::tests::parse_proxy' (8936) panicked at openvpn-mgmt-codec\src\command.rs:1640:9:
assertion `left == right` failed
  left: Err(MissingArgs("usage: proxy none|http <host> <port> [nct]|socks <host> <port>"))
 right: Ok(Proxy(Http { host: "proxy.local", port: 8080, non_cleartext_only: true }))

failures:
    command::tests::parse_proxy

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
