*** openvpn-mgmt-codec/src/command.rs:912:17: delete match arm ["socks" | "SOCKS", host, port] in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm ["socks" | "SOCKS", host, port] in <impl FromStr for OvpnCommand>::from_str
@@ -904,22 +904,17 @@
                 })),
                 ["http" | "HTTP", host, port, "nct"] => Ok(Self::Proxy(ProxyAction::Http {
                     host: host.to_string(),
                     port: port
                         .parse()
                         .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
                     non_cleartext_only: true,
                 })),
-                ["socks" | "SOCKS", host, port] => Ok(Self::Proxy(ProxyAction::Socks {
-                    host: host.to_string(),
-                    port: port
-                        .parse()
-                        .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
-                })),
+                 /* ~ changed by cargo-mutants ~ */
                 _ => cmd_err("usage: proxy none|http <host> <port> [nct]|socks <host> <port>"),
             },
 
             // --- ENV filter ---
             "env-filter" => {
                 let level = if args.is_empty() {
                     0
                 } else {

---- command::tests::parse_proxy stdout ----

thread 'command::tests::parse_proxy' (40204) panicked at openvpn-mgmt-codec\src\command.rs:1649:9:
assertion `left == right` failed
  left: Err(MissingArgs("usage: proxy none|http <host> <port> [nct]|socks <host> <port>"))
 right: Ok(Proxy(Socks { host: "socks.local", port: 1080 }))

failures:
    command::tests::parse_proxy

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.11s

*** result: Failure(101)
