*** openvpn-mgmt-codec/src/command.rs:922:13: delete match arm "env-filter" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "env-filter" in <impl FromStr for OvpnCommand>::from_str
@@ -914,28 +914,17 @@
                     port: port
                         .parse()
                         .map_err(|_| CommandParseError::MissingArgs("port must be a number"))?,
                 })),
                 _ => cmd_err("usage: proxy none|http <host> <port> [nct]|socks <host> <port>"),
             },
 
             // --- ENV filter ---
-            "env-filter" => {
-                let level = if args.is_empty() {
-                    0
-                } else {
-                    args.parse::<u32>()
-                        .map_err(|_| CommandParseError::InvalidNumber {
-                            field: "env-filter level",
-                            input: args.to_string(),
-                        })?
-                };
-                Ok(Self::EnvFilter(level))
-            }
+             /* ~ changed by cargo-mutants ~ */
 
             // --- Remote entry queries ---
             "remote-entry-count" => Ok(Self::RemoteEntryCount),
 
             "remote-entry-get" => {
                 if args.is_empty() {
                     return cmd_err("usage: remote-entry-get i|all [j]");
                 }

---- command::tests::parse_env_filter stdout ----

thread 'command::tests::parse_env_filter' (16600) panicked at openvpn-mgmt-codec\src\command.rs:1884:9:
assertion `left == right` failed
  left: Ok(Raw("env-filter 2"))
 right: Ok(EnvFilter(2))

failures:
    command::tests::parse_env_filter

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
