*** openvpn-mgmt-codec/src/command.rs:936:13: delete match arm "remote-entry-count" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "remote-entry-count" in <impl FromStr for OvpnCommand>::from_str
@@ -928,17 +928,17 @@
                             field: "env-filter level",
                             input: args.to_string(),
                         })?
                 };
                 Ok(Self::EnvFilter(level))
             }
 
             // --- Remote entry queries ---
-            "remote-entry-count" => Ok(Self::RemoteEntryCount),
+             /* ~ changed by cargo-mutants ~ */
 
             "remote-entry-get" => {
                 if args.is_empty() {
                     return cmd_err("usage: remote-entry-get i|all [j]");
                 }
                 let range = if args == "all" {
                     RemoteEntryRange::All
                 } else {

---- command::tests::parse_remote_entry_count stdout ----

thread 'command::tests::parse_remote_entry_count' (31252) panicked at openvpn-mgmt-codec\src\command.rs:1903:9:
assertion `left == right` failed
  left: Ok(Raw("remote-entry-count"))
 right: Ok(RemoteEntryCount)

failures:
    command::tests::parse_remote_entry_count

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
