*** openvpn-mgmt-codec/src/command.rs:942:37: replace == with != in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ replace == with != in <impl FromStr for OvpnCommand>::from_str
@@ -934,17 +934,17 @@
 
             // --- Remote entry queries ---
             "remote-entry-count" => Ok(Self::RemoteEntryCount),
 
             "remote-entry-get" => {
                 if args.is_empty() {
                     return cmd_err("usage: remote-entry-get i|all [j]");
                 }
-                let range = if args == "all" {
+                let range = if args != /* ~ changed by cargo-mutants ~ */ "all" {
                     RemoteEntryRange::All
                 } else {
                     let mut parts = args.splitn(2, char::is_whitespace);
                     let from = parts.next().unwrap().parse::<u32>().map_err(|_| {
                         CommandParseError::InvalidNumber {
                             field: "remote-entry-get index",
                             input: args.to_string(),
                         }

---- command::tests::parse_remote_entry_get stdout ----

thread 'command::tests::parse_remote_entry_get' (24284) panicked at openvpn-mgmt-codec\src\command.rs:1911:9:
assertion `left == right` failed
  left: Ok(RemoteEntryGet(All))
 right: Ok(RemoteEntryGet(Single(0)))

failures:
    command::tests::parse_remote_entry_get

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.31s

*** result: Failure(101)
