*** openvpn-mgmt-codec/src/command.rs:974:13: delete match arm "push-update-broad" in <impl FromStr for OvpnCommand>::from_str

*** mutation diff:
--- openvpn-mgmt-codec/src/command.rs
+++ delete match arm "push-update-broad" in <impl FromStr for OvpnCommand>::from_str
@@ -966,22 +966,17 @@
             }
 
             // --- Push updates ---
             // Wire format per management-notes.txt:
             //   push-update-broad "options"
             //   push-update-cid <cid> "options"
             // Options are quoted+escaped on the wire.
             // https://github.com/OpenVPN/openvpn/blob/master/doc/management-notes.txt
-            "push-update-broad" => {
-                let (options, _) = next_token(args).ok_or(CommandParseError::MissingArgs(
-                    "usage: push-update-broad <options>",
-                ))?;
-                Ok(Self::PushUpdateBroad { options })
-            }
+             /* ~ changed by cargo-mutants ~ */
 
             "push-update-cid" => {
                 let (cid_str, rest) = next_token(args).ok_or(CommandParseError::MissingArgs(
                     "usage: push-update-cid <cid> <options>",
                 ))?;
                 let cid = cid_str.parse::<u64>().map_err(|_| {
                     CommandParseError::MissingArgs("push-update-cid: cid must be a number")
                 })?;

---- command::tests::parse_push_update_broad stdout ----

thread 'command::tests::parse_push_update_broad' (43596) panicked at openvpn-mgmt-codec\src\command.rs:1931:9:
assertion `left == right` failed
  left: Raw("push-update-broad \"route 10.0.0.0\"")
 right: PushUpdateBroad { options: "route 10.0.0.0" }

failures:
    command::tests::parse_push_update_broad

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
