*** openvpn-mgmt-codec/src/crv1_challenge.rs:73:9: replace <impl fmt::Display for Crv1Challenge>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- openvpn-mgmt-codec/src/crv1_challenge.rs
+++ replace <impl fmt::Display for Crv1Challenge>::fmt -> fmt::Result with Ok(Default::default())
@@ -65,25 +65,17 @@
 
     /// Challenge text presented to the user (sent in clear text).
     #[builder(into)]
     pub challenge_text: String,
 }
 
 impl fmt::Display for Crv1Challenge {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        let engine = base64::engine::general_purpose::STANDARD;
-        write!(
-            f,
-            "CRV1:{}:{}:{}:{}",
-            self.flags,
-            engine.encode(&self.state_id),
-            engine.encode(&self.username),
-            self.challenge_text,
-        )
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- crv1_challenge::tests::display_produces_valid_crv1_string stdout ----

thread 'crv1_challenge::tests::display_produces_valid_crv1_string' (46712) panicked at openvpn-mgmt-codec\src\crv1_challenge.rs:92:9:
assertion failed: wire.starts_with("CRV1:R,E:")

---- crv1_challenge::tests::empty_fields stdout ----

thread 'crv1_challenge::tests::empty_fields' (32980) panicked at openvpn-mgmt-codec\src\crv1_challenge.rs:122:9:
assertion `left == right` failed
  left: ""
 right: "CRV1::::"

---- crv1_challenge::tests::roundtrip_with_special_characters stdout ----

thread 'crv1_challenge::tests::roundtrip_with_special_characters' (44516) panicked at openvpn-mgmt-codec\src\crv1_challenge.rs:138:61:
index out of bounds: the len is 1 but the index is 2

failures:
    crv1_challenge::tests::display_produces_valid_crv1_string
    crv1_challenge::tests::empty_fields
    crv1_challenge::tests::roundtrip_with_special_characters

test result: FAILED. 360 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
