*** openvpn-mgmt-codec/src/log_level.rs:39:9: replace LogLevel::label -> &str with "xyzzy"

*** mutation diff:
--- openvpn-mgmt-codec/src/log_level.rs
+++ replace LogLevel::label -> &str with "xyzzy"
@@ -31,24 +31,17 @@
     /// An unrecognized log flag (forward compatibility).
     #[strum(default)]
     Unknown(String),
 }
 
 impl LogLevel {
     /// Human-readable label (e.g. `"INFO"`, `"WARN"`).
     pub fn label(&self) -> &str {
-        match self {
-            Self::Info => "INFO",
-            Self::Debug => "DEBUG",
-            Self::Warning => "WARN",
-            Self::NonFatal => "NFATAL",
-            Self::Fatal => "FATAL",
-            Self::Unknown(s) => s,
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl FromStr for LogLevel {
     type Err = ParseLogLevelError;
 
     /// Parse a recognized log-flag string: `I`, `D`, `W`, `N`, `F`.
     fn from_str(input: &str) -> Result<Self, Self::Err> {

---- log_level::tests::label_known_variants stdout ----

thread 'log_level::tests::label_known_variants' (45136) panicked at openvpn-mgmt-codec\src\log_level.rs:81:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "INFO"

---- log_level::tests::label_unknown_returns_inner stdout ----

thread 'log_level::tests::label_unknown_returns_inner' (40676) panicked at openvpn-mgmt-codec\src\log_level.rs:91:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "Z"

failures:
    log_level::tests::label_known_variants
    log_level::tests::label_unknown_returns_inner

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
