*** openvpn-mgmt-codec/src/parsed_response.rs:156:5: replace parse_hold -> Result<bool, ParseResponseError> with Ok(false)

*** mutation diff:
--- openvpn-mgmt-codec/src/parsed_response.rs
+++ replace parse_hold -> Result<bool, ParseResponseError> with Ok(false)
@@ -148,24 +148,17 @@
 /// `hold release` the flag stays on but the server is no longer waiting.
 ///
 /// ```
 /// use openvpn_mgmt_codec::parsed_response::parse_hold;
 /// assert_eq!(parse_hold("hold=1"), Ok(true));
 /// assert_eq!(parse_hold("hold=0"), Ok(false));
 /// ```
 pub fn parse_hold(payload: &str) -> Result<bool, ParseResponseError> {
-    let val = payload
-        .strip_prefix("hold=")
-        .ok_or_else(|| ParseResponseError::MissingHoldPrefix(payload.to_string()))?;
-    match val {
-        "1" => Ok(true),
-        "0" => Ok(false),
-        _ => Err(ParseResponseError::InvalidHoldValue(val.to_string())),
-    }
+    Ok(false) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse the multi-line response from a `version` command into a
 /// [`VersionInfo`].
 ///
 /// This is a convenience wrapper around [`VersionInfo::parse`].
 ///
 /// ```

---- client::tests::hold_query_parsed stdout ----

thread 'client::tests::hold_query_parsed' (32992) panicked at openvpn-mgmt-codec\src\client.rs:729:9:
assertion failed: client.hold_query().await.unwrap()

---- parsed_response::tests::hold_invalid_value stdout ----

thread 'parsed_response::tests::hold_invalid_value' (37628) panicked at openvpn-mgmt-codec\src\parsed_response.rs:401:9:
assertion failed: parse_hold("hold=maybe").is_err()

---- parsed_response::tests::hold_active stdout ----

thread 'parsed_response::tests::hold_active' (8092) panicked at openvpn-mgmt-codec\src\parsed_response.rs:386:9:
assertion `left == right` failed
  left: Ok(false)
 right: Ok(true)

failures:
    client::tests::hold_query_parsed
    parsed_response::tests::hold_active
    parsed_response::tests::hold_invalid_value
    parsed_response::tests::hold_missing_prefix

test result: FAILED. 359 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
