*** openvpn-mgmt-codec/src/parsed_response.rs:160:9: delete match arm "1" in parse_hold

*** mutation diff:
--- openvpn-mgmt-codec/src/parsed_response.rs
+++ delete match arm "1" in parse_hold
@@ -152,17 +152,17 @@
 /// assert_eq!(parse_hold("hold=1"), Ok(true));
 /// assert_eq!(parse_hold("hold=0"), Ok(false));
 /// ```
 pub fn parse_hold(payload: &str) -> Result<bool, ParseResponseError> {
     let val = payload
         .strip_prefix("hold=")
         .ok_or_else(|| ParseResponseError::MissingHoldPrefix(payload.to_string()))?;
     match val {
-        "1" => Ok(true),
+         /* ~ changed by cargo-mutants ~ */
         "0" => Ok(false),
         _ => Err(ParseResponseError::InvalidHoldValue(val.to_string())),
     }
 }
 
 /// Parse the multi-line response from a `version` command into a
 /// [`VersionInfo`].
 ///

---- client::tests::hold_query_parsed stdout ----

thread 'client::tests::hold_query_parsed' (22024) panicked at openvpn-mgmt-codec\src\client.rs:729:43:
called `Result::unwrap()` on an `Err` value: ParseResponse(InvalidHoldValue("1"))

---- parsed_response::tests::hold_active stdout ----

thread 'parsed_response::tests::hold_active' (36712) panicked at openvpn-mgmt-codec\src\parsed_response.rs:393:9:
assertion `left == right` failed
  left: Err(InvalidHoldValue("1"))
 right: Ok(true)

failures:
    client::tests::hold_query_parsed
    parsed_response::tests::hold_active

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
