*** openvpn-mgmt-codec/src/parsed_response.rs:161:9: delete match arm "0" in parse_hold

*** mutation diff:
--- openvpn-mgmt-codec/src/parsed_response.rs
+++ delete match arm "0" in parse_hold
@@ -153,17 +153,17 @@
 /// assert_eq!(parse_hold("hold=0"), Ok(false));
 /// ```
 pub fn parse_hold(payload: &str) -> Result<bool, ParseResponseError> {
     let val = payload
         .strip_prefix("hold=")
         .ok_or_else(|| ParseResponseError::MissingHoldPrefix(payload.to_string()))?;
     match val {
         "1" => Ok(true),
-        "0" => Ok(false),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(ParseResponseError::InvalidHoldValue(val.to_string())),
     }
 }
 
 /// Parse the multi-line response from a `version` command into a
 /// [`VersionInfo`].
 ///
 /// This is a convenience wrapper around [`VersionInfo::parse`].

---- client::tests::hold_query_returns_false stdout ----

thread 'client::tests::hold_query_returns_false' (44840) panicked at openvpn-mgmt-codec\src\client.rs:735:44:
called `Result::unwrap()` on an `Err` value: ParseResponse(InvalidHoldValue("0"))

---- parsed_response::tests::hold_inactive stdout ----

thread 'parsed_response::tests::hold_inactive' (34268) panicked at openvpn-mgmt-codec\src\parsed_response.rs:398:9:
assertion `left == right` failed
  left: Err(InvalidHoldValue("0"))
 right: Ok(false)

failures:
    client::tests::hold_query_returns_false
    parsed_response::tests::hold_inactive

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
