*** openvpn-mgmt-codec/src/parsed_response.rs:240:21: replace < with > in parse_state_entry

*** mutation diff:
--- openvpn-mgmt-codec/src/parsed_response.rs
+++ replace < with > in parse_state_entry
@@ -232,17 +232,17 @@
 /// assert_eq!(entry.name.to_string(), "CONNECTED");
 /// assert!(entry.description.is_empty());
 ///
 /// // Invalid state name:
 /// assert!(parse_state_entry("1711234567,BOGUS").is_err());
 /// ```
 pub fn parse_state_entry(line: &str) -> Result<StateEntry, ParseResponseError> {
     let fields: Vec<&str> = line.splitn(9, ',').collect();
-    if fields.len() < 2 {
+    if fields.len() > /* ~ changed by cargo-mutants ~ */ 2 {
         return Err(ParseResponseError::StateTooFewFields(fields.len()));
     }
 
     let timestamp = fields[0]
         .parse::<u64>()
         .map_err(|_| ParseResponseError::InvalidTimestamp(fields[0].to_string()))?;
     let name = fields[1].parse::<OpenVpnState>()?;

---- client::tests::current_state_returns_single_entry stdout ----

thread 'client::tests::current_state_returns_single_entry' (42724) panicked at openvpn-mgmt-codec\src\client.rs:1089:50:
called `Result::unwrap()` on an `Err` value: ParseResponse(StateTooFewFields(9))

---- client::tests::state_returns_parsed_entries stdout ----

thread 'client::tests::state_returns_parsed_entries' (32220) panicked at openvpn-mgmt-codec\src\client.rs:1074:44:
called `Result::unwrap()` on an `Err` value: ParseResponse(StateTooFewFields(9))

---- client::tests::state_stream_all_returns_parsed_history stdout ----

thread 'client::tests::state_stream_all_returns_parsed_history' (30772) panicked at openvpn-mgmt-codec\src\client.rs:1135:66:
called `Result::unwrap()` on an `Err` value: ParseResponse(StateTooFewFields(9))

failures:
    client::tests::current_state_returns_single_entry
    client::tests::state_returns_parsed_entries
    client::tests::state_stream_all_returns_parsed_history
    parsed_response::tests::current_state_returns_last
    parsed_response::tests::state_entry_full
    parsed_response::tests::state_entry_optional_ports_empty
    parsed_response::tests::state_entry_too_few_fields
    parsed_response::tests::state_history_roundtrip

test result: FAILED. 355 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
