*** openvpn-mgmt-codec/src/parsed_response.rs:240:21: replace < with <= in parse_state_entry

*** mutation diff:
--- openvpn-mgmt-codec/src/parsed_response.rs
+++ replace < with <= in parse_state_entry
@@ -232,17 +232,17 @@
 /// assert_eq!(entry.name.to_string(), "CONNECTED");
 /// assert!(entry.description.is_empty());
 ///
 /// // Invalid state name:
 /// assert!(parse_state_entry("1711234567,BOGUS").is_err());
 /// ```
 pub fn parse_state_entry(line: &str) -> Result<StateEntry, ParseResponseError> {
     let fields: Vec<&str> = line.splitn(9, ',').collect();
-    if fields.len() < 2 {
+    if fields.len() <= /* ~ changed by cargo-mutants ~ */ 2 {
         return Err(ParseResponseError::StateTooFewFields(fields.len()));
     }
 
     let timestamp = fields[0]
         .parse::<u64>()
         .map_err(|_| ParseResponseError::InvalidTimestamp(fields[0].to_string()))?;
     let name = fields[1].parse::<OpenVpnState>()?;

---- parsed_response::tests::state_entry_bad_timestamp stdout ----

thread 'parsed_response::tests::state_entry_bad_timestamp' (9544) panicked at openvpn-mgmt-codec\src\parsed_response.rs:455:9:
assertion failed: matches!(parse_state_entry("notanumber,CONNECTED"),
    Err(ParseResponseError::InvalidTimestamp(_)))

---- parsed_response::tests::state_entry_minimal stdout ----

thread 'parsed_response::tests::state_entry_minimal' (17328) panicked at openvpn-mgmt-codec\src\parsed_response.rs:430:55:
called `Result::unwrap()` on an `Err` value: StateTooFewFields(2)

failures:
    parsed_response::tests::state_entry_bad_timestamp
    parsed_response::tests::state_entry_minimal

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
