*** openvpn-mgmt-codec/src/parsed_response.rs:295:5: replace parse_state_history -> Result<Vec<StateEntry>, ParseResponseError> with Ok(vec![])

*** mutation diff:
--- openvpn-mgmt-codec/src/parsed_response.rs
+++ replace parse_state_history -> Result<Vec<StateEntry>, ParseResponseError> with Ok(vec![])
@@ -287,17 +287,17 @@
 ///     "1711234560,CONNECTING,,,,,,,".to_string(),
 ///     "1711234567,CONNECTED,SUCCESS,10.8.0.6,198.51.100.1,1194,,".to_string(),
 /// ];
 /// let entries = parse_state_history(&lines).unwrap();
 /// assert_eq!(entries.len(), 2);
 /// assert_eq!(entries[1].name.to_string(), "CONNECTED");
 /// ```
 pub fn parse_state_history(lines: &[String]) -> Result<Vec<StateEntry>, ParseResponseError> {
-    lines.iter().map(|line| parse_state_entry(line)).collect()
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Extract the current (most recent) state from a `state` or `state on all`
 /// multi-line response.
 ///
 /// This is a convenience wrapper that parses all entries and returns the
 /// last one.
 ///

---- client::tests::current_state_returns_single_entry stdout ----

thread 'client::tests::current_state_returns_single_entry' (6052) panicked at openvpn-mgmt-codec\src\client.rs:1089:50:
called `Result::unwrap()` on an `Err` value: ParseResponse(EmptyStateHistory)

---- client::tests::state_stream_all_returns_parsed_history stdout ----

thread 'client::tests::state_stream_all_returns_parsed_history' (32812) panicked at openvpn-mgmt-codec\src\client.rs:1136:9:
assertion `left == right` failed
  left: 0
 right: 1

---- client::tests::state_returns_parsed_entries stdout ----

thread 'client::tests::state_returns_parsed_entries' (9304) panicked at openvpn-mgmt-codec\src\client.rs:1075:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    client::tests::current_state_returns_single_entry
    client::tests::state_returns_parsed_entries
    client::tests::state_stream_all_returns_parsed_history
    parsed_response::tests::current_state_returns_last
    parsed_response::tests::state_history_roundtrip

test result: FAILED. 356 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
