*** openvpn-mgmt-codec/src/parsed_response.rs:94:5: replace parse_pid -> Result<u32, ParseResponseError> with Ok(0)

*** mutation diff:
--- openvpn-mgmt-codec/src/parsed_response.rs
+++ replace parse_pid -> Result<u32, ParseResponseError> with Ok(0)
@@ -86,23 +86,17 @@
 /// Expects the format `pid=N` and returns the PID as `u32`.
 ///
 /// ```
 /// use openvpn_mgmt_codec::parsed_response::parse_pid;
 /// assert_eq!(parse_pid("pid=12345"), Ok(12345));
 /// assert!(parse_pid("garbage").is_err());
 /// ```
 pub fn parse_pid(payload: &str) -> Result<u32, ParseResponseError> {
-    let val = payload
-        .strip_prefix("pid=")
-        .ok_or_else(|| ParseResponseError::MissingPidPrefix(payload.to_string()))?;
-    val.parse().map_err(|_| ParseResponseError::InvalidInteger {
-        field: "pid",
-        value: val.to_string(),
-    })
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse the `SUCCESS:` payload from a `load-stats` command.
 ///
 /// Expects the format `nclients=N,bytesin=N,bytesout=N`.
 ///
 /// ```
 /// use openvpn_mgmt_codec::parsed_response::parse_load_stats;

---- client::tests::multiple_notification_subscribers stdout ----

thread 'client::tests::multiple_notification_subscribers' (13268) panicked at openvpn-mgmt-codec\src\client.rs:1203:9:
assertion `left == right` failed
  left: 0
 right: 1

---- client::tests::notifications_forwarded_during_command stdout ----

thread 'client::tests::notifications_forwarded_during_command' (37972) panicked at openvpn-mgmt-codec\src\client.rs:1181:9:
assertion `left == right` failed
  left: 0
 right: 99

---- client::tests::pid_returns_parsed_value stdout ----

thread 'client::tests::pid_returns_parsed_value' (37112) panicked at openvpn-mgmt-codec\src\client.rs:713:9:
assertion `left == right` failed
  left: 0
 right: 42

failures:
    client::tests::multiple_notification_subscribers
    client::tests::notifications_forwarded_during_command
    client::tests::parse_error_for_malformed_pid
    client::tests::pid_returns_parsed_value
    parsed_response::tests::pid_missing_prefix
    parsed_response::tests::pid_normal
    parsed_response::tests::pid_not_a_number

test result: FAILED. 356 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
