*** openvpn-mgmt-codec/src/parsed_response.rs:94:5: replace parse_pid -> Result<u32, ParseResponseError> with Ok(1)

*** mutation diff:
--- openvpn-mgmt-codec/src/parsed_response.rs
+++ replace parse_pid -> Result<u32, ParseResponseError> with Ok(1)
@@ -86,23 +86,17 @@
 /// Expects the format `pid=N` and returns the PID as `u32`.
 ///
 /// ```
 /// use openvpn_mgmt_codec::parsed_response::parse_pid;
 /// assert_eq!(parse_pid("pid=12345"), Ok(12345));
 /// assert!(parse_pid("garbage").is_err());
 /// ```
 pub fn parse_pid(payload: &str) -> Result<u32, ParseResponseError> {
-    let val = payload
-        .strip_prefix("pid=")
-        .ok_or_else(|| ParseResponseError::MissingPidPrefix(payload.to_string()))?;
-    val.parse().map_err(|_| ParseResponseError::InvalidInteger {
-        field: "pid",
-        value: val.to_string(),
-    })
+    Ok(1) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse the `SUCCESS:` payload from a `load-stats` command.
 ///
 /// Expects the format `nclients=N,bytesin=N,bytesout=N`.
 ///
 /// ```
 /// use openvpn_mgmt_codec::parsed_response::parse_load_stats;

---- client::tests::notifications_forwarded_during_command stdout ----

thread 'client::tests::notifications_forwarded_during_command' (6044) panicked at openvpn-mgmt-codec\src\client.rs:1181:9:
assertion `left == right` failed
  left: 1
 right: 99

---- client::tests::parse_error_for_malformed_pid stdout ----

thread 'client::tests::parse_error_for_malformed_pid' (13644) panicked at openvpn-mgmt-codec\src\client.rs:1258:38:
called `Result::unwrap_err()` on an `Ok` value: 1

---- client::tests::pid_returns_parsed_value stdout ----

thread 'client::tests::pid_returns_parsed_value' (24536) panicked at openvpn-mgmt-codec\src\client.rs:713:9:
assertion `left == right` failed
  left: 1
 right: 42

failures:
    client::tests::notifications_forwarded_during_command
    client::tests::parse_error_for_malformed_pid
    client::tests::pid_returns_parsed_value
    parsed_response::tests::pid_missing_prefix
    parsed_response::tests::pid_normal
    parsed_response::tests::pid_not_a_number
    parsed_response::tests::pid_zero

test result: FAILED. 354 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
