*** openvpn-mgmt-codec/src/status.rs:189:5: replace detect_separator -> char with Default::default()

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace detect_separator -> char with Default::default()
@@ -181,28 +181,17 @@
     #[error("missing statistics key: {0:?}")]
     MissingStatisticsKey(&'static str),
 }
 
 /// Detect the separator used in the status output.
 ///
 /// V3 uses tabs, V1/V2 use commas. We check the first line for a tab character.
 fn detect_separator(lines: &[String]) -> char {
-    for line in lines {
-        if line.starts_with("TITLE\t")
-            || line.starts_with("TIME\t")
-            || line.starts_with("HEADER\t")
-            || line.starts_with("CLIENT_LIST\t")
-            || line.starts_with("ROUTING_TABLE\t")
-            || line.starts_with("GLOBAL_STATS\t")
-        {
-            return '\t';
-        }
-    }
-    ','
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_u64(s: &str, field: &'static str) -> Result<u64, ParseStatusError> {
     s.parse().map_err(|_| ParseStatusError::InvalidInteger {
         field,
         value: s.to_string(),
     })
 }

---- status::tests::detect_separator_each_tab_prefix stdout ----

thread 'status::tests::detect_separator_each_tab_prefix' (14308) panicked at openvpn-mgmt-codec\src\status.rs:798:13:
assertion `left == right` failed: should detect tab for line starting with "TITLE\t"
  left: '\0'
 right: '\t'

---- status::tests::detect_separator_falls_back_to_comma stdout ----

thread 'status::tests::detect_separator_falls_back_to_comma' (26548) panicked at openvpn-mgmt-codec\src\status.rs:809:9:
assertion `left == right` failed
  left: '\0'
 right: ','

---- status::tests::v2_full_multiple_clients stdout ----

thread 'status::tests::v2_full_multiple_clients' (36312) panicked at openvpn-mgmt-codec\src\status.rs:629:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    status::tests::detect_separator_each_tab_prefix
    status::tests::detect_separator_falls_back_to_comma
    status::tests::v2_full_multiple_clients
    status::tests::v2_old_openvpn_23
    status::tests::v2_single_client
    status::tests::v2v3_client_list_old_layout_exactly_five_fields
    status::tests::v2v3_client_list_old_layout_too_few_fields
    status::tests::v2v3_global_stats_exactly_three_fields
    status::tests::v2v3_routing_table_exactly_four_fields
    status::tests::v2v3_routing_table_too_few_fields
    status::tests::v2v3_unknown_lines_ignored
    status::tests::v3_single_client

test result: FAILED. 349 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
