*** openvpn-mgmt-codec/src/status.rs:192:13: replace || with && in detect_separator

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace || with && in detect_separator
@@ -184,17 +184,17 @@
 
 /// Detect the separator used in the status output.
 ///
 /// V3 uses tabs, V1/V2 use commas. We check the first line for a tab character.
 fn detect_separator(lines: &[String]) -> char {
     for line in lines {
         if line.starts_with("TITLE\t")
             || line.starts_with("TIME\t")
-            || line.starts_with("HEADER\t")
+            && /* ~ changed by cargo-mutants ~ */ line.starts_with("HEADER\t")
             || line.starts_with("CLIENT_LIST\t")
             || line.starts_with("ROUTING_TABLE\t")
             || line.starts_with("GLOBAL_STATS\t")
         {
             return '\t';
         }
     }
     ','

---- status::tests::detect_separator_each_tab_prefix stdout ----

thread 'status::tests::detect_separator_each_tab_prefix' (25524) panicked at openvpn-mgmt-codec\src\status.rs:809:13:
assertion `left == right` failed: should detect tab for line starting with "TIME\t"
  left: ','
 right: '\t'

failures:
    status::tests::detect_separator_each_tab_prefix

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
