*** openvpn-mgmt-codec/src/status.rs:193:13: replace || with && in detect_separator

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace || with && in detect_separator
@@ -185,17 +185,17 @@
 /// Detect the separator used in the status output.
 ///
 /// V3 uses tabs, V1/V2 use commas. We check the first line for a tab character.
 fn detect_separator(lines: &[String]) -> char {
     for line in lines {
         if line.starts_with("TITLE\t")
             || line.starts_with("TIME\t")
             || line.starts_with("HEADER\t")
-            || line.starts_with("CLIENT_LIST\t")
+            && /* ~ changed by cargo-mutants ~ */ line.starts_with("CLIENT_LIST\t")
             || line.starts_with("ROUTING_TABLE\t")
             || line.starts_with("GLOBAL_STATS\t")
         {
             return '\t';
         }
     }
     ','
 }

---- status::tests::detect_separator_each_tab_prefix stdout ----

thread 'status::tests::detect_separator_each_tab_prefix' (15736) panicked at openvpn-mgmt-codec\src\status.rs:809:13:
assertion `left == right` failed: should detect tab for line starting with "HEADER\t"
  left: ','
 right: '\t'

---- status::tests::v2v3_client_list_old_layout_exactly_five_fields stdout ----

thread 'status::tests::v2v3_client_list_old_layout_exactly_five_fields' (24484) panicked at openvpn-mgmt-codec\src\status.rs:982:9:
assertion `left == right` failed
  left: 0
 right: 1

---- status::tests::v2v3_client_list_old_layout_too_few_fields stdout ----

thread 'status::tests::v2v3_client_list_old_layout_too_few_fields' (13956) panicked at openvpn-mgmt-codec\src\status.rs:969:40:
called `Result::unwrap_err()` on an `Ok` value: StatusResponse { title: None, timestamp: None, updated: None, clients: [], routes: [], global_stats: [] }

failures:
    status::tests::detect_separator_each_tab_prefix
    status::tests::v2v3_client_list_old_layout_exactly_five_fields
    status::tests::v2v3_client_list_old_layout_too_few_fields

test result: FAILED. 358 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
