*** openvpn-mgmt-codec/src/status.rs:195:13: replace || with && in detect_separator

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace || with && in detect_separator
@@ -187,17 +187,17 @@
 /// V3 uses tabs, V1/V2 use commas. We check the first line for a tab character.
 fn detect_separator(lines: &[String]) -> char {
     for line in lines {
         if line.starts_with("TITLE\t")
             || line.starts_with("TIME\t")
             || line.starts_with("HEADER\t")
             || line.starts_with("CLIENT_LIST\t")
             || line.starts_with("ROUTING_TABLE\t")
-            || line.starts_with("GLOBAL_STATS\t")
+            && /* ~ changed by cargo-mutants ~ */ line.starts_with("GLOBAL_STATS\t")
         {
             return '\t';
         }
     }
     ','
 }
 
 fn parse_u64(s: &str, field: &'static str) -> Result<u64, ParseStatusError> {

---- status::tests::detect_separator_each_tab_prefix stdout ----

thread 'status::tests::detect_separator_each_tab_prefix' (23060) panicked at openvpn-mgmt-codec\src\status.rs:809:13:
assertion `left == right` failed: should detect tab for line starting with "ROUTING_TABLE\t"
  left: ','
 right: '\t'

---- status::tests::v2v3_global_stats_exactly_three_fields stdout ----

thread 'status::tests::v2v3_global_stats_exactly_three_fields' (45376) panicked at openvpn-mgmt-codec\src\status.rs:879:9:
assertion `left == right` failed
  left: 0
 right: 1

---- status::tests::v2v3_routing_table_exactly_four_fields stdout ----

thread 'status::tests::v2v3_routing_table_exactly_four_fields' (45208) panicked at openvpn-mgmt-codec\src\status.rs:960:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    status::tests::detect_separator_each_tab_prefix
    status::tests::v2v3_global_stats_exactly_three_fields
    status::tests::v2v3_routing_table_exactly_four_fields
    status::tests::v2v3_routing_table_too_few_fields

test result: FAILED. 359 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
