*** openvpn-mgmt-codec/src/status.rs:204:5: replace parse_u64 -> Result<u64, ParseStatusError> with Ok(1)

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace parse_u64 -> Result<u64, ParseStatusError> with Ok(1)
@@ -196,20 +196,17 @@
         {
             return '\t';
         }
     }
     ','
 }
 
 fn parse_u64(s: &str, field: &'static str) -> Result<u64, ParseStatusError> {
-    s.parse().map_err(|_| ParseStatusError::InvalidInteger {
-        field,
-        value: s.to_string(),
-    })
+    Ok(1) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_optional_u64(s: &str) -> Option<u64> {
     if s.is_empty() || s == "UNDEF" {
         None
     } else {
         s.parse()
             .inspect_err(|error| {

---- status::tests::client_statistics_invalid_number stdout ----

thread 'status::tests::client_statistics_invalid_number' (32912) panicked at openvpn-mgmt-codec\src\status.rs:784:9:
assertion failed: matches!(err, ParseStatusError::InvalidInteger
    { field: "tun_tap_read_bytes", .. })

---- status::tests::client_statistics_basic stdout ----

thread 'status::tests::client_statistics_basic' (11404) panicked at openvpn-mgmt-codec\src\status.rs:739:9:
assertion `left == right` failed
  left: 1
 right: 1548576

---- status::tests::client_statistics_with_compression stdout ----

thread 'status::tests::client_statistics_with_compression' (24112) panicked at openvpn-mgmt-codec\src\status.rs:755:9:
assertion `left == right` failed
  left: 1
 right: 153789941

failures:
    status::tests::client_statistics_basic
    status::tests::client_statistics_invalid_number
    status::tests::client_statistics_with_compression
    status::tests::v1_client_list_exactly_five_fields
    status::tests::v1_server_two_clients
    status::tests::v2v3_client_list_old_layout_exactly_five_fields
    status::tests::v3_single_client

test result: FAILED. 354 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
