*** openvpn-mgmt-codec/src/status.rs:211:26: replace == with != in parse_optional_u64

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace == with != in parse_optional_u64
@@ -203,17 +203,17 @@
 fn parse_u64(s: &str, field: &'static str) -> Result<u64, ParseStatusError> {
     s.parse().map_err(|_| ParseStatusError::InvalidInteger {
         field,
         value: s.to_string(),
     })
 }
 
 fn parse_optional_u64(s: &str) -> Option<u64> {
-    if s.is_empty() || s == "UNDEF" {
+    if s.is_empty() || s != /* ~ changed by cargo-mutants ~ */ "UNDEF" {
         None
     } else {
         s.parse()
             .inspect_err(|error| {
                 tracing::warn!(%error, value = s, "non-numeric optional u64 in status response")
             })
             .ok()
     }

---- status::tests::parse_optional_u64_valid stdout ----

thread 'status::tests::parse_optional_u64_valid' (16524) panicked at openvpn-mgmt-codec\src\status.rs:837:9:
assertion `left == right` failed
  left: None
 right: Some(42)

---- status::tests::v3_single_client stdout ----

thread 'status::tests::v3_single_client' (42672) panicked at openvpn-mgmt-codec\src\status.rs:600:9:
assertion `left == right` failed
  left: None
 right: Some(1711012500)

failures:
    status::tests::parse_optional_u64_valid
    status::tests::v3_single_client

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
