*** openvpn-mgmt-codec/src/status.rs:211:5: replace parse_optional_u64 -> Option<u64> with Some(1)

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace parse_optional_u64 -> Option<u64> with Some(1)
@@ -203,25 +203,17 @@
 fn parse_u64(s: &str, field: &'static str) -> Result<u64, ParseStatusError> {
     s.parse().map_err(|_| ParseStatusError::InvalidInteger {
         field,
         value: s.to_string(),
     })
 }
 
 fn parse_optional_u64(s: &str) -> Option<u64> {
-    if s.is_empty() || s == "UNDEF" {
-        None
-    } else {
-        s.parse()
-            .inspect_err(|error| {
-                tracing::warn!(%error, value = s, "non-numeric optional u64 in status response")
-            })
-            .ok()
-    }
+    Some(1) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse a server-mode status response into typed structs.
 ///
 /// Accepts V1 (comma-separated), V2 (comma with prefix lines), and V3
 /// (tab-delimited) formats. The format is auto-detected.
 ///
 /// V1 format starts with `"OpenVPN CLIENT LIST"` and has a fixed column

---- status::tests::parse_optional_u64_empty stdout ----

thread 'status::tests::parse_optional_u64_empty' (23304) panicked at openvpn-mgmt-codec\src\status.rs:819:9:
assertion `left == right` failed
  left: Some(1)
 right: None

---- status::tests::parse_optional_u64_undef stdout ----

thread 'status::tests::parse_optional_u64_undef' (32248) panicked at openvpn-mgmt-codec\src\status.rs:824:9:
assertion `left == right` failed
  left: Some(1)
 right: None

---- status::tests::parse_optional_u64_valid stdout ----

thread 'status::tests::parse_optional_u64_valid' (27088) panicked at openvpn-mgmt-codec\src\status.rs:829:9:
assertion `left == right` failed
  left: Some(1)
 right: Some(42)

failures:
    status::tests::parse_optional_u64_empty
    status::tests::parse_optional_u64_undef
    status::tests::parse_optional_u64_valid
    status::tests::v3_single_client

test result: FAILED. 359 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
