*** openvpn-mgmt-codec/src/status.rs:257:34: replace == with != in parse_status

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace == with != in parse_status
@@ -249,17 +249,17 @@
 /// assert_eq!(status.clients[0].common_name, "peer1");
 /// assert_eq!(status.clients[0].bytes_in, 1548576);
 /// assert_eq!(status.routes[0].virtual_address, "10.8.0.6");
 /// ```
 pub fn parse_status(lines: &[String]) -> Result<StatusResponse, ParseStatusError> {
     // Detect V1 by looking for the header line.
     if lines
         .first()
-        .is_some_and(|line| line == "OpenVPN CLIENT LIST")
+        .is_some_and(|line| line != /* ~ changed by cargo-mutants ~ */ "OpenVPN CLIENT LIST")
     {
         return parse_status_v1(lines);
     }
 
     let sep = detect_separator(lines);
     parse_status_v2v3(lines, sep)
 }

---- status::tests::v1_client_list_exactly_five_fields stdout ----

thread 'status::tests::v1_client_list_exactly_five_fields' (45144) panicked at openvpn-mgmt-codec\src\status.rs:919:9:
assertion `left == right` failed
  left: 0
 right: 1

---- status::tests::v1_client_list_too_few_fields stdout ----

thread 'status::tests::v1_client_list_too_few_fields' (42608) panicked at openvpn-mgmt-codec\src\status.rs:902:40:
called `Result::unwrap_err()` on an `Ok` value: StatusResponse { title: None, timestamp: None, updated: None, clients: [], routes: [], global_stats: [] }

---- status::tests::v1_routing_table_exactly_four_fields stdout ----

thread 'status::tests::v1_routing_table_exactly_four_fields' (4132) panicked at openvpn-mgmt-codec\src\status.rs:937:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    status::tests::v1_client_list_exactly_five_fields
    status::tests::v1_client_list_too_few_fields
    status::tests::v1_routing_table_exactly_four_fields
    status::tests::v1_routing_table_too_few_fields
    status::tests::v1_server_empty
    status::tests::v1_server_many_clients
    status::tests::v1_server_two_clients
    status::tests::v2_full_multiple_clients
    status::tests::v2_old_openvpn_23
    status::tests::v2_single_client
    status::tests::v2v3_client_list_old_layout_exactly_five_fields
    status::tests::v2v3_client_list_old_layout_too_few_fields

test result: FAILED. 344 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
