*** openvpn-mgmt-codec/src/status.rs:288:17: replace == with != in parse_status_v1

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace == with != in parse_status_v1
@@ -280,17 +280,17 @@
         ClientList,
         RoutingTable,
         GlobalStats,
     }
     let mut section = Section::Header;
 
     for line in lines {
         // Section transitions
-        if line == "OpenVPN CLIENT LIST" {
+        if line != /* ~ changed by cargo-mutants ~ */ "OpenVPN CLIENT LIST" {
             section = Section::Header;
             continue;
         }
         if line.starts_with("Updated,") {
             status.updated = Some(line.strip_prefix("Updated,").unwrap_or("").to_string());
             continue;
         }
         if line == "ROUTING TABLE" {

---- status::tests::v1_client_list_exactly_five_fields stdout ----

thread 'status::tests::v1_client_list_exactly_five_fields' (34968) panicked at openvpn-mgmt-codec\src\status.rs:919:9:
assertion `left == right` failed
  left: 0
 right: 1

---- status::tests::v1_client_list_too_few_fields stdout ----

thread 'status::tests::v1_client_list_too_few_fields' (30016) panicked at openvpn-mgmt-codec\src\status.rs:902:40:
called `Result::unwrap_err()` on an `Ok` value: StatusResponse { title: None, timestamp: None, updated: None, clients: [], routes: [], global_stats: [] }

---- status::tests::v1_server_empty stdout ----

thread 'status::tests::v1_server_empty' (41716) panicked at openvpn-mgmt-codec\src\status.rs:716:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    status::tests::v1_client_list_exactly_five_fields
    status::tests::v1_client_list_too_few_fields
    status::tests::v1_routing_table_exactly_four_fields
    status::tests::v1_routing_table_too_few_fields
    status::tests::v1_server_empty
    status::tests::v1_server_many_clients
    status::tests::v1_server_two_clients

test result: FAILED. 356 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
