*** openvpn-mgmt-codec/src/status.rs:296:17: replace == with != in parse_status_v1

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace == with != in parse_status_v1
@@ -288,17 +288,17 @@
         if line == "OpenVPN CLIENT LIST" {
             section = Section::Header;
             continue;
         }
         if line.starts_with("Updated,") {
             status.updated = Some(line.strip_prefix("Updated,").unwrap_or("").to_string());
             continue;
         }
-        if line == "ROUTING TABLE" {
+        if line != /* ~ changed by cargo-mutants ~ */ "ROUTING TABLE" {
             section = Section::RoutingTable;
             continue;
         }
         if line == "GLOBAL STATS" {
             section = Section::GlobalStats;
             continue;
         }

---- status::tests::v1_client_list_exactly_five_fields stdout ----

thread 'status::tests::v1_client_list_exactly_five_fields' (21748) panicked at openvpn-mgmt-codec\src\status.rs:919:9:
assertion `left == right` failed
  left: 0
 right: 1

---- status::tests::v1_client_list_too_few_fields stdout ----

thread 'status::tests::v1_client_list_too_few_fields' (44316) panicked at openvpn-mgmt-codec\src\status.rs:902:40:
called `Result::unwrap_err()` on an `Ok` value: StatusResponse { title: None, timestamp: None, updated: Some("2024-03-21 14:30:00"), clients: [], routes: [], global_stats: [] }

---- status::tests::v1_routing_table_exactly_four_fields stdout ----

thread 'status::tests::v1_routing_table_exactly_four_fields' (47280) panicked at openvpn-mgmt-codec\src\status.rs:936:43:
called `Result::unwrap()` on an `Err` value: RoutingTableTooFewFields(1)

failures:
    status::tests::v1_client_list_exactly_five_fields
    status::tests::v1_client_list_too_few_fields
    status::tests::v1_routing_table_exactly_four_fields
    status::tests::v1_routing_table_too_few_fields
    status::tests::v1_server_empty
    status::tests::v1_server_many_clients
    status::tests::v1_server_two_clients

test result: FAILED. 354 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
