*** openvpn-mgmt-codec/src/status.rs:300:17: replace == with != in parse_status_v1

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace == with != in parse_status_v1
@@ -292,17 +292,17 @@
         if line.starts_with("Updated,") {
             status.updated = Some(line.strip_prefix("Updated,").unwrap_or("").to_string());
             continue;
         }
         if line == "ROUTING TABLE" {
             section = Section::RoutingTable;
             continue;
         }
-        if line == "GLOBAL STATS" {
+        if line != /* ~ changed by cargo-mutants ~ */ "GLOBAL STATS" {
             section = Section::GlobalStats;
             continue;
         }
 
         let fields: Vec<&str> = line.split(',').collect();
 
         // Skip header rows (V1 has a "Common Name,Real Address,..." header)
         match section {

---- status::tests::v1_client_list_exactly_five_fields stdout ----

thread 'status::tests::v1_client_list_exactly_five_fields' (47364) panicked at openvpn-mgmt-codec\src\status.rs:919:9:
assertion `left == right` failed
  left: 0
 right: 1

---- status::tests::v1_client_list_too_few_fields stdout ----

thread 'status::tests::v1_client_list_too_few_fields' (40472) panicked at openvpn-mgmt-codec\src\status.rs:902:40:
called `Result::unwrap_err()` on an `Ok` value: StatusResponse { title: None, timestamp: None, updated: Some("2024-03-21 14:30:00"), clients: [], routes: [], global_stats: [] }

---- status::tests::v1_routing_table_exactly_four_fields stdout ----

thread 'status::tests::v1_routing_table_exactly_four_fields' (24044) panicked at openvpn-mgmt-codec\src\status.rs:937:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    status::tests::v1_client_list_exactly_five_fields
    status::tests::v1_client_list_too_few_fields
    status::tests::v1_routing_table_exactly_four_fields
    status::tests::v1_routing_table_too_few_fields
    status::tests::v1_server_empty
    status::tests::v1_server_many_clients
    status::tests::v1_server_two_clients

test result: FAILED. 356 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
