*** openvpn-mgmt-codec/src/status.rs:310:35: replace == with != in parse_status_v1

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace == with != in parse_status_v1
@@ -302,17 +302,17 @@
             continue;
         }
 
         let fields: Vec<&str> = line.split(',').collect();
 
         // Skip header rows (V1 has a "Common Name,Real Address,..." header)
         match section {
             Section::Header => {
-                if fields.first() == Some(&"Common Name") {
+                if fields.first() != /* ~ changed by cargo-mutants ~ */ Some(&"Common Name") {
                     section = Section::ClientList;
                     continue;
                 }
             }
             Section::ClientList => {
                 // V1 CLIENT_LIST: CN, Real Address, Bytes Received, Bytes Sent, Connected Since
                 if fields.len() < 5 {
                     return Err(ParseStatusError::ClientListTooFewFields(fields.len()));

---- status::tests::v1_client_list_exactly_five_fields stdout ----

thread 'status::tests::v1_client_list_exactly_five_fields' (40740) panicked at openvpn-mgmt-codec\src\status.rs:919:9:
assertion `left == right` failed
  left: 0
 right: 1

---- status::tests::v1_client_list_too_few_fields stdout ----

thread 'status::tests::v1_client_list_too_few_fields' (41020) panicked at openvpn-mgmt-codec\src\status.rs:902:40:
called `Result::unwrap_err()` on an `Ok` value: StatusResponse { title: None, timestamp: None, updated: Some("2024-03-21 14:30:00"), clients: [], routes: [], global_stats: [] }

---- status::tests::v1_server_two_clients stdout ----

thread 'status::tests::v1_server_two_clients' (12752) panicked at openvpn-mgmt-codec\src\status.rs:694:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    status::tests::v1_client_list_exactly_five_fields
    status::tests::v1_client_list_too_few_fields
    status::tests::v1_server_many_clients
    status::tests::v1_server_two_clients

test result: FAILED. 357 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
