*** openvpn-mgmt-codec/src/status.rs:317:33: replace < with <= in parse_status_v1

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace < with <= in parse_status_v1
@@ -309,17 +309,17 @@
             Section::Header => {
                 if fields.first() == Some(&"Common Name") {
                     section = Section::ClientList;
                     continue;
                 }
             }
             Section::ClientList => {
                 // V1 CLIENT_LIST: CN, Real Address, Bytes Received, Bytes Sent, Connected Since
-                if fields.len() < 5 {
+                if fields.len() <= /* ~ changed by cargo-mutants ~ */ 5 {
                     return Err(ParseStatusError::ClientListTooFewFields(fields.len()));
                 }
                 status.clients.push(ConnectedClient {
                     common_name: fields[0].to_string(),
                     real_address: fields[1].to_string(),
                     virtual_address: String::new(), // Not present in V1
                     virtual_ipv6: String::new(),
                     bytes_in: parse_u64(fields[2], "bytes_received")?,

---- status::tests::v1_client_list_exactly_five_fields stdout ----

thread 'status::tests::v1_client_list_exactly_five_fields' (32624) panicked at openvpn-mgmt-codec\src\status.rs:918:43:
called `Result::unwrap()` on an `Err` value: ClientListTooFewFields(5)

---- status::tests::v1_routing_table_too_few_fields stdout ----

thread 'status::tests::v1_routing_table_too_few_fields' (29316) panicked at openvpn-mgmt-codec\src\status.rs:855:9:
expected RoutingTableTooFewFields(2), got ClientListTooFewFields(5)

---- status::tests::v1_server_many_clients stdout ----

thread 'status::tests::v1_server_many_clients' (9052) panicked at openvpn-mgmt-codec\src\status.rs:727:43:
called `Result::unwrap()` on an `Err` value: ClientListTooFewFields(5)

failures:
    status::tests::v1_client_list_exactly_five_fields
    status::tests::v1_routing_table_too_few_fields
    status::tests::v1_server_many_clients
    status::tests::v1_server_two_clients

test result: FAILED. 359 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
