*** openvpn-mgmt-codec/src/status.rs:337:35: replace == with != in parse_status_v1

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace == with != in parse_status_v1
@@ -329,17 +329,17 @@
                     username: None,
                     cid: None,
                     peer_id: None,
                     cipher: None,
                 });
             }
             Section::RoutingTable => {
                 // Skip header row
-                if fields.first() == Some(&"Virtual Address") {
+                if fields.first() != /* ~ changed by cargo-mutants ~ */ Some(&"Virtual Address") {
                     continue;
                 }
                 if fields.len() < 4 {
                     return Err(ParseStatusError::RoutingTableTooFewFields(fields.len()));
                 }
                 status.routes.push(RoutingEntry {
                     virtual_address: fields[0].to_string(),
                     common_name: fields[1].to_string(),

---- status::tests::v1_server_two_clients stdout ----

thread 'status::tests::v1_server_two_clients' (42872) panicked at openvpn-mgmt-codec\src\status.rs:702:9:
assertion `left == right` failed
  left: 1
 right: 2

---- status::tests::v1_routing_table_too_few_fields stdout ----

thread 'status::tests::v1_routing_table_too_few_fields' (39052) panicked at openvpn-mgmt-codec\src\status.rs:854:40:

---- status::tests::v1_server_empty stdout ----

thread 'status::tests::v1_server_empty' (21364) panicked at openvpn-mgmt-codec\src\status.rs:715:9:
assertion failed: status.routes.is_empty()

failures:
    status::tests::v1_routing_table_exactly_four_fields
    status::tests::v1_routing_table_too_few_fields
    status::tests::v1_server_empty
    status::tests::v1_server_many_clients
    status::tests::v1_server_two_clients

test result: FAILED. 356 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
