*** openvpn-mgmt-codec/src/status.rs:340:33: replace < with == in parse_status_v1

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace < with == in parse_status_v1
@@ -332,17 +332,17 @@
                     cipher: None,
                 });
             }
             Section::RoutingTable => {
                 // Skip header row
                 if fields.first() == Some(&"Virtual Address") {
                     continue;
                 }
-                if fields.len() < 4 {
+                if fields.len() == /* ~ changed by cargo-mutants ~ */ 4 {
                     return Err(ParseStatusError::RoutingTableTooFewFields(fields.len()));
                 }
                 status.routes.push(RoutingEntry {
                     virtual_address: fields[0].to_string(),
                     common_name: fields[1].to_string(),
                     real_address: fields[2].to_string(),
                     last_ref: fields[3..].join(","),
                     last_ref_t: None,

---- status::tests::v1_routing_table_exactly_four_fields stdout ----

thread 'status::tests::v1_routing_table_exactly_four_fields' (39224) panicked at openvpn-mgmt-codec\src\status.rs:936:43:
called `Result::unwrap()` on an `Err` value: RoutingTableTooFewFields(4)

---- status::tests::v1_server_many_clients stdout ----

thread 'status::tests::v1_server_many_clients' (41148) panicked at openvpn-mgmt-codec\src\status.rs:727:43:
called `Result::unwrap()` on an `Err` value: RoutingTableTooFewFields(4)

---- status::tests::v1_server_two_clients stdout ----

thread 'status::tests::v1_server_two_clients' (46868) panicked at openvpn-mgmt-codec\src\status.rs:690:43:
called `Result::unwrap()` on an `Err` value: RoutingTableTooFewFields(4)

failures:
    status::tests::v1_routing_table_exactly_four_fields
    status::tests::v1_routing_table_too_few_fields
    status::tests::v1_server_many_clients
    status::tests::v1_server_two_clients

test result: FAILED. 359 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
