*** openvpn-mgmt-codec/src/status.rs:352:33: replace >= with < in parse_status_v1

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace >= with < in parse_status_v1
@@ -344,17 +344,17 @@
                     virtual_address: fields[0].to_string(),
                     common_name: fields[1].to_string(),
                     real_address: fields[2].to_string(),
                     last_ref: fields[3..].join(","),
                     last_ref_t: None,
                 });
             }
             Section::GlobalStats => {
-                if fields.len() >= 2 {
+                if fields.len() < /* ~ changed by cargo-mutants ~ */ 2 {
                     status
                         .global_stats
                         .push((fields[0].to_string(), fields[1..].join(",")));
                 }
             }
         }
     }

---- status::tests::v1_server_empty stdout ----

thread 'status::tests::v1_server_empty' (24864) panicked at openvpn-mgmt-codec\src\status.rs:716:9:
assertion `left == right` failed
  left: 0
 right: 1

---- status::tests::v1_server_two_clients stdout ----

thread 'status::tests::v1_server_two_clients' (36596) panicked at openvpn-mgmt-codec\src\status.rs:703:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    status::tests::v1_server_empty
    status::tests::v1_server_two_clients

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
