*** openvpn-mgmt-codec/src/status.rs:380:13: delete match arm "TITLE" in parse_status_v2v3

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ delete match arm "TITLE" in parse_status_v2v3
@@ -372,19 +372,17 @@
         global_stats: Vec::new(),
     };
 
     for line in lines {
         let fields: Vec<&str> = line.split(sep).collect();
         let tag = fields.first().copied().unwrap_or("");
 
         match tag {
-            "TITLE" => {
-                status.title = fields.get(1).map(|val| val.to_string());
-            }
+             /* ~ changed by cargo-mutants ~ */
             "TIME" => {
                 status.updated = fields.get(1).map(|val| val.to_string());
                 status.timestamp = fields.get(2).and_then(|val| {
                     val.parse()
                         .inspect_err(|error| {
                             tracing::warn!(%error, value = val, "non-numeric timestamp in TIME row")
                         })
                         .ok()

---- status::tests::v2_old_openvpn_23 stdout ----

thread 'status::tests::v2_old_openvpn_23' (46552) panicked at openvpn-mgmt-codec\src\status.rs:665:9:
assertion `left == right` failed
  left: None
 right: Some("OpenVPN 2.3.2 x86_64-pc-linux-gnu [SSL (OpenSSL)] [LZO] [EPOLL] [PKCS11] [eurephia] [MH] [IPv6] built on Dec  2 2014")

---- status::tests::v2v3_unknown_lines_ignored stdout ----

thread 'status::tests::v2v3_unknown_lines_ignored' (32568) panicked at openvpn-mgmt-codec\src\status.rs:994:9:
assertion `left == right` failed
  left: None
 right: Some("Test")

---- status::tests::v3_single_client stdout ----

thread 'status::tests::v3_single_client' (37072) panicked at openvpn-mgmt-codec\src\status.rs:584:9:
assertion `left == right` failed
  left: None
 right: Some("OpenVPN 2.6.8 x86_64-pc-linux-gnu")

failures:
    status::tests::v2_old_openvpn_23
    status::tests::v2v3_unknown_lines_ignored
    status::tests::v3_single_client

test result: FAILED. 360 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
