*** openvpn-mgmt-codec/src/status.rs:396:13: delete match arm "CLIENT_LIST" in parse_status_v2v3

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ delete match arm "CLIENT_LIST" in parse_status_v2v3
@@ -388,65 +388,17 @@
                             tracing::warn!(%error, value = val, "non-numeric timestamp in TIME row")
                         })
                         .ok()
                 });
             }
             "HEADER" => {
                 // Skip header rows — they describe columns, not data.
             }
-            "CLIENT_LIST" => {
-                // V2/V3 CLIENT_LIST columns (after the tag):
-                // 0:CN 1:RealAddr 2:VirtAddr 3:VirtIPv6 4:BytesRecv 5:BytesSent
-                // 6:ConnSince 7:ConnSince_t 8:Username 9:CID 10:PeerID 11:Cipher
-                //
-                // Older (2.3) layout omits VirtIPv6, PeerID, Cipher:
-                // 0:CN 1:RealAddr 2:VirtAddr 3:BytesRecv 4:BytesSent
-                // 5:ConnSince 6:ConnSince_t 7:Username
-                let cols = &fields[1..]; // Skip the "CLIENT_LIST" tag
-                let has_ipv6_column = cols.len() >= 12;
-
-                if has_ipv6_column {
-                    // has_ipv6_column requires cols.len() >= 12, so all
-                    // indexed accesses (up to cols[7]) are in-bounds.
-                    status.clients.push(ConnectedClient {
-                        common_name: cols[0].to_string(),
-                        real_address: cols[1].to_string(),
-                        virtual_address: cols[2].to_string(),
-                        virtual_ipv6: cols[3].to_string(),
-                        bytes_in: parse_u64(cols[4], "bytes_received")?,
-                        bytes_out: parse_u64(cols[5], "bytes_sent")?,
-                        connected_since: cols[6].to_string(),
-                        connected_since_t: parse_optional_u64(cols.get(7).copied().unwrap_or("")),
-                        username: cols.get(8).map(|val| val.to_string()),
-                        cid: cols.get(9).and_then(|val| parse_optional_u64(val)),
-                        peer_id: cols.get(10).and_then(|val| parse_optional_u64(val)),
-                        cipher: cols.get(11).map(|val| val.to_string()),
-                    });
-                } else {
-                    // Older layout: no IPv6, no PeerID, no Cipher
-                    if cols.len() < 5 {
-                        return Err(ParseStatusError::ClientListTooFewFields(cols.len()));
-                    }
-                    status.clients.push(ConnectedClient {
-                        common_name: cols[0].to_string(),
-                        real_address: cols[1].to_string(),
-                        virtual_address: cols[2].to_string(),
-                        virtual_ipv6: String::new(),
-                        bytes_in: parse_u64(cols[3], "bytes_received")?,
-                        bytes_out: parse_u64(cols[4], "bytes_sent")?,
-                        connected_since: cols.get(5).unwrap_or(&"").to_string(),
-                        connected_since_t: cols.get(6).and_then(|val| parse_optional_u64(val)),
-                        username: cols.get(7).map(|val| val.to_string()),
-                        cid: None,
-                        peer_id: None,
-                        cipher: None,
-                    });
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             "ROUTING_TABLE" => {
                 let cols = &fields[1..];
                 if cols.len() < 4 {
                     return Err(ParseStatusError::RoutingTableTooFewFields(cols.len()));
                 }
                 status.routes.push(RoutingEntry {
                     virtual_address: cols[0].to_string(),
                     common_name: cols[1].to_string(),

---- status::tests::v2_single_client stdout ----

thread 'status::tests::v2_single_client' (31720) panicked at openvpn-mgmt-codec\src\status.rs:578:9:
assertion `left == right` failed
  left: 0
 right: 1

---- status::tests::v2v3_client_list_old_layout_exactly_five_fields stdout ----

thread 'status::tests::v2v3_client_list_old_layout_exactly_five_fields' (2676) panicked at openvpn-mgmt-codec\src\status.rs:934:9:
assertion `left == right` failed
  left: 0
 right: 1

---- status::tests::v2_full_multiple_clients stdout ----

thread 'status::tests::v2_full_multiple_clients' (31860) panicked at openvpn-mgmt-codec\src\status.rs:592:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    status::tests::v2_full_multiple_clients
    status::tests::v2_old_openvpn_23
    status::tests::v2_single_client
    status::tests::v2v3_client_list_old_layout_exactly_five_fields
    status::tests::v2v3_client_list_old_layout_too_few_fields
    status::tests::v3_single_client

test result: FAILED. 355 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
