*** openvpn-mgmt-codec/src/status.rs:405:50: replace >= with < in parse_status_v2v3

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace >= with < in parse_status_v2v3
@@ -397,17 +397,17 @@
                 // V2/V3 CLIENT_LIST columns (after the tag):
                 // 0:CN 1:RealAddr 2:VirtAddr 3:VirtIPv6 4:BytesRecv 5:BytesSent
                 // 6:ConnSince 7:ConnSince_t 8:Username 9:CID 10:PeerID 11:Cipher
                 //
                 // Older (2.3) layout omits VirtIPv6, PeerID, Cipher:
                 // 0:CN 1:RealAddr 2:VirtAddr 3:BytesRecv 4:BytesSent
                 // 5:ConnSince 6:ConnSince_t 7:Username
                 let cols = &fields[1..]; // Skip the "CLIENT_LIST" tag
-                let has_ipv6_column = cols.len() >= 12;
+                let has_ipv6_column = cols.len() < /* ~ changed by cargo-mutants ~ */ 12;
 
                 if has_ipv6_column {
                     // has_ipv6_column requires cols.len() >= 12, so all
                     // indexed accesses (up to cols[7]) are in-bounds.
                     status.clients.push(ConnectedClient {
                         common_name: cols[0].to_string(),
                         real_address: cols[1].to_string(),
                         virtual_address: cols[2].to_string(),

---- status::tests::v2_full_multiple_clients stdout ----

thread 'status::tests::v2_full_multiple_clients' (4164) panicked at openvpn-mgmt-codec\src\status.rs:639:43:
called `Result::unwrap()` on an `Err` value: InvalidInteger { field: "bytes_received", value: "2002:232:324:12::8" }

---- status::tests::v2_old_openvpn_23 stdout ----

thread 'status::tests::v2_old_openvpn_23' (4304) panicked at openvpn-mgmt-codec\src\status.rs:666:43:
called `Result::unwrap()` on an `Err` value: InvalidInteger { field: "bytes_sent", value: "Thu Mar 16 17:09:03 2017" }

---- status::tests::v2_single_client stdout ----

thread 'status::tests::v2_single_client' (39804) panicked at openvpn-mgmt-codec\src\status.rs:625:43:
called `Result::unwrap()` on an `Err` value: InvalidInteger { field: "bytes_received", value: "" }

failures:
    status::tests::v2_full_multiple_clients
    status::tests::v2_old_openvpn_23
    status::tests::v2_single_client
    status::tests::v2v3_client_list_old_layout_exactly_five_fields
    status::tests::v2v3_client_list_old_layout_too_few_fields
    status::tests::v3_single_client

test result: FAILED. 355 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
