*** openvpn-mgmt-codec/src/status.rs:445:13: delete match arm "ROUTING_TABLE" in parse_status_v2v3

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ delete match arm "ROUTING_TABLE" in parse_status_v2v3
@@ -437,29 +437,17 @@
                         connected_since_t: cols.get(6).and_then(|val| parse_optional_u64(val)),
                         username: cols.get(7).map(|val| val.to_string()),
                         cid: None,
                         peer_id: None,
                         cipher: None,
                     });
                 }
             }
-            "ROUTING_TABLE" => {
-                let cols = &fields[1..];
-                if cols.len() < 4 {
-                    return Err(ParseStatusError::RoutingTableTooFewFields(cols.len()));
-                }
-                status.routes.push(RoutingEntry {
-                    virtual_address: cols[0].to_string(),
-                    common_name: cols[1].to_string(),
-                    real_address: cols[2].to_string(),
-                    last_ref: cols[3].to_string(),
-                    last_ref_t: cols.get(4).and_then(|val| parse_optional_u64(val)),
-                });
-            }
+             /* ~ changed by cargo-mutants ~ */
             "GLOBAL_STATS" if fields.len() >= 3 => {
                 status
                     .global_stats
                     .push((fields[1].to_string(), fields[2..].join(&sep.to_string())));
             }
             _ => {
                 // Unknown line — skip silently for forward compatibility.
             }

---- status::tests::v2_full_multiple_clients stdout ----

thread 'status::tests::v2_full_multiple_clients' (39168) panicked at openvpn-mgmt-codec\src\status.rs:638:9:
assertion `left == right` failed
  left: 0
 right: 3

---- status::tests::v2_single_client stdout ----

thread 'status::tests::v2_single_client' (46008) panicked at openvpn-mgmt-codec\src\status.rs:617:9:
assertion `left == right` failed
  left: 0
 right: 1

---- status::tests::v2v3_routing_table_too_few_fields stdout ----

thread 'status::tests::v2v3_routing_table_too_few_fields' (31648) panicked at openvpn-mgmt-codec\src\status.rs:934:40:
called `Result::unwrap_err()` on an `Ok` value: StatusResponse { title: None, timestamp: None, updated: None, clients: [], routes: [], global_stats: [] }

failures:
    status::tests::v2_full_multiple_clients
    status::tests::v2_single_client
    status::tests::v2v3_routing_table_exactly_four_fields
    status::tests::v2v3_routing_table_too_few_fields
    status::tests::v3_single_client

test result: FAILED. 356 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
