*** openvpn-mgmt-codec/src/status.rs:447:31: replace < with > in parse_status_v2v3

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace < with > in parse_status_v2v3
@@ -439,17 +439,17 @@
                         cid: None,
                         peer_id: None,
                         cipher: None,
                     });
                 }
             }
             "ROUTING_TABLE" => {
                 let cols = &fields[1..];
-                if cols.len() < 4 {
+                if cols.len() > /* ~ changed by cargo-mutants ~ */ 4 {
                     return Err(ParseStatusError::RoutingTableTooFewFields(cols.len()));
                 }
                 status.routes.push(RoutingEntry {
                     virtual_address: cols[0].to_string(),
                     common_name: cols[1].to_string(),
                     real_address: cols[2].to_string(),
                     last_ref: cols[3].to_string(),
                     last_ref_t: cols.get(4).and_then(|val| parse_optional_u64(val)),

---- status::tests::v3_single_client stdout ----

thread 'status::tests::v3_single_client' (18196) panicked at openvpn-mgmt-codec\src\status.rs:585:43:
called `Result::unwrap()` on an `Err` value: RoutingTableTooFewFields(5)

---- status::tests::v2_single_client stdout ----

thread 'status::tests::v2_single_client' (19020) panicked at openvpn-mgmt-codec\src\status.rs:625:43:
called `Result::unwrap()` on an `Err` value: RoutingTableTooFewFields(5)

---- status::tests::v2v3_routing_table_too_few_fields stdout ----

thread 'status::tests::v2v3_routing_table_too_few_fields' (31280) panicked at openvpn-mgmt-codec\src\status.rs:453:35:
index out of bounds: the len is 2 but the index is 2

failures:
    status::tests::v2_full_multiple_clients
    status::tests::v2_old_openvpn_23
    status::tests::v2_single_client
    status::tests::v2v3_routing_table_too_few_fields
    status::tests::v3_single_client

test result: FAILED. 356 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
