*** openvpn-mgmt-codec/src/status.rs:458:44: replace >= with < in parse_status_v2v3

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace >= with < in parse_status_v2v3
@@ -450,17 +450,17 @@
                 status.routes.push(RoutingEntry {
                     virtual_address: cols[0].to_string(),
                     common_name: cols[1].to_string(),
                     real_address: cols[2].to_string(),
                     last_ref: cols[3].to_string(),
                     last_ref_t: cols.get(4).and_then(|val| parse_optional_u64(val)),
                 });
             }
-            "GLOBAL_STATS" if fields.len() >= 3 => {
+            "GLOBAL_STATS" if fields.len() < /* ~ changed by cargo-mutants ~ */ 3 => {
                 status
                     .global_stats
                     .push((fields[1].to_string(), fields[2..].join(&sep.to_string())));
             }
             _ => {
                 // Unknown line — skip silently for forward compatibility.
             }
         }

---- status::tests::v2_full_multiple_clients stdout ----

thread 'status::tests::v2_full_multiple_clients' (30612) panicked at openvpn-mgmt-codec\src\status.rs:656:9:
assertion `left == right` failed
  left: 0
 right: 2

---- status::tests::v2v3_global_stats_exactly_three_fields stdout ----

thread 'status::tests::v2v3_global_stats_exactly_three_fields' (46516) panicked at openvpn-mgmt-codec\src\status.rs:879:9:
assertion `left == right` failed
  left: 0
 right: 1

---- status::tests::v2v3_global_stats_with_only_key_is_ignored stdout ----

thread 'status::tests::v2v3_global_stats_with_only_key_is_ignored' (31888) panicked at openvpn-mgmt-codec\src\status.rs:868:9:
GLOBAL_STATS with <3 fields should be ignored

failures:
    status::tests::v2_full_multiple_clients
    status::tests::v2v3_global_stats_exactly_three_fields
    status::tests::v2v3_global_stats_with_only_key_is_ignored
    status::tests::v2v3_unknown_lines_ignored
    status::tests::v3_single_client

test result: FAILED. 358 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
