*** openvpn-mgmt-codec/src/status.rs:506:17: replace == with != in parse_client_statistics

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ replace == with != in parse_client_statistics
@@ -498,17 +498,17 @@
     let mut stats = ClientStatistics::default();
     let mut found_tun_read = false;
     let mut found_tun_write = false;
     let mut found_tcp_read = false;
     let mut found_tcp_write = false;
     let mut found_auth_read = false;
 
     for line in lines {
-        if line == "OpenVPN STATISTICS" || line.starts_with("Updated,") {
+        if line != /* ~ changed by cargo-mutants ~ */ "OpenVPN STATISTICS" || line.starts_with("Updated,") {
             continue;
         }
         let Some((key, val)) = line.split_once(',') else {
             continue;
         };
         match key {
             "TUN/TAP read bytes" => {
                 stats.tun_tap_read_bytes = parse_u64(val, "tun_tap_read_bytes")?;

---- status::tests::client_statistics_invalid_number stdout ----

thread 'status::tests::client_statistics_invalid_number' (22952) panicked at openvpn-mgmt-codec\src\status.rs:787:9:
assertion failed: matches!(err, ParseStatusError::InvalidInteger
    { field: "tun_tap_read_bytes", .. })

---- status::tests::client_statistics_basic stdout ----

thread 'status::tests::client_statistics_basic' (31016) panicked at openvpn-mgmt-codec\src\status.rs:741:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("TUN/TAP read bytes")

---- status::tests::client_statistics_missing_key stdout ----

thread 'status::tests::client_statistics_missing_key' (21652) panicked at openvpn-mgmt-codec\src\status.rs:773:9:
assertion failed: matches!(err, ParseStatusError::MissingStatisticsKey("TUN/TAP write bytes"))

failures:
    status::tests::client_statistics_basic
    status::tests::client_statistics_invalid_number
    status::tests::client_statistics_missing_key
    status::tests::client_statistics_with_compression

test result: FAILED. 357 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
