*** openvpn-mgmt-codec/src/status.rs:513:13: delete match arm "TUN/TAP read bytes" in parse_client_statistics

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ delete match arm "TUN/TAP read bytes" in parse_client_statistics
@@ -505,20 +505,17 @@
     for line in lines {
         if line == "OpenVPN STATISTICS" || line.starts_with("Updated,") {
             continue;
         }
         let Some((key, val)) = line.split_once(',') else {
             continue;
         };
         match key {
-            "TUN/TAP read bytes" => {
-                stats.tun_tap_read_bytes = parse_u64(val, "tun_tap_read_bytes")?;
-                found_tun_read = true;
-            }
+             /* ~ changed by cargo-mutants ~ */
             "TUN/TAP write bytes" => {
                 stats.tun_tap_write_bytes = parse_u64(val, "tun_tap_write_bytes")?;
                 found_tun_write = true;
             }
             "TCP/UDP read bytes" => {
                 stats.tcp_udp_read_bytes = parse_u64(val, "tcp_udp_read_bytes")?;
                 found_tcp_read = true;
             }

---- status::tests::client_statistics_basic stdout ----

thread 'status::tests::client_statistics_basic' (5608) panicked at openvpn-mgmt-codec\src\status.rs:738:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("TUN/TAP read bytes")

---- status::tests::client_statistics_invalid_number stdout ----

thread 'status::tests::client_statistics_invalid_number' (44168) panicked at openvpn-mgmt-codec\src\status.rs:784:9:
assertion failed: matches!(err, ParseStatusError::InvalidInteger
    { field: "tun_tap_read_bytes", .. })

---- status::tests::client_statistics_missing_key stdout ----

thread 'status::tests::client_statistics_missing_key' (44808) panicked at openvpn-mgmt-codec\src\status.rs:770:9:
assertion failed: matches!(err, ParseStatusError::MissingStatisticsKey("TUN/TAP write bytes"))

failures:
    status::tests::client_statistics_basic
    status::tests::client_statistics_invalid_number
    status::tests::client_statistics_missing_key
    status::tests::client_statistics_with_compression

test result: FAILED. 359 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
