*** openvpn-mgmt-codec/src/status.rs:517:13: delete match arm "TUN/TAP write bytes" in parse_client_statistics

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ delete match arm "TUN/TAP write bytes" in parse_client_statistics
@@ -509,20 +509,17 @@
         let Some((key, val)) = line.split_once(',') else {
             continue;
         };
         match key {
             "TUN/TAP read bytes" => {
                 stats.tun_tap_read_bytes = parse_u64(val, "tun_tap_read_bytes")?;
                 found_tun_read = true;
             }
-            "TUN/TAP write bytes" => {
-                stats.tun_tap_write_bytes = parse_u64(val, "tun_tap_write_bytes")?;
-                found_tun_write = true;
-            }
+             /* ~ changed by cargo-mutants ~ */
             "TCP/UDP read bytes" => {
                 stats.tcp_udp_read_bytes = parse_u64(val, "tcp_udp_read_bytes")?;
                 found_tcp_read = true;
             }
             "TCP/UDP write bytes" => {
                 stats.tcp_udp_write_bytes = parse_u64(val, "tcp_udp_write_bytes")?;
                 found_tcp_write = true;
             }

---- status::tests::client_statistics_with_compression stdout ----

thread 'status::tests::client_statistics_with_compression' (30536) panicked at openvpn-mgmt-codec\src\status.rs:754:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("TUN/TAP write bytes")

---- status::tests::client_statistics_basic stdout ----

thread 'status::tests::client_statistics_basic' (42796) panicked at openvpn-mgmt-codec\src\status.rs:738:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("TUN/TAP write bytes")

failures:
    status::tests::client_statistics_basic
    status::tests::client_statistics_with_compression

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
