*** openvpn-mgmt-codec/src/status.rs:521:13: delete match arm "TCP/UDP read bytes" in parse_client_statistics

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ delete match arm "TCP/UDP read bytes" in parse_client_statistics
@@ -513,20 +513,17 @@
             "TUN/TAP read bytes" => {
                 stats.tun_tap_read_bytes = parse_u64(val, "tun_tap_read_bytes")?;
                 found_tun_read = true;
             }
             "TUN/TAP write bytes" => {
                 stats.tun_tap_write_bytes = parse_u64(val, "tun_tap_write_bytes")?;
                 found_tun_write = true;
             }
-            "TCP/UDP read bytes" => {
-                stats.tcp_udp_read_bytes = parse_u64(val, "tcp_udp_read_bytes")?;
-                found_tcp_read = true;
-            }
+             /* ~ changed by cargo-mutants ~ */
             "TCP/UDP write bytes" => {
                 stats.tcp_udp_write_bytes = parse_u64(val, "tcp_udp_write_bytes")?;
                 found_tcp_write = true;
             }
             "Auth read bytes" => {
                 stats.auth_read_bytes = parse_u64(val, "auth_read_bytes")?;
                 found_auth_read = true;
             }

---- status::tests::client_statistics_basic stdout ----

thread 'status::tests::client_statistics_basic' (20444) panicked at openvpn-mgmt-codec\src\status.rs:738:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("TCP/UDP read bytes")

---- status::tests::client_statistics_with_compression stdout ----

thread 'status::tests::client_statistics_with_compression' (33364) panicked at openvpn-mgmt-codec\src\status.rs:754:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("TCP/UDP read bytes")

failures:
    status::tests::client_statistics_basic
    status::tests::client_statistics_with_compression

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
