*** openvpn-mgmt-codec/src/status.rs:525:13: delete match arm "TCP/UDP write bytes" in parse_client_statistics

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ delete match arm "TCP/UDP write bytes" in parse_client_statistics
@@ -517,20 +517,17 @@
             "TUN/TAP write bytes" => {
                 stats.tun_tap_write_bytes = parse_u64(val, "tun_tap_write_bytes")?;
                 found_tun_write = true;
             }
             "TCP/UDP read bytes" => {
                 stats.tcp_udp_read_bytes = parse_u64(val, "tcp_udp_read_bytes")?;
                 found_tcp_read = true;
             }
-            "TCP/UDP write bytes" => {
-                stats.tcp_udp_write_bytes = parse_u64(val, "tcp_udp_write_bytes")?;
-                found_tcp_write = true;
-            }
+             /* ~ changed by cargo-mutants ~ */
             "Auth read bytes" => {
                 stats.auth_read_bytes = parse_u64(val, "auth_read_bytes")?;
                 found_auth_read = true;
             }
             "pre-compress bytes" => {
                 stats.pre_compress_bytes = Some(parse_u64(val, "pre_compress_bytes")?);
             }
             "post-compress bytes" => {

---- status::tests::client_statistics_with_compression stdout ----

thread 'status::tests::client_statistics_with_compression' (45632) panicked at openvpn-mgmt-codec\src\status.rs:754:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("TCP/UDP write bytes")

---- status::tests::client_statistics_basic stdout ----

thread 'status::tests::client_statistics_basic' (41088) panicked at openvpn-mgmt-codec\src\status.rs:738:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("TCP/UDP write bytes")

failures:
    status::tests::client_statistics_basic
    status::tests::client_statistics_with_compression

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
