*** openvpn-mgmt-codec/src/status.rs:533:13: delete match arm "pre-compress bytes" in parse_client_statistics

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ delete match arm "pre-compress bytes" in parse_client_statistics
@@ -525,19 +525,17 @@
             "TCP/UDP write bytes" => {
                 stats.tcp_udp_write_bytes = parse_u64(val, "tcp_udp_write_bytes")?;
                 found_tcp_write = true;
             }
             "Auth read bytes" => {
                 stats.auth_read_bytes = parse_u64(val, "auth_read_bytes")?;
                 found_auth_read = true;
             }
-            "pre-compress bytes" => {
-                stats.pre_compress_bytes = Some(parse_u64(val, "pre_compress_bytes")?);
-            }
+             /* ~ changed by cargo-mutants ~ */
             "post-compress bytes" => {
                 stats.post_compress_bytes = Some(parse_u64(val, "post_compress_bytes")?);
             }
             "pre-decompress bytes" => {
                 stats.pre_decompress_bytes = Some(parse_u64(val, "pre_decompress_bytes")?);
             }
             "post-decompress bytes" => {
                 stats.post_decompress_bytes = Some(parse_u64(val, "post_decompress_bytes")?);

---- status::tests::client_statistics_with_compression stdout ----

thread 'status::tests::client_statistics_with_compression' (9412) panicked at openvpn-mgmt-codec\src\status.rs:757:9:
assertion `left == right` failed
  left: None
 right: Some(45388190)

failures:
    status::tests::client_statistics_with_compression

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
