*** openvpn-mgmt-codec/src/status.rs:539:13: delete match arm "pre-decompress bytes" in parse_client_statistics

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ delete match arm "pre-decompress bytes" in parse_client_statistics
@@ -531,19 +531,17 @@
                 found_auth_read = true;
             }
             "pre-compress bytes" => {
                 stats.pre_compress_bytes = Some(parse_u64(val, "pre_compress_bytes")?);
             }
             "post-compress bytes" => {
                 stats.post_compress_bytes = Some(parse_u64(val, "post_compress_bytes")?);
             }
-            "pre-decompress bytes" => {
-                stats.pre_decompress_bytes = Some(parse_u64(val, "pre_decompress_bytes")?);
-            }
+             /* ~ changed by cargo-mutants ~ */
             "post-decompress bytes" => {
                 stats.post_decompress_bytes = Some(parse_u64(val, "post_decompress_bytes")?);
             }
             _ => {} // Forward-compat: ignore unknown keys
         }
     }
 
     if !found_tun_read {

---- status::tests::client_statistics_with_compression stdout ----

thread 'status::tests::client_statistics_with_compression' (34072) panicked at openvpn-mgmt-codec\src\status.rs:759:9:
assertion `left == right` failed
  left: None
 right: Some(162596168)

failures:
    status::tests::client_statistics_with_compression

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
