*** openvpn-mgmt-codec/src/status.rs:549:8: delete ! in parse_client_statistics

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ delete ! in parse_client_statistics
@@ -541,17 +541,17 @@
             }
             "post-decompress bytes" => {
                 stats.post_decompress_bytes = Some(parse_u64(val, "post_decompress_bytes")?);
             }
             _ => {} // Forward-compat: ignore unknown keys
         }
     }
 
-    if !found_tun_read {
+    if  /* ~ changed by cargo-mutants ~ */found_tun_read {
         return Err(ParseStatusError::MissingStatisticsKey("TUN/TAP read bytes"));
     }
     if !found_tun_write {
         return Err(ParseStatusError::MissingStatisticsKey(
             "TUN/TAP write bytes",
         ));
     }
     if !found_tcp_read {

---- status::tests::client_statistics_basic stdout ----

thread 'status::tests::client_statistics_basic' (6648) panicked at openvpn-mgmt-codec\src\status.rs:741:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("TUN/TAP read bytes")

---- status::tests::client_statistics_missing_key stdout ----

thread 'status::tests::client_statistics_missing_key' (5252) panicked at openvpn-mgmt-codec\src\status.rs:773:9:
assertion failed: matches!(err, ParseStatusError::MissingStatisticsKey("TUN/TAP write bytes"))

---- status::tests::client_statistics_with_compression stdout ----

thread 'status::tests::client_statistics_with_compression' (41800) panicked at openvpn-mgmt-codec\src\status.rs:757:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("TUN/TAP read bytes")

failures:
    status::tests::client_statistics_basic
    status::tests::client_statistics_missing_key
    status::tests::client_statistics_with_compression

test result: FAILED. 360 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
