*** openvpn-mgmt-codec/src/status.rs:552:8: delete ! in parse_client_statistics

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ delete ! in parse_client_statistics
@@ -544,17 +544,17 @@
             }
             _ => {} // Forward-compat: ignore unknown keys
         }
     }
 
     if !found_tun_read {
         return Err(ParseStatusError::MissingStatisticsKey("TUN/TAP read bytes"));
     }
-    if !found_tun_write {
+    if  /* ~ changed by cargo-mutants ~ */found_tun_write {
         return Err(ParseStatusError::MissingStatisticsKey(
             "TUN/TAP write bytes",
         ));
     }
     if !found_tcp_read {
         return Err(ParseStatusError::MissingStatisticsKey("TCP/UDP read bytes"));
     }
     if !found_tcp_write {

---- status::tests::client_statistics_basic stdout ----

thread 'status::tests::client_statistics_basic' (17732) panicked at openvpn-mgmt-codec\src\status.rs:741:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("TUN/TAP write bytes")

---- status::tests::client_statistics_missing_key stdout ----

thread 'status::tests::client_statistics_missing_key' (19568) panicked at openvpn-mgmt-codec\src\status.rs:773:9:
assertion failed: matches!(err, ParseStatusError::MissingStatisticsKey("TUN/TAP write bytes"))

---- status::tests::client_statistics_with_compression stdout ----

thread 'status::tests::client_statistics_with_compression' (38584) panicked at openvpn-mgmt-codec\src\status.rs:757:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("TUN/TAP write bytes")

failures:
    status::tests::client_statistics_basic
    status::tests::client_statistics_missing_key
    status::tests::client_statistics_with_compression

test result: FAILED. 358 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
