*** openvpn-mgmt-codec/src/status.rs:560:8: delete ! in parse_client_statistics

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ delete ! in parse_client_statistics
@@ -552,17 +552,17 @@
     if !found_tun_write {
         return Err(ParseStatusError::MissingStatisticsKey(
             "TUN/TAP write bytes",
         ));
     }
     if !found_tcp_read {
         return Err(ParseStatusError::MissingStatisticsKey("TCP/UDP read bytes"));
     }
-    if !found_tcp_write {
+    if  /* ~ changed by cargo-mutants ~ */found_tcp_write {
         return Err(ParseStatusError::MissingStatisticsKey(
             "TCP/UDP write bytes",
         ));
     }
     if !found_auth_read {
         return Err(ParseStatusError::MissingStatisticsKey("Auth read bytes"));
     }

---- status::tests::client_statistics_with_compression stdout ----

thread 'status::tests::client_statistics_with_compression' (36960) panicked at openvpn-mgmt-codec\src\status.rs:757:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("TCP/UDP write bytes")

---- status::tests::client_statistics_basic stdout ----

thread 'status::tests::client_statistics_basic' (33392) panicked at openvpn-mgmt-codec\src\status.rs:741:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("TCP/UDP write bytes")

failures:
    status::tests::client_statistics_basic
    status::tests::client_statistics_with_compression

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
