*** openvpn-mgmt-codec/src/status.rs:565:8: delete ! in parse_client_statistics

*** mutation diff:
--- openvpn-mgmt-codec/src/status.rs
+++ delete ! in parse_client_statistics
@@ -557,17 +557,17 @@
     if !found_tcp_read {
         return Err(ParseStatusError::MissingStatisticsKey("TCP/UDP read bytes"));
     }
     if !found_tcp_write {
         return Err(ParseStatusError::MissingStatisticsKey(
             "TCP/UDP write bytes",
         ));
     }
-    if !found_auth_read {
+    if  /* ~ changed by cargo-mutants ~ */found_auth_read {
         return Err(ParseStatusError::MissingStatisticsKey("Auth read bytes"));
     }
 
     Ok(stats)
 }
 
 #[cfg(test)]
 mod tests {

---- status::tests::client_statistics_basic stdout ----

thread 'status::tests::client_statistics_basic' (39312) panicked at openvpn-mgmt-codec\src\status.rs:741:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("Auth read bytes")

---- status::tests::client_statistics_with_compression stdout ----

thread 'status::tests::client_statistics_with_compression' (7216) panicked at openvpn-mgmt-codec\src\status.rs:757:53:
called `Result::unwrap()` on an `Err` value: MissingStatisticsKey("Auth read bytes")

failures:
    status::tests::client_statistics_basic
    status::tests::client_statistics_with_compression

test result: FAILED. 361 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
