*** openvpn-mgmt-codec/src/status_format.rs:34:9: replace <impl FromStr for StatusFormat>::from_str -> Result<Self, Self::Err> with Ok(Default::default())

*** mutation diff:
--- openvpn-mgmt-codec/src/status_format.rs
+++ replace <impl FromStr for StatusFormat>::from_str -> Result<Self, Self::Err> with Ok(Default::default())
@@ -26,22 +26,17 @@
     V3,
 }
 
 impl FromStr for StatusFormat {
     type Err = ParseStatusFormatError;
 
     /// Parse a status format version: `1`, `2`, or `3`.
     fn from_str(input: &str) -> Result<Self, Self::Err> {
-        match input {
-            "1" => Ok(Self::V1),
-            "2" => Ok(Self::V2),
-            "3" => Ok(Self::V3),
-            other => Err(ParseStatusFormatError(other.to_string())),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use test_case::test_case;

---- status_format::tests::display_roundtrip::statusformat_v2_expects stdout ----

thread 'status_format::tests::display_roundtrip::statusformat_v2_expects' (44224) panicked at openvpn-mgmt-codec\src\status_format.rs:48:9:
assertion `left == right` failed
  left: V1
 right: V2

---- status_format::tests::display_roundtrip::statusformat_v3_expects stdout ----

thread 'status_format::tests::display_roundtrip::statusformat_v3_expects' (9132) panicked at openvpn-mgmt-codec\src\status_format.rs:48:9:
assertion `left == right` failed
  left: V1
 right: V3

---- status_format::tests::parse_invalid stdout ----

thread 'status_format::tests::parse_invalid' (33588) panicked at openvpn-mgmt-codec\src\status_format.rs:60:9:
assertion failed: "4".parse::<StatusFormat>().is_err()

failures:
    status_format::tests::display_roundtrip::statusformat_v2_expects
    status_format::tests::display_roundtrip::statusformat_v3_expects
    status_format::tests::parse_invalid

test result: FAILED. 358 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
