*** openvpn-mgmt-codec/src/stream.rs:101:9: replace <impl Stream for Classified<S>>::poll_next -> Poll<Option<Self::Item>> with Poll::from(None)

*** mutation diff:
--- openvpn-mgmt-codec/src/stream.rs
+++ replace <impl Stream for Classified<S>>::poll_next -> Poll<Option<Self::Item>> with Poll::from(None)
@@ -93,20 +93,17 @@
 
 impl<S> Stream for Classified<S>
 where
     S: Stream<Item = Result<OvpnMessage, io::Error>>,
 {
     type Item = Result<ManagementEvent, io::Error>;
 
     fn poll_next(self: Pin<&mut Self>, cx: &mut Context<'_>) -> Poll<Option<Self::Item>> {
-        self.project()
-            .inner
-            .poll_next(cx)
-            .map(|opt| opt.map(|result| result.map(ManagementEvent::from)))
+        Poll::from(None) /* ~ changed by cargo-mutants ~ */
     }
 
     fn size_hint(&self) -> (usize, Option<usize>) {
         self.inner.size_hint()
     }
 }
 
 /// Extension trait that adds [`.classify()`](ClassifyExt::classify) to

---- framed_classify_stream_adapter stdout ----

thread 'framed_classify_stream_adapter' (6800) panicked at openvpn-mgmt-codec\tests\framed_integration.rs:107:5:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    framed_classify_stream_adapter

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
