*** openvpn-mgmt-codec/src/stream_mode.rs:36:9: replace StreamMode::returns_history -> bool with true

*** mutation diff:
--- openvpn-mgmt-codec/src/stream_mode.rs
+++ replace StreamMode::returns_history -> bool with true
@@ -28,17 +28,17 @@
     /// Show the N most recent history entries.
     Recent(u32),
 }
 
 impl StreamMode {
     /// Whether this mode produces a multi-line history dump rather than a
     /// simple `SUCCESS:` acknowledgement.
     pub fn returns_history(self) -> bool {
-        matches!(self, Self::All | Self::OnAll | Self::Recent(_))
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for StreamMode {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         match self {
             Self::On => f.write_str("on"),
             Self::Off => f.write_str("off"),

---- client::tests::echo_off_returns_none stdout ----

thread 'client::tests::echo_off_returns_none' (31860) panicked at openvpn-mgmt-codec\src\client.rs:1118:52:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(Success("real-time echo notification set to OFF"))

---- client::tests::log_on_returns_none stdout ----

thread 'client::tests::log_on_returns_none' (23532) panicked at openvpn-mgmt-codec\src\client.rs:1099:50:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(Success("real-time log notification set to ON"))

---- client::tests::state_stream_on_returns_none stdout ----

thread 'client::tests::state_stream_on_returns_none' (33196) panicked at openvpn-mgmt-codec\src\client.rs:1125:59:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(Success("real-time state notification set to ON"))

failures:
    client::tests::echo_off_returns_none
    client::tests::log_on_returns_none
    client::tests::state_stream_on_returns_none

test result: FAILED. 358 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
