*** openvpn-mgmt-codec/src/stream_mode.rs:36:9: replace StreamMode::returns_history -> bool with false

*** mutation diff:
--- openvpn-mgmt-codec/src/stream_mode.rs
+++ replace StreamMode::returns_history -> bool with false
@@ -28,17 +28,17 @@
     /// Show the N most recent history entries.
     Recent(u32),
 }
 
 impl StreamMode {
     /// Whether this mode produces a multi-line history dump rather than a
     /// simple `SUCCESS:` acknowledgement.
     pub fn returns_history(self) -> bool {
-        matches!(self, Self::All | Self::OnAll | Self::Recent(_))
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for StreamMode {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         match self {
             Self::On => f.write_str("on"),
             Self::Off => f.write_str("off"),

---- client::tests::log_all_returns_history stdout ----

thread 'client::tests::log_all_returns_history' (35056) panicked at openvpn-mgmt-codec\src\client.rs:1110:55:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(MultiLine(["1700000000,I,Log entry one", "1700000001,D,Log entry two"]))

---- client::tests::state_stream_all_returns_parsed_history stdout ----

thread 'client::tests::state_stream_all_returns_parsed_history' (38272) panicked at openvpn-mgmt-codec\src\client.rs:1135:66:
called `Result::unwrap()` on an `Err` value: UnexpectedResponse(MultiLine(["1700000000,CONNECTED,SUCCESS,10.8.0.1,1.2.3.4,1194,,,"]))

failures:
    client::tests::log_all_returns_history
    client::tests::state_stream_all_returns_parsed_history

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
