*** openvpn-mgmt-codec/src/stream_mode.rs:42:9: replace <impl fmt::Display for StreamMode>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- openvpn-mgmt-codec/src/stream_mode.rs
+++ replace <impl fmt::Display for StreamMode>::fmt -> fmt::Result with Ok(Default::default())
@@ -34,23 +34,17 @@
     /// simple `SUCCESS:` acknowledgement.
     pub fn returns_history(self) -> bool {
         matches!(self, Self::All | Self::OnAll | Self::Recent(_))
     }
 }
 
 impl fmt::Display for StreamMode {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::On => f.write_str("on"),
-            Self::Off => f.write_str("off"),
-            Self::All => f.write_str("all"),
-            Self::OnAll => f.write_str("on all"),
-            Self::Recent(n) => write!(f, "{n}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl FromStr for StreamMode {
     type Err = ParseStreamModeError;
 
     /// Parse a stream mode string: `on`, `off`, `all`, `on all`, or a number.
     fn from_str(input: &str) -> Result<Self, Self::Err> {

---- codec::tests::encode_echo_on_all stdout ----
2026-03-29T11:17:00.533899Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=echo expected=MultiLine queue_depth=1

thread 'codec::tests::encode_echo_on_all' (21784) panicked at openvpn-mgmt-codec\src\codec.rs:1587:9:
assertion `left == right` failed
  left: "echo \n"
 right: "echo on all\n"

---- codec::tests::encode_state_recent stdout ----
2026-03-29T11:17:00.535381Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=state-stream expected=MultiLine queue_depth=1

thread 'codec::tests::encode_state_recent' (29324) panicked at openvpn-mgmt-codec\src\codec.rs:1355:9:
assertion `left == right` failed
  left: "state \n"
 right: "state 5\n"

---- codec::tests::encode_state_on_all stdout ----
2026-03-29T11:17:00.535387Z DEBUG openvpn_mgmt_codec::codec: encoding command cmd=state-stream expected=MultiLine queue_depth=1

thread 'codec::tests::encode_state_on_all' (32572) panicked at openvpn-mgmt-codec\src\codec.rs:1347:9:
assertion `left == right` failed
  left: "state \n"
 right: "state on all\n"

failures:
    codec::tests::encode_echo_on_all
    codec::tests::encode_state_on_all
    codec::tests::encode_state_recent
    stream_mode::tests::parse_roundtrip::streammode_all_expects
    stream_mode::tests::parse_roundtrip::streammode_off_expects
    stream_mode::tests::parse_roundtrip::streammode_on_expects
    stream_mode::tests::parse_roundtrip::streammode_onall_expects
    stream_mode::tests::parse_roundtrip::streammode_recent_42_expects

test result: FAILED. 355 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
