*** openvpn-mgmt-codec/src/timestamp.rs:22:5: replace decompose -> (u64, u64, u64, u64, u64, u64) with (0, 1, 0, 1, 1, 0)

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace decompose -> (u64, u64, u64, u64, u64, u64) with (0, 1, 0, 1, 1, 0)
@@ -14,24 +14,17 @@
 //! ```
 
 use std::fmt;
 
 /// Decompose a Unix timestamp into `(year, month, day, hour, minute, second)`.
 ///
 /// All values are UTC. No timezone handling is performed.
 pub fn decompose(ts: u64) -> (u64, u64, u64, u64, u64, u64) {
-    let secs = ts % 60;
-    let mins_total = ts / 60;
-    let mins = mins_total % 60;
-    let hours_total = mins_total / 60;
-    let hours = hours_total % 24;
-    let days_total = hours_total / 24;
-    let (year, month, day) = days_to_ymd(days_total);
-    (year, month, day, hours, mins, secs)
+    (0, 1, 0, 1, 1, 0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Format a Unix timestamp as ISO 8601 UTC: `2024-03-21T14:30:00Z`.
 ///
 /// Returns an empty string for timestamp `0` (unset).
 pub fn format_utc(ts: u64) -> String {
     if ts == 0 {
         return String::new();

---- timestamp::tests::format_timestamp_known_date stdout ----

thread 'timestamp::tests::format_timestamp_known_date' (18132) panicked at openvpn-mgmt-codec\src\timestamp.rs:119:9:
assertion `left == right` failed
  left: "0000-01-00 01:01:00"
 right: "2024-03-21 14:30:00"

---- timestamp::tests::format_utc_known_date stdout ----

thread 'timestamp::tests::format_utc_known_date' (5608) panicked at openvpn-mgmt-codec\src\timestamp.rs:104:9:
assertion `left == right` failed
  left: "0000-01-00T01:01:00Z"
 right: "2024-03-21T14:30:00Z"

---- timestamp::tests::format_utc_epoch_plus_one stdout ----

thread 'timestamp::tests::format_utc_epoch_plus_one' (41236) panicked at openvpn-mgmt-codec\src\timestamp.rs:99:9:
assertion `left == right` failed
  left: "0000-01-00T01:01:00Z"
 right: "1970-01-01T00:00:01Z"

failures:
    timestamp::tests::format_timestamp_known_date
    timestamp::tests::format_utc_epoch_plus_one
    timestamp::tests::format_utc_known_date
    timestamp::tests::format_utc_leap_day
    timestamp::tests::format_utc_y2k
    timestamp::tests::utc_timestamp_display

test result: FAILED. 357 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
