*** openvpn-mgmt-codec/src/timestamp.rs:25:34: replace / with * in decompose

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace / with * in decompose
@@ -17,17 +17,17 @@
 
 /// Decompose a Unix timestamp into `(year, month, day, hour, minute, second)`.
 ///
 /// All values are UTC. No timezone handling is performed.
 pub fn decompose(ts: u64) -> (u64, u64, u64, u64, u64, u64) {
     let secs = ts % 60;
     let mins_total = ts / 60;
     let mins = mins_total % 60;
-    let hours_total = mins_total / 60;
+    let hours_total = mins_total * /* ~ changed by cargo-mutants ~ */ 60;
     let hours = hours_total % 24;
     let days_total = hours_total / 24;
     let (year, month, day) = days_to_ymd(days_total);
     (year, month, day, hours, mins, secs)
 }
 
 /// Format a Unix timestamp as ISO 8601 UTC: `2024-03-21T14:30:00Z`.
 ///

---- timestamp::tests::format_timestamp_known_date stdout ----

thread 'timestamp::tests::format_timestamp_known_date' (42920) panicked at openvpn-mgmt-codec\src\timestamp.rs:126:9:
assertion `left == right` failed
  left: "197163-07-16 00:30:00"
 right: "2024-03-21 14:30:00"

---- timestamp::tests::format_utc_leap_day stdout ----

thread 'timestamp::tests::format_utc_leap_day' (20496) panicked at openvpn-mgmt-codec\src\timestamp.rs:121:9:
assertion `left == right` failed
  left: "196955-07-11T00:00:00Z"
 right: "2024-02-29T12:00:00Z"

---- timestamp::tests::format_utc_known_date stdout ----

thread 'timestamp::tests::format_utc_known_date' (33448) panicked at openvpn-mgmt-codec\src\timestamp.rs:111:9:
assertion `left == right` failed
  left: "197163-07-16T00:30:00Z"
 right: "2024-03-21T14:30:00Z"

failures:
    timestamp::tests::format_timestamp_known_date
    timestamp::tests::format_utc_known_date
    timestamp::tests::format_utc_leap_day
    timestamp::tests::format_utc_y2k
    timestamp::tests::utc_timestamp_display

test result: FAILED. 356 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
