*** openvpn-mgmt-codec/src/timestamp.rs:36:11: replace == with != in format_utc

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace == with != in format_utc
@@ -28,17 +28,17 @@
     let (year, month, day) = days_to_ymd(days_total);
     (year, month, day, hours, mins, secs)
 }
 
 /// Format a Unix timestamp as ISO 8601 UTC: `2024-03-21T14:30:00Z`.
 ///
 /// Returns an empty string for timestamp `0` (unset).
 pub fn format_utc(ts: u64) -> String {
-    if ts == 0 {
+    if ts != /* ~ changed by cargo-mutants ~ */ 0 {
         return String::new();
     }
     let (year, month, day, hours, mins, secs) = decompose(ts);
     format!("{year:04}-{month:02}-{day:02}T{hours:02}:{mins:02}:{secs:02}Z")
 }
 
 /// Format a Unix timestamp with a space separator: `2024-03-21 14:30:00`.
 ///

---- timestamp::tests::format_utc_epoch_plus_one stdout ----

thread 'timestamp::tests::format_utc_epoch_plus_one' (15696) panicked at openvpn-mgmt-codec\src\timestamp.rs:106:9:
assertion `left == right` failed
  left: ""
 right: "1970-01-01T00:00:01Z"

---- timestamp::tests::format_utc_known_date stdout ----

thread 'timestamp::tests::format_utc_known_date' (30732) panicked at openvpn-mgmt-codec\src\timestamp.rs:111:9:
assertion `left == right` failed
  left: ""
 right: "2024-03-21T14:30:00Z"

---- timestamp::tests::format_utc_leap_day stdout ----

thread 'timestamp::tests::format_utc_leap_day' (40388) panicked at openvpn-mgmt-codec\src\timestamp.rs:121:9:
assertion `left == right` failed
  left: ""
 right: "2024-02-29T12:00:00Z"

failures:
    timestamp::tests::format_utc_epoch_plus_one
    timestamp::tests::format_utc_known_date
    timestamp::tests::format_utc_leap_day
    timestamp::tests::format_utc_y2k
    timestamp::tests::format_utc_zero

test result: FAILED. 358 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
