*** openvpn-mgmt-codec/src/timestamp.rs:36:5: replace format_utc -> String with "xyzzy".into()

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace format_utc -> String with "xyzzy".into()
@@ -28,21 +28,17 @@
     let (year, month, day) = days_to_ymd(days_total);
     (year, month, day, hours, mins, secs)
 }
 
 /// Format a Unix timestamp as ISO 8601 UTC: `2024-03-21T14:30:00Z`.
 ///
 /// Returns an empty string for timestamp `0` (unset).
 pub fn format_utc(ts: u64) -> String {
-    if ts == 0 {
-        return String::new();
-    }
-    let (year, month, day, hours, mins, secs) = decompose(ts);
-    format!("{year:04}-{month:02}-{day:02}T{hours:02}:{mins:02}:{secs:02}Z")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Format a Unix timestamp with a space separator: `2024-03-21 14:30:00`.
 ///
 /// Returns an empty string for timestamp `0` (unset).
 pub fn format_timestamp(ts: u64) -> String {
     if ts == 0 {
         return String::new();

---- timestamp::tests::format_utc_epoch_plus_one stdout ----

thread 'timestamp::tests::format_utc_epoch_plus_one' (34520) panicked at openvpn-mgmt-codec\src\timestamp.rs:102:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "1970-01-01T00:00:01Z"

---- timestamp::tests::format_utc_known_date stdout ----

thread 'timestamp::tests::format_utc_known_date' (9252) panicked at openvpn-mgmt-codec\src\timestamp.rs:107:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "2024-03-21T14:30:00Z"

---- timestamp::tests::format_utc_y2k stdout ----

thread 'timestamp::tests::format_utc_y2k' (38400) panicked at openvpn-mgmt-codec\src\timestamp.rs:112:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "2000-01-01T00:00:00Z"

failures:
    timestamp::tests::format_utc_epoch_plus_one
    timestamp::tests::format_utc_known_date
    timestamp::tests::format_utc_leap_day
    timestamp::tests::format_utc_y2k
    timestamp::tests::format_utc_zero

test result: FAILED. 356 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
