*** openvpn-mgmt-codec/src/timestamp.rs:47:5: replace format_timestamp -> String with String::new()

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace format_timestamp -> String with String::new()
@@ -39,21 +39,17 @@
     let (year, month, day, hours, mins, secs) = decompose(ts);
     format!("{year:04}-{month:02}-{day:02}T{hours:02}:{mins:02}:{secs:02}Z")
 }
 
 /// Format a Unix timestamp with a space separator: `2024-03-21 14:30:00`.
 ///
 /// Returns an empty string for timestamp `0` (unset).
 pub fn format_timestamp(ts: u64) -> String {
-    if ts == 0 {
-        return String::new();
-    }
-    let (year, month, day, hours, mins, secs) = decompose(ts);
-    format!("{year:04}-{month:02}-{day:02} {hours:02}:{mins:02}:{secs:02}")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Convert days since Unix epoch to `(year, month, day)`.
 ///
 /// Uses the [civil_from_days algorithm by Howard Hinnant][algo].
 ///
 /// [algo]: http://howardhinnant.github.io/date_algorithms.html
 pub fn days_to_ymd(mut days: u64) -> (u64, u64, u64) {

---- timestamp::tests::format_timestamp_known_date stdout ----

thread 'timestamp::tests::format_timestamp_known_date' (31812) panicked at openvpn-mgmt-codec\src\timestamp.rs:122:9:
assertion `left == right` failed
  left: ""
 right: "2024-03-21 14:30:00"

failures:
    timestamp::tests::format_timestamp_known_date

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
