*** openvpn-mgmt-codec/src/timestamp.rs:60:5: replace days_to_ymd -> (u64, u64, u64) with (0, 1, 1)

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace days_to_ymd -> (u64, u64, u64) with (0, 1, 1)
@@ -52,31 +52,17 @@
 }
 
 /// Convert days since Unix epoch to `(year, month, day)`.
 ///
 /// Uses the [civil_from_days algorithm by Howard Hinnant][algo].
 ///
 /// [algo]: http://howardhinnant.github.io/date_algorithms.html
 pub fn days_to_ymd(mut days: u64) -> (u64, u64, u64) {
-    days += 719_468;
-    let era = days / 146_097;
-    let doe = days - era * 146_097;
-    let yoe = (doe - doe / 1460 + doe / 36524 - doe / 146_096) / 365;
-    let year = yoe + era * 400;
-    let doy = doe - (365 * yoe + yoe / 4 - yoe / 100);
-    let month_offset = (5 * doy + 2) / 153;
-    let day = doy - (153 * month_offset + 2) / 5 + 1;
-    let month = if month_offset < 10 {
-        month_offset + 3
-    } else {
-        month_offset - 9
-    };
-    let year = if month <= 2 { year + 1 } else { year };
-    (year, month, day)
+    (0, 1, 1) /* ~ changed by cargo-mutants ~ */
 }
 
 /// A Unix timestamp that implements [`Display`](fmt::Display) using
 /// [`format_utc`].
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct UtcTimestamp(pub u64);
 
 impl fmt::Display for UtcTimestamp {

---- timestamp::tests::days_to_ymd_jan_1_2000 stdout ----

thread 'timestamp::tests::days_to_ymd_jan_1_2000' (17692) panicked at openvpn-mgmt-codec\src\timestamp.rs:137:9:
assertion `left == right` failed
  left: (0, 1, 1)
 right: (2000, 1, 1)

---- timestamp::tests::days_to_ymd_epoch stdout ----

thread 'timestamp::tests::days_to_ymd_epoch' (29220) panicked at openvpn-mgmt-codec\src\timestamp.rs:117:9:
assertion `left == right` failed
  left: (0, 1, 1)
 right: (1970, 1, 1)

---- timestamp::tests::days_to_ymd_known_date stdout ----

thread 'timestamp::tests::days_to_ymd_known_date' (46244) panicked at openvpn-mgmt-codec\src\timestamp.rs:122:9:
assertion `left == right` failed
  left: (0, 1, 1)
 right: (2024, 3, 21)

failures:
    timestamp::tests::days_to_ymd_dec_31
    timestamp::tests::days_to_ymd_epoch
    timestamp::tests::days_to_ymd_jan_1_2000
    timestamp::tests::days_to_ymd_known_date
    timestamp::tests::days_to_ymd_leap_day
    timestamp::tests::format_timestamp_known_date
    timestamp::tests::format_utc_epoch_plus_one
    timestamp::tests::format_utc_known_date
    timestamp::tests::format_utc_leap_day
    timestamp::tests::format_utc_y2k
    timestamp::tests::utc_timestamp_display

test result: FAILED. 352 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
