*** openvpn-mgmt-codec/src/timestamp.rs:63:33: replace + with * in days_to_ymd

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace + with * in days_to_ymd
@@ -55,17 +55,17 @@
 ///
 /// Uses the [civil_from_days algorithm by Howard Hinnant][algo].
 ///
 /// [algo]: http://howardhinnant.github.io/date_algorithms.html
 pub fn days_to_ymd(mut days: u64) -> (u64, u64, u64) {
     days += 719_468;
     let era = days / 146_097;
     let doe = days - era * 146_097;
-    let yoe = (doe - doe / 1460 + doe / 36524 - doe / 146_096) / 365;
+    let yoe = (doe - doe / 1460 * /* ~ changed by cargo-mutants ~ */ doe / 36524 - doe / 146_096) / 365;
     let year = yoe + era * 400;
     let doy = doe - (365 * yoe + yoe / 4 - yoe / 100);
     let month_offset = (5 * doy + 2) / 153;
     let day = doy - (153 * month_offset + 2) / 5 + 1;
     let month = if month_offset < 10 {
         month_offset + 3
     } else {
         month_offset - 9

---- timestamp::tests::days_to_ymd_leap_day stdout ----

thread 'timestamp::tests::days_to_ymd_leap_day' (41436) panicked at openvpn-mgmt-codec\src\timestamp.rs:65:15:
attempt to subtract with overflow

---- timestamp::tests::format_utc_leap_day stdout ----

thread 'timestamp::tests::format_utc_leap_day' (30716) panicked at openvpn-mgmt-codec\src\timestamp.rs:65:15:
attempt to subtract with overflow

failures:
    timestamp::tests::days_to_ymd_leap_day
    timestamp::tests::format_utc_leap_day

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
