*** openvpn-mgmt-codec/src/timestamp.rs:64:20: replace + with - in days_to_ymd

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace + with - in days_to_ymd
@@ -56,17 +56,17 @@
 /// Uses the [civil_from_days algorithm by Howard Hinnant][algo].
 ///
 /// [algo]: http://howardhinnant.github.io/date_algorithms.html
 pub fn days_to_ymd(mut days: u64) -> (u64, u64, u64) {
     days += 719_468;
     let era = days / 146_097;
     let doe = days - era * 146_097;
     let yoe = (doe - doe / 1460 + doe / 36524 - doe / 146_096) / 365;
-    let year = yoe + era * 400;
+    let year = yoe - /* ~ changed by cargo-mutants ~ */ era * 400;
     let doy = doe - (365 * yoe + yoe / 4 - yoe / 100);
     let month_offset = (5 * doy + 2) / 153;
     let day = doy - (153 * month_offset + 2) / 5 + 1;
     let month = if month_offset < 10 {
         month_offset + 3
     } else {
         month_offset - 9
     };

---- timestamp::tests::days_to_ymd_dec_31 stdout ----

thread 'timestamp::tests::days_to_ymd_dec_31' (37628) panicked at openvpn-mgmt-codec\src\timestamp.rs:64:16:
attempt to subtract with overflow

---- timestamp::tests::days_to_ymd_epoch stdout ----

thread 'timestamp::tests::days_to_ymd_epoch' (41192) panicked at openvpn-mgmt-codec\src\timestamp.rs:64:16:
attempt to subtract with overflow

---- timestamp::tests::days_to_ymd_jan_1_2000 stdout ----

thread 'timestamp::tests::days_to_ymd_jan_1_2000' (44788) panicked at openvpn-mgmt-codec\src\timestamp.rs:64:16:
attempt to subtract with overflow

failures:
    timestamp::tests::days_to_ymd_dec_31
    timestamp::tests::days_to_ymd_epoch
    timestamp::tests::days_to_ymd_jan_1_2000
    timestamp::tests::days_to_ymd_known_date
    timestamp::tests::days_to_ymd_leap_day
    timestamp::tests::format_timestamp_known_date
    timestamp::tests::format_utc_epoch_plus_one
    timestamp::tests::format_utc_known_date
    timestamp::tests::format_utc_leap_day
    timestamp::tests::format_utc_y2k
    timestamp::tests::utc_timestamp_display

test result: FAILED. 352 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
