*** openvpn-mgmt-codec/src/timestamp.rs:65:32: replace + with - in days_to_ymd

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace + with - in days_to_ymd
@@ -57,17 +57,17 @@
 ///
 /// [algo]: http://howardhinnant.github.io/date_algorithms.html
 pub fn days_to_ymd(mut days: u64) -> (u64, u64, u64) {
     days += 719_468;
     let era = days / 146_097;
     let doe = days - era * 146_097;
     let yoe = (doe - doe / 1460 + doe / 36524 - doe / 146_096) / 365;
     let year = yoe + era * 400;
-    let doy = doe - (365 * yoe + yoe / 4 - yoe / 100);
+    let doy = doe - (365 * yoe - /* ~ changed by cargo-mutants ~ */ yoe / 4 - yoe / 100);
     let month_offset = (5 * doy + 2) / 153;
     let day = doy - (153 * month_offset + 2) / 5 + 1;
     let month = if month_offset < 10 {
         month_offset + 3
     } else {
         month_offset - 9
     };
     let year = if month <= 2 { year + 1 } else { year };

---- timestamp::tests::days_to_ymd_epoch stdout ----

thread 'timestamp::tests::days_to_ymd_epoch' (44204) panicked at openvpn-mgmt-codec\src\timestamp.rs:131:9:
assertion `left == right` failed
  left: (1969, 7, 1)
 right: (1970, 1, 1)

---- timestamp::tests::days_to_ymd_jan_1_2000 stdout ----

thread 'timestamp::tests::days_to_ymd_jan_1_2000' (14736) panicked at openvpn-mgmt-codec\src\timestamp.rs:151:9:
assertion `left == right` failed
  left: (1999, 7, 15)
 right: (2000, 1, 1)

---- timestamp::tests::days_to_ymd_known_date stdout ----

thread 'timestamp::tests::days_to_ymd_known_date' (40796) panicked at openvpn-mgmt-codec\src\timestamp.rs:136:9:
assertion `left == right` failed
  left: (2024, 4, 2)
 right: (2024, 3, 21)

failures:
    timestamp::tests::days_to_ymd_dec_31
    timestamp::tests::days_to_ymd_epoch
    timestamp::tests::days_to_ymd_jan_1_2000
    timestamp::tests::days_to_ymd_known_date
    timestamp::tests::days_to_ymd_leap_day
    timestamp::tests::format_timestamp_known_date
    timestamp::tests::format_utc_epoch_plus_one
    timestamp::tests::format_utc_known_date
    timestamp::tests::format_utc_leap_day
    timestamp::tests::format_utc_y2k
    timestamp::tests::utc_timestamp_display

test result: FAILED. 352 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
