*** openvpn-mgmt-codec/src/timestamp.rs:66:33: replace + with - in days_to_ymd

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace + with - in days_to_ymd
@@ -58,17 +58,17 @@
 /// [algo]: http://howardhinnant.github.io/date_algorithms.html
 pub fn days_to_ymd(mut days: u64) -> (u64, u64, u64) {
     days += 719_468;
     let era = days / 146_097;
     let doe = days - era * 146_097;
     let yoe = (doe - doe / 1460 + doe / 36524 - doe / 146_096) / 365;
     let year = yoe + era * 400;
     let doy = doe - (365 * yoe + yoe / 4 - yoe / 100);
-    let month_offset = (5 * doy + 2) / 153;
+    let month_offset = (5 * doy - /* ~ changed by cargo-mutants ~ */ 2) / 153;
     let day = doy - (153 * month_offset + 2) / 5 + 1;
     let month = if month_offset < 10 {
         month_offset + 3
     } else {
         month_offset - 9
     };
     let year = if month <= 2 { year + 1 } else { year };
     (year, month, day)

---- timestamp::tests::days_to_ymd_epoch stdout ----

thread 'timestamp::tests::days_to_ymd_epoch' (36428) panicked at openvpn-mgmt-codec\src\timestamp.rs:131:9:
assertion `left == right` failed
  left: (1969, 12, 32)
 right: (1970, 1, 1)

---- timestamp::tests::format_utc_y2k stdout ----

thread 'timestamp::tests::format_utc_y2k' (20148) panicked at openvpn-mgmt-codec\src\timestamp.rs:116:9:
assertion `left == right` failed
  left: "1999-12-32T00:00:00Z"
 right: "2000-01-01T00:00:00Z"

---- timestamp::tests::format_utc_epoch_plus_one stdout ----

thread 'timestamp::tests::format_utc_epoch_plus_one' (46884) panicked at openvpn-mgmt-codec\src\timestamp.rs:106:9:
assertion `left == right` failed
  left: "1969-12-32T00:00:01Z"
 right: "1970-01-01T00:00:01Z"

failures:
    timestamp::tests::days_to_ymd_epoch
    timestamp::tests::days_to_ymd_jan_1_2000
    timestamp::tests::format_utc_epoch_plus_one
    timestamp::tests::format_utc_y2k

test result: FAILED. 357 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
