*** openvpn-mgmt-codec/src/timestamp.rs:67:19: replace - with / in days_to_ymd

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace - with / in days_to_ymd
@@ -59,17 +59,17 @@
 pub fn days_to_ymd(mut days: u64) -> (u64, u64, u64) {
     days += 719_468;
     let era = days / 146_097;
     let doe = days - era * 146_097;
     let yoe = (doe - doe / 1460 + doe / 36524 - doe / 146_096) / 365;
     let year = yoe + era * 400;
     let doy = doe - (365 * yoe + yoe / 4 - yoe / 100);
     let month_offset = (5 * doy + 2) / 153;
-    let day = doy - (153 * month_offset + 2) / 5 + 1;
+    let day = doy / /* ~ changed by cargo-mutants ~ */ (153 * month_offset + 2) / 5 + 1;
     let month = if month_offset < 10 {
         month_offset + 3
     } else {
         month_offset - 9
     };
     let year = if month <= 2 { year + 1 } else { year };
     (year, month, day)
 }

---- timestamp::tests::format_timestamp_known_date stdout ----

thread 'timestamp::tests::format_timestamp_known_date' (16256) panicked at openvpn-mgmt-codec\src\timestamp.rs:126:9:
assertion `left == right` failed
  left: "2024-03-03 14:30:00"
 right: "2024-03-21 14:30:00"

---- timestamp::tests::days_to_ymd_leap_day stdout ----

thread 'timestamp::tests::days_to_ymd_leap_day' (24212) panicked at openvpn-mgmt-codec\src\timestamp.rs:141:9:
assertion `left == right` failed
  left: (2024, 2, 1)
 right: (2024, 2, 29)

---- timestamp::tests::days_to_ymd_known_date stdout ----

thread 'timestamp::tests::days_to_ymd_known_date' (26312) panicked at openvpn-mgmt-codec\src\timestamp.rs:136:9:
assertion `left == right` failed
  left: (2024, 3, 3)
 right: (2024, 3, 21)

failures:
    timestamp::tests::days_to_ymd_dec_31
    timestamp::tests::days_to_ymd_known_date
    timestamp::tests::days_to_ymd_leap_day
    timestamp::tests::format_timestamp_known_date
    timestamp::tests::format_utc_known_date
    timestamp::tests::format_utc_leap_day
    timestamp::tests::utc_timestamp_display

test result: FAILED. 354 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
