*** openvpn-mgmt-codec/src/timestamp.rs:67:41: replace + with * in days_to_ymd

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace + with * in days_to_ymd
@@ -59,17 +59,17 @@
 pub fn days_to_ymd(mut days: u64) -> (u64, u64, u64) {
     days += 719_468;
     let era = days / 146_097;
     let doe = days - era * 146_097;
     let yoe = (doe - doe / 1460 + doe / 36524 - doe / 146_096) / 365;
     let year = yoe + era * 400;
     let doy = doe - (365 * yoe + yoe / 4 - yoe / 100);
     let month_offset = (5 * doy + 2) / 153;
-    let day = doy - (153 * month_offset + 2) / 5 + 1;
+    let day = doy - (153 * month_offset * /* ~ changed by cargo-mutants ~ */ 2) / 5 + 1;
     let month = if month_offset < 10 {
         month_offset + 3
     } else {
         month_offset - 9
     };
     let year = if month <= 2 { year + 1 } else { year };
     (year, month, day)
 }

---- timestamp::tests::days_to_ymd_dec_31 stdout ----

thread 'timestamp::tests::days_to_ymd_dec_31' (21152) panicked at openvpn-mgmt-codec\src\timestamp.rs:67:15:
attempt to subtract with overflow

---- timestamp::tests::days_to_ymd_epoch stdout ----

thread 'timestamp::tests::days_to_ymd_epoch' (2024) panicked at openvpn-mgmt-codec\src\timestamp.rs:67:15:
attempt to subtract with overflow

---- timestamp::tests::days_to_ymd_jan_1_2000 stdout ----

thread 'timestamp::tests::days_to_ymd_jan_1_2000' (48040) panicked at openvpn-mgmt-codec\src\timestamp.rs:67:15:
attempt to subtract with overflow

failures:
    timestamp::tests::days_to_ymd_dec_31
    timestamp::tests::days_to_ymd_epoch
    timestamp::tests::days_to_ymd_jan_1_2000
    timestamp::tests::days_to_ymd_leap_day
    timestamp::tests::format_utc_epoch_plus_one
    timestamp::tests::format_utc_leap_day
    timestamp::tests::format_utc_y2k

test result: FAILED. 354 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
