*** openvpn-mgmt-codec/src/timestamp.rs:68:33: replace < with == in days_to_ymd

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace < with == in days_to_ymd
@@ -60,17 +60,17 @@
     days += 719_468;
     let era = days / 146_097;
     let doe = days - era * 146_097;
     let yoe = (doe - doe / 1460 + doe / 36524 - doe / 146_096) / 365;
     let year = yoe + era * 400;
     let doy = doe - (365 * yoe + yoe / 4 - yoe / 100);
     let month_offset = (5 * doy + 2) / 153;
     let day = doy - (153 * month_offset + 2) / 5 + 1;
-    let month = if month_offset < 10 {
+    let month = if month_offset == /* ~ changed by cargo-mutants ~ */ 10 {
         month_offset + 3
     } else {
         month_offset - 9
     };
     let year = if month <= 2 { year + 1 } else { year };
     (year, month, day)
 }

---- timestamp::tests::days_to_ymd_dec_31 stdout ----

thread 'timestamp::tests::days_to_ymd_dec_31' (41544) panicked at openvpn-mgmt-codec\src\timestamp.rs:146:9:
assertion `left == right` failed
  left: (2024, 0, 31)
 right: (2023, 12, 31)

---- timestamp::tests::days_to_ymd_epoch stdout ----

thread 'timestamp::tests::days_to_ymd_epoch' (41012) panicked at openvpn-mgmt-codec\src\timestamp.rs:131:9:
assertion `left == right` failed
  left: (1969, 13, 1)
 right: (1970, 1, 1)

---- timestamp::tests::days_to_ymd_known_date stdout ----

thread 'timestamp::tests::days_to_ymd_known_date' (29868) panicked at openvpn-mgmt-codec\src\timestamp.rs:71:9:
attempt to subtract with overflow

failures:
    timestamp::tests::days_to_ymd_dec_31
    timestamp::tests::days_to_ymd_epoch
    timestamp::tests::days_to_ymd_jan_1_2000
    timestamp::tests::days_to_ymd_known_date
    timestamp::tests::format_timestamp_known_date
    timestamp::tests::format_utc_epoch_plus_one
    timestamp::tests::format_utc_known_date
    timestamp::tests::format_utc_y2k
    timestamp::tests::utc_timestamp_display

test result: FAILED. 354 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
