*** openvpn-mgmt-codec/src/timestamp.rs:71:22: replace - with / in days_to_ymd

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace - with / in days_to_ymd
@@ -63,17 +63,17 @@
     let yoe = (doe - doe / 1460 + doe / 36524 - doe / 146_096) / 365;
     let year = yoe + era * 400;
     let doy = doe - (365 * yoe + yoe / 4 - yoe / 100);
     let month_offset = (5 * doy + 2) / 153;
     let day = doy - (153 * month_offset + 2) / 5 + 1;
     let month = if month_offset < 10 {
         month_offset + 3
     } else {
-        month_offset - 9
+        month_offset / /* ~ changed by cargo-mutants ~ */ 9
     };
     let year = if month <= 2 { year + 1 } else { year };
     (year, month, day)
 }
 
 /// A Unix timestamp that implements [`Display`](fmt::Display) using
 /// [`format_utc`].
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]

---- timestamp::tests::days_to_ymd_leap_day stdout ----

thread 'timestamp::tests::days_to_ymd_leap_day' (800) panicked at openvpn-mgmt-codec\src\timestamp.rs:141:9:
assertion `left == right` failed
  left: (2024, 1, 29)
 right: (2024, 2, 29)

---- timestamp::tests::format_utc_leap_day stdout ----

thread 'timestamp::tests::format_utc_leap_day' (44424) panicked at openvpn-mgmt-codec\src\timestamp.rs:121:9:
assertion `left == right` failed
  left: "2024-01-29T12:00:00Z"
 right: "2024-02-29T12:00:00Z"

failures:
    timestamp::tests::days_to_ymd_leap_day
    timestamp::tests::format_utc_leap_day

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
