*** openvpn-mgmt-codec/src/timestamp.rs:73:37: replace + with * in days_to_ymd

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace + with * in days_to_ymd
@@ -65,17 +65,17 @@
     let doy = doe - (365 * yoe + yoe / 4 - yoe / 100);
     let month_offset = (5 * doy + 2) / 153;
     let day = doy - (153 * month_offset + 2) / 5 + 1;
     let month = if month_offset < 10 {
         month_offset + 3
     } else {
         month_offset - 9
     };
-    let year = if month <= 2 { year + 1 } else { year };
+    let year = if month <= 2 { year * /* ~ changed by cargo-mutants ~ */ 1 } else { year };
     (year, month, day)
 }
 
 /// A Unix timestamp that implements [`Display`](fmt::Display) using
 /// [`format_utc`].
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct UtcTimestamp(pub u64);

---- timestamp::tests::days_to_ymd_epoch stdout ----

thread 'timestamp::tests::days_to_ymd_epoch' (5252) panicked at openvpn-mgmt-codec\src\timestamp.rs:131:9:
assertion `left == right` failed
  left: (1969, 1, 1)
 right: (1970, 1, 1)

---- timestamp::tests::days_to_ymd_jan_1_2000 stdout ----

thread 'timestamp::tests::days_to_ymd_jan_1_2000' (2816) panicked at openvpn-mgmt-codec\src\timestamp.rs:151:9:
assertion `left == right` failed
  left: (1999, 1, 1)
 right: (2000, 1, 1)

---- timestamp::tests::days_to_ymd_leap_day stdout ----

thread 'timestamp::tests::days_to_ymd_leap_day' (10560) panicked at openvpn-mgmt-codec\src\timestamp.rs:141:9:
assertion `left == right` failed
  left: (2023, 2, 29)
 right: (2024, 2, 29)

failures:
    timestamp::tests::days_to_ymd_epoch
    timestamp::tests::days_to_ymd_jan_1_2000
    timestamp::tests::days_to_ymd_leap_day
    timestamp::tests::format_utc_epoch_plus_one
    timestamp::tests::format_utc_leap_day
    timestamp::tests::format_utc_y2k

test result: FAILED. 355 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
