*** openvpn-mgmt-codec/src/timestamp.rs:84:19: replace == with != in <impl fmt::Display for UtcTimestamp>::fmt

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace == with != in <impl fmt::Display for UtcTimestamp>::fmt
@@ -76,17 +76,17 @@
 
 /// A Unix timestamp that implements [`Display`](fmt::Display) using
 /// [`format_utc`].
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct UtcTimestamp(pub u64);
 
 impl fmt::Display for UtcTimestamp {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        if self.0 == 0 {
+        if self.0 != /* ~ changed by cargo-mutants ~ */ 0 {
             return Ok(());
         }
         let (year, month, day, hours, mins, secs) = decompose(self.0);
         write!(
             f,
             "{year:04}-{month:02}-{day:02}T{hours:02}:{mins:02}:{secs:02}Z"
         )
     }

---- timestamp::tests::utc_timestamp_display stdout ----

thread 'timestamp::tests::utc_timestamp_display' (27408) panicked at openvpn-mgmt-codec\src\timestamp.rs:156:9:
assertion `left == right` failed
  left: ""
 right: "2024-03-21T14:30:00Z"

failures:
    timestamp::tests::utc_timestamp_display

test result: FAILED. 362 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
