*** openvpn-mgmt-codec/src/timestamp.rs:84:9: replace <impl fmt::Display for UtcTimestamp>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- openvpn-mgmt-codec/src/timestamp.rs
+++ replace <impl fmt::Display for UtcTimestamp>::fmt -> fmt::Result with Ok(Default::default())
@@ -76,24 +76,17 @@
 
 /// A Unix timestamp that implements [`Display`](fmt::Display) using
 /// [`format_utc`].
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct UtcTimestamp(pub u64);
 
 impl fmt::Display for UtcTimestamp {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        if self.0 == 0 {
-            return Ok(());
-        }
-        let (year, month, day, hours, mins, secs) = decompose(self.0);
-        write!(
-            f,
-            "{year:04}-{month:02}-{day:02}T{hours:02}:{mins:02}:{secs:02}Z"
-        )
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- timestamp::tests::utc_timestamp_display stdout ----

thread 'timestamp::tests::utc_timestamp_display' (5608) panicked at openvpn-mgmt-codec\src\timestamp.rs:149:9:
assertion `left == right` failed
  left: ""
 right: "2024-03-21T14:30:00Z"

failures:
    timestamp::tests::utc_timestamp_display

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
