*** openvpn-mgmt-codec/src/version_info.rs:101:9: replace VersionInfo::raw_lines -> &[String] with Vec::leak(Vec::new())

*** mutation diff:
--- openvpn-mgmt-codec/src/version_info.rs
+++ replace VersionInfo::raw_lines -> &[String] with Vec::leak(Vec::new())
@@ -93,17 +93,17 @@
 
     /// The full `OpenVPN Version:` line (e.g. `"OpenVPN Version: OpenVPN 2.6.9 ..."`).
     pub fn openvpn_version_line(&self) -> Option<&str> {
         self.openvpn_version_line.as_deref()
     }
 
     /// All raw lines from the response, for anything not explicitly parsed.
     pub fn raw_lines(&self) -> &[String] {
-        &self.raw_lines
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- version_info::tests::parse_typical_version_output stdout ----

thread 'version_info::tests::parse_typical_version_output' (42148) panicked at openvpn-mgmt-codec\src\version_info.rs:118:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    version_info::tests::parse_typical_version_output

test result: FAILED. 360 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
