*** openvpn-mgmt-codec/src/version_info.rs:101:9: replace VersionInfo::raw_lines -> &[String] with Vec::leak(vec!["xyzzy".into()])

*** mutation diff:
--- openvpn-mgmt-codec/src/version_info.rs
+++ replace VersionInfo::raw_lines -> &[String] with Vec::leak(vec!["xyzzy".into()])
@@ -93,17 +93,17 @@
 
     /// The full `OpenVPN Version:` line (e.g. `"OpenVPN Version: OpenVPN 2.6.9 ..."`).
     pub fn openvpn_version_line(&self) -> Option<&str> {
         self.openvpn_version_line.as_deref()
     }
 
     /// All raw lines from the response, for anything not explicitly parsed.
     pub fn raw_lines(&self) -> &[String] {
-        &self.raw_lines
+        Vec::leak(vec!["xyzzy".into()]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- version_info::tests::parse_empty_response stdout ----

thread 'version_info::tests::parse_empty_response' (38496) panicked at openvpn-mgmt-codec\src\version_info.rs:146:9:
assertion failed: info.raw_lines().is_empty()

---- version_info::tests::parse_typical_version_output stdout ----

thread 'version_info::tests::parse_typical_version_output' (43460) panicked at openvpn-mgmt-codec\src\version_info.rs:118:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    version_info::tests::parse_empty_response
    version_info::tests::parse_typical_version_output

test result: FAILED. 359 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
