*** openvpn-mgmt-codec/src/version_info.rs:60:17: replace && with || in VersionInfo::parse

*** mutation diff:
--- openvpn-mgmt-codec/src/version_info.rs
+++ replace && with || in VersionInfo::parse
@@ -52,17 +52,17 @@
 
             // Match the management version line regardless of exact
             // wording. Known variants:
             //   "Management Interface Version: 5"  (OpenVPN ≤ 2.6.9)
             //   "Management Version: 5"            (OpenVPN ≥ 2.6.16)
             // Future-proof: accept any line starting with "management"
             // that contains "version" followed by a number.
             if management_version.is_none()
-                && lower.starts_with("management")
+                || /* ~ changed by cargo-mutants ~ */ lower.starts_with("management")
                 && lower.contains("version")
             {
                 management_version = line
                     .rsplit(|chr: char| !chr.is_ascii_digit())
                     .find(|part| !part.is_empty())
                     .and_then(|part| {
                         part.parse()
                             .inspect_err(|error| {

---- version_info::tests::parse_short_management_version_header stdout ----

thread 'version_info::tests::parse_short_management_version_header' (41672) panicked at openvpn-mgmt-codec\src\version_info.rs:130:45:
called `Option::unwrap()` on a `None` value

---- version_info::tests::parse_old_version_without_management_line stdout ----

thread 'version_info::tests::parse_old_version_without_management_line' (35008) panicked at openvpn-mgmt-codec\src\version_info.rs:137:9:
assertion `left == right` failed
  left: Some(686)
 right: None

---- version_info::tests::parse_typical_version_output stdout ----

thread 'version_info::tests::parse_typical_version_output' (32396) panicked at openvpn-mgmt-codec\src\version_info.rs:117:45:
called `Option::unwrap()` on a `None` value

failures:
    version_info::tests::parse_old_version_without_management_line
    version_info::tests::parse_short_management_version_header
    version_info::tests::parse_typical_version_output

test result: FAILED. 358 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
