*** openvpn-mgmt-codec/src/version_info.rs:64:41: delete ! in VersionInfo::parse

*** mutation diff:
--- openvpn-mgmt-codec/src/version_info.rs
+++ delete ! in VersionInfo::parse
@@ -56,17 +56,17 @@
             //   "Management Version: 5"            (OpenVPN ≥ 2.6.16)
             // Future-proof: accept any line starting with "management"
             // that contains "version" followed by a number.
             if management_version.is_none()
                 && lower.starts_with("management")
                 && lower.contains("version")
             {
                 management_version = line
-                    .rsplit(|chr: char| !chr.is_ascii_digit())
+                    .rsplit(|chr: char|  /* ~ changed by cargo-mutants ~ */chr.is_ascii_digit())
                     .find(|part| !part.is_empty())
                     .and_then(|part| {
                         part.parse()
                             .inspect_err(|error| {
                                 tracing::warn!(%error, part, "non-numeric management version")
                             })
                             .ok()
                     });

---- parsed_response::tests::version_roundtrip stdout ----
2026-03-29T11:28:50.571412Z  WARN openvpn_mgmt_codec::version_info: non-numeric management version error=invalid digit found in string part="Management Interface Version: "

thread 'parsed_response::tests::version_roundtrip' (31292) panicked at openvpn-mgmt-codec\src\parsed_response.rs:508:9:
assertion `left == right` failed
  left: None
 right: Some(4)

---- version_info::tests::parse_hypothetical_future_format stdout ----
2026-03-29T11:28:50.579078Z  WARN openvpn_mgmt_codec::version_info: non-numeric management version error=invalid digit found in string part="Management Protocol Version: "

thread 'version_info::tests::parse_hypothetical_future_format' (29888) panicked at openvpn-mgmt-codec\src\version_info.rs:155:9:
assertion `left == right` failed
  left: None
 right: Some(6)

---- version_info::tests::parse_short_management_version_header stdout ----
2026-03-29T11:28:50.579322Z  WARN openvpn_mgmt_codec::version_info: non-numeric management version error=invalid digit found in string part="Management Version: "

thread 'version_info::tests::parse_short_management_version_header' (47312) panicked at openvpn-mgmt-codec\src\version_info.rs:129:9:
assertion `left == right` failed
  left: None
 right: Some(5)

failures:
    parsed_response::tests::version_roundtrip
    version_info::tests::parse_hypothetical_future_format
    version_info::tests::parse_short_management_version_header
    version_info::tests::parse_typical_version_output

test result: FAILED. 359 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
