*** openvpn-mgmt-codec/src/version_info.rs:65:34: delete ! in VersionInfo::parse

*** mutation diff:
--- openvpn-mgmt-codec/src/version_info.rs
+++ delete ! in VersionInfo::parse
@@ -57,17 +57,17 @@
             // Future-proof: accept any line starting with "management"
             // that contains "version" followed by a number.
             if management_version.is_none()
                 && lower.starts_with("management")
                 && lower.contains("version")
             {
                 management_version = line
                     .rsplit(|chr: char| !chr.is_ascii_digit())
-                    .find(|part| !part.is_empty())
+                    .find(|part|  /* ~ changed by cargo-mutants ~ */part.is_empty())
                     .and_then(|part| {
                         part.parse()
                             .inspect_err(|error| {
                                 tracing::warn!(%error, part, "non-numeric management version")
                             })
                             .ok()
                     });
             } else if lower.starts_with("openvpn version") {

---- parsed_response::tests::version_roundtrip stdout ----
2026-03-29T11:28:53.087506Z  WARN openvpn_mgmt_codec::version_info: non-numeric management version error=cannot parse integer from empty string part=""

thread 'parsed_response::tests::version_roundtrip' (26920) panicked at openvpn-mgmt-codec\src\parsed_response.rs:508:9:
assertion `left == right` failed
  left: None
 right: Some(4)

---- version_info::tests::parse_hypothetical_future_format stdout ----
2026-03-29T11:28:53.096007Z  WARN openvpn_mgmt_codec::version_info: non-numeric management version error=cannot parse integer from empty string part=""

thread 'version_info::tests::parse_hypothetical_future_format' (25156) panicked at openvpn-mgmt-codec\src\version_info.rs:155:9:
assertion `left == right` failed
  left: None
 right: Some(6)

---- version_info::tests::parse_short_management_version_header stdout ----
2026-03-29T11:28:53.096225Z  WARN openvpn_mgmt_codec::version_info: non-numeric management version error=cannot parse integer from empty string part=""

thread 'version_info::tests::parse_short_management_version_header' (24672) panicked at openvpn-mgmt-codec\src\version_info.rs:129:9:
assertion `left == right` failed
  left: None
 right: Some(5)

failures:
    parsed_response::tests::version_roundtrip
    version_info::tests::parse_hypothetical_future_format
    version_info::tests::parse_short_management_version_header
    version_info::tests::parse_typical_version_output

test result: FAILED. 359 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
