*** openvpn-mgmt-codec/src/version_info.rs:91:9: replace VersionInfo::management_version -> Option<u32> with None

*** mutation diff:
--- openvpn-mgmt-codec/src/version_info.rs
+++ replace VersionInfo::management_version -> Option<u32> with None
@@ -83,17 +83,17 @@
     }
 
     /// The management interface protocol version (e.g. `5`).
     ///
     /// Returns `None` if the line was missing or unparseable. Use this to
     /// gate features: for instance, `client-pending-auth` requires
     /// management version >= 5 (OpenVPN 2.5+).
     pub fn management_version(&self) -> Option<u32> {
-        self.management_version
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// The full `OpenVPN Version:` line (e.g. `"OpenVPN Version: OpenVPN 2.6.9 ..."`).
     pub fn openvpn_version_line(&self) -> Option<&str> {
         self.openvpn_version_line.as_deref()
     }
 
     /// All raw lines from the response, for anything not explicitly parsed.

---- parsed_response::tests::version_roundtrip stdout ----

thread 'parsed_response::tests::version_roundtrip' (13708) panicked at openvpn-mgmt-codec\src\parsed_response.rs:508:9:
assertion `left == right` failed
  left: None
 right: Some(4)

---- version_info::tests::parse_hypothetical_future_format stdout ----

thread 'version_info::tests::parse_hypothetical_future_format' (46792) panicked at openvpn-mgmt-codec\src\version_info.rs:155:9:
assertion `left == right` failed
  left: None
 right: Some(6)

---- version_info::tests::parse_short_management_version_header stdout ----

thread 'version_info::tests::parse_short_management_version_header' (13724) panicked at openvpn-mgmt-codec\src\version_info.rs:129:9:
assertion `left == right` failed
  left: None
 right: Some(5)

failures:
    parsed_response::tests::version_roundtrip
    version_info::tests::parse_hypothetical_future_format
    version_info::tests::parse_short_management_version_header
    version_info::tests::parse_typical_version_output

test result: FAILED. 357 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
