*** openvpn-mgmt-codec/src/version_info.rs:96:9: replace VersionInfo::openvpn_version_line -> Option<&str> with None

*** mutation diff:
--- openvpn-mgmt-codec/src/version_info.rs
+++ replace VersionInfo::openvpn_version_line -> Option<&str> with None
@@ -88,17 +88,17 @@
     /// gate features: for instance, `client-pending-auth` requires
     /// management version >= 5 (OpenVPN 2.5+).
     pub fn management_version(&self) -> Option<u32> {
         self.management_version
     }
 
     /// The full `OpenVPN Version:` line (e.g. `"OpenVPN Version: OpenVPN 2.6.9 ..."`).
     pub fn openvpn_version_line(&self) -> Option<&str> {
-        self.openvpn_version_line.as_deref()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// All raw lines from the response, for anything not explicitly parsed.
     pub fn raw_lines(&self) -> &[String] {
         &self.raw_lines
     }
 }

---- version_info::tests::parse_old_version_without_management_line stdout ----

thread 'version_info::tests::parse_old_version_without_management_line' (31444) panicked at openvpn-mgmt-codec\src\version_info.rs:138:9:
assertion failed: info.openvpn_version_line().is_some()

---- version_info::tests::parse_short_management_version_header stdout ----

thread 'version_info::tests::parse_short_management_version_header' (30060) panicked at openvpn-mgmt-codec\src\version_info.rs:130:45:
called `Option::unwrap()` on a `None` value

---- version_info::tests::parse_typical_version_output stdout ----

thread 'version_info::tests::parse_typical_version_output' (46260) panicked at openvpn-mgmt-codec\src\version_info.rs:117:45:
called `Option::unwrap()` on a `None` value

failures:
    version_info::tests::parse_old_version_without_management_line
    version_info::tests::parse_short_management_version_header
    version_info::tests::parse_typical_version_output

test result: FAILED. 360 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
