*** openvpn-mgmt-codec/src/version_info.rs:96:9: replace VersionInfo::openvpn_version_line -> Option<&str> with Some("xyzzy")

*** mutation diff:
--- openvpn-mgmt-codec/src/version_info.rs
+++ replace VersionInfo::openvpn_version_line -> Option<&str> with Some("xyzzy")
@@ -88,17 +88,17 @@
     /// gate features: for instance, `client-pending-auth` requires
     /// management version >= 5 (OpenVPN 2.5+).
     pub fn management_version(&self) -> Option<u32> {
         self.management_version
     }
 
     /// The full `OpenVPN Version:` line (e.g. `"OpenVPN Version: OpenVPN 2.6.9 ..."`).
     pub fn openvpn_version_line(&self) -> Option<&str> {
-        self.openvpn_version_line.as_deref()
+        Some("xyzzy") /* ~ changed by cargo-mutants ~ */
     }
 
     /// All raw lines from the response, for anything not explicitly parsed.
     pub fn raw_lines(&self) -> &[String] {
         &self.raw_lines
     }
 }

---- version_info::tests::parse_empty_response stdout ----

thread 'version_info::tests::parse_empty_response' (22448) panicked at openvpn-mgmt-codec\src\version_info.rs:145:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: None

---- version_info::tests::parse_short_management_version_header stdout ----

thread 'version_info::tests::parse_short_management_version_header' (18440) panicked at openvpn-mgmt-codec\src\version_info.rs:130:9:
assertion failed: info.openvpn_version_line().unwrap().contains("2.6.16")

---- version_info::tests::parse_typical_version_output stdout ----

thread 'version_info::tests::parse_typical_version_output' (24312) panicked at openvpn-mgmt-codec\src\version_info.rs:117:9:
assertion failed: info.openvpn_version_line().unwrap().contains("2.6.9")

failures:
    version_info::tests::parse_empty_response
    version_info::tests::parse_short_management_version_header
    version_info::tests::parse_typical_version_output

test result: FAILED. 360 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
