*** openvpn-mgmt-ui/src/chart.rs:103:31: replace >= with < in ThroughputHistory::push

*** mutation diff:
--- openvpn-mgmt-ui/src/chart.rs
+++ replace >= with < in ThroughputHistory::push
@@ -95,17 +95,17 @@
         let elapsed = interval_secs.max(1) as f64;
         let sample = Sample {
             in_bps: bytes_in.saturating_sub(self.prev_in) as f64 / elapsed,
             out_bps: bytes_out.saturating_sub(self.prev_out) as f64 / elapsed,
         };
         self.prev_in = bytes_in;
         self.prev_out = bytes_out;
 
-        if self.samples.len() >= MAX_SAMPLES {
+        if self.samples.len() < /* ~ changed by cargo-mutants ~ */ MAX_SAMPLES {
             self.samples.pop_front();
         }
         self.samples.push_back(sample);
     }
 
     pub(crate) fn samples(&self) -> &VecDeque<Sample> {
         &self.samples
     }

---- chart::tests::push_caps_at_max_samples stdout ----

thread 'chart::tests::push_caps_at_max_samples' (35948) panicked at openvpn-mgmt-ui\src\chart.rs:311:9:
assertion `left == right` failed
  left: 1
 right: 60

failures:
    chart::tests::push_caps_at_max_samples

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
