*** openvpn-mgmt-ui/src/chart.rs:110:9: replace ThroughputHistory::samples -> &VecDeque<Sample> with Box::leak(Box::new(VecDeque::new()))

*** mutation diff:
--- openvpn-mgmt-ui/src/chart.rs
+++ replace ThroughputHistory::samples -> &VecDeque<Sample> with Box::leak(Box::new(VecDeque::new()))
@@ -102,17 +102,17 @@
 
         if self.samples.len() >= MAX_SAMPLES {
             self.samples.pop_front();
         }
         self.samples.push_back(sample);
     }
 
     pub(crate) fn samples(&self) -> &VecDeque<Sample> {
-        &self.samples
+        Box::leak(Box::new(VecDeque::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn reset(&mut self) {
         *self = Self::default();
     }
 }
 
 // -------------------------------------------------------------------

---- chart::tests::push_caps_at_max_samples stdout ----

thread 'chart::tests::push_caps_at_max_samples' (42020) panicked at openvpn-mgmt-ui\src\chart.rs:311:9:
assertion `left == right` failed
  left: 0
 right: 60

---- chart::tests::push_second_sample_produces_one_point stdout ----

thread 'chart::tests::push_second_sample_produces_one_point' (592) panicked at openvpn-mgmt-ui\src\chart.rs:298:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    chart::tests::push_caps_at_max_samples
    chart::tests::push_second_sample_produces_one_point

test result: FAILED. 22 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
