*** openvpn-mgmt-ui/src/chart.rs:110:9: replace ThroughputHistory::samples -> &VecDeque<Sample> with Box::leak(Box::new(VecDeque::from_iter([Default::default()])))

*** mutation diff:
--- openvpn-mgmt-ui/src/chart.rs
+++ replace ThroughputHistory::samples -> &VecDeque<Sample> with Box::leak(Box::new(VecDeque::from_iter([Default::default()])))
@@ -102,17 +102,17 @@
 
         if self.samples.len() >= MAX_SAMPLES {
             self.samples.pop_front();
         }
         self.samples.push_back(sample);
     }
 
     pub(crate) fn samples(&self) -> &VecDeque<Sample> {
-        &self.samples
+        Box::leak(Box::new(VecDeque::from_iter([Default::default()]))) /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn reset(&mut self) {
         *self = Self::default();
     }
 }
 
 // -------------------------------------------------------------------

---- chart::tests::push_caps_at_max_samples stdout ----

thread 'chart::tests::push_caps_at_max_samples' (31904) panicked at openvpn-mgmt-ui\src\chart.rs:311:9:
assertion `left == right` failed
  left: 1
 right: 60

---- chart::tests::push_second_sample_produces_one_point stdout ----

thread 'chart::tests::push_second_sample_produces_one_point' (7668) panicked at openvpn-mgmt-ui\src\chart.rs:300:9:
assertion failed: (sample.in_bps - 1000.0).abs() < f64::EPSILON

---- chart::tests::push_first_sample_seeds_but_produces_no_data stdout ----

thread 'chart::tests::push_first_sample_seeds_but_produces_no_data' (34556) panicked at openvpn-mgmt-ui\src\chart.rs:290:9:
assertion failed: h.samples().is_empty()

failures:
    chart::tests::push_caps_at_max_samples
    chart::tests::push_first_sample_seeds_but_produces_no_data
    chart::tests::push_second_sample_produces_one_point
    chart::tests::reset_clears_all_state

test result: FAILED. 20 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
