*** openvpn-mgmt-ui/src/chart.rs:114:9: replace ThroughputHistory::reset with ()

*** mutation diff:
--- openvpn-mgmt-ui/src/chart.rs
+++ replace ThroughputHistory::reset with ()
@@ -106,17 +106,17 @@
         self.samples.push_back(sample);
     }
 
     pub(crate) fn samples(&self) -> &VecDeque<Sample> {
         &self.samples
     }
 
     pub(crate) fn reset(&mut self) {
-        *self = Self::default();
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // -------------------------------------------------------------------
 // Chart implementation
 // -------------------------------------------------------------------
 
 /// Wrapper that implements `plotters_iced2::Chart` for the throughput data.

---- chart::tests::reset_clears_all_state stdout ----

thread 'chart::tests::reset_clears_all_state' (28292) panicked at openvpn-mgmt-ui\src\chart.rs:320:9:
assertion failed: h.samples().is_empty()

failures:
    chart::tests::reset_clears_all_state

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
