*** openvpn-mgmt-ui/src/chart.rs:146:9: replace <impl Chart<Message> for ThroughputChart<'_>>::draw_chart with ()

*** mutation diff:
--- openvpn-mgmt-ui/src/chart.rs
+++ replace <impl Chart<Message> for ThroughputChart<'_>>::draw_chart with ()
@@ -138,91 +138,17 @@
         // We use draw_chart for full control.
     }
 
     fn draw_chart<DB: DrawingBackend>(
         &self,
         _state: &Self::State,
         root: DrawingArea<DB, plotters::coord::Shift>,
     ) {
-        let ChartPalette {
-            background,
-            fg_muted,
-            green,
-            blue,
-            grid,
-        } = self.palette;
-
-        root.fill(&background)
-            .inspect_err(|error| tracing::warn!(%error, "chart: failed to fill background"))
-            .ok();
-
-        let samples = self.history.samples();
-        let count = samples.len();
-
-        // Determine y-axis max (auto-scale with a floor).
-        let y_max = samples
-            .iter()
-            .map(|sample| sample.in_bps.max(sample.out_bps))
-            .fold(1024.0_f64, f64::max)
-            * 1.15;
-
-        let x_range = 0.0..(MAX_SAMPLES as f64);
-        let y_range = 0.0..y_max;
-
-        let mut chart = ChartBuilder::on(&root)
-            .margin(4)
-            .margin_right(8)
-            .x_label_area_size(0)
-            .y_label_area_size(42)
-            .build_cartesian_2d(x_range, y_range);
-
-        if let Ok(ref mut chart) = chart {
-            chart
-                .configure_mesh()
-                .disable_x_mesh()
-                .disable_x_axis()
-                .y_labels(2)
-                .y_label_formatter(&|rate| format_rate(*rate))
-                .label_style(TextStyle::from(("monospace", 10).into_font()).color(&fg_muted))
-                .axis_style(fg_muted)
-                .light_line_style(grid)
-                .draw()
-                .inspect_err(|error| tracing::warn!(%error, "chart: failed to draw mesh"))
-                .ok();
-
-            // Offset so the latest sample is at the right edge.
-            let offset = MAX_SAMPLES.saturating_sub(count) as f64;
-
-            // Download (in) — green
-            chart
-                .draw_series(LineSeries::new(
-                    samples
-                        .iter()
-                        .enumerate()
-                        .map(|(i, s)| (i as f64 + offset, s.in_bps)),
-                    green.stroke_width(2),
-                ))
-                .inspect_err(
-                    |error| tracing::warn!(%error, "chart: failed to draw download series"),
-                )
-                .ok();
-
-            // Upload (out) — blue
-            chart
-                .draw_series(LineSeries::new(
-                    samples
-                        .iter()
-                        .enumerate()
-                        .map(|(i, s)| (i as f64 + offset, s.out_bps)),
-                    blue.stroke_width(2),
-                ))
-                .inspect_err(|error| tracing::warn!(%error, "chart: failed to draw upload series"))
-                .ok();
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Format bytes/sec in a compact human-readable form (public variant).
 pub(crate) fn format_rate_public(bps: f64) -> String {
     format_rate(bps)
 }

*** result: Success
