*** openvpn-mgmt-ui/src/chart.rs:226:5: replace format_rate_public -> String with String::new()

*** mutation diff:
--- openvpn-mgmt-ui/src/chart.rs
+++ replace format_rate_public -> String with String::new()
@@ -218,17 +218,17 @@
                 .inspect_err(|error| tracing::warn!(%error, "chart: failed to draw upload series"))
                 .ok();
         }
     }
 }
 
 /// Format bytes/sec in a compact human-readable form (public variant).
 pub(crate) fn format_rate_public(bps: f64) -> String {
-    format_rate(bps)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Format bytes/sec in a compact human-readable form for axis labels.
 fn format_rate(bps: f64) -> String {
     const KIB: f64 = 1024.0;
     const MIB: f64 = 1024.0 * KIB;
 
     if bps >= MIB {

*** result: Success
