*** openvpn-mgmt-ui/src/chart.rs:231:5: replace format_rate -> String with String::new()

*** mutation diff:
--- openvpn-mgmt-ui/src/chart.rs
+++ replace format_rate -> String with String::new()
@@ -223,26 +223,17 @@
 
 /// Format bytes/sec in a compact human-readable form (public variant).
 pub(crate) fn format_rate_public(bps: f64) -> String {
     format_rate(bps)
 }
 
 /// Format bytes/sec in a compact human-readable form for axis labels.
 fn format_rate(bps: f64) -> String {
-    const KIB: f64 = 1024.0;
-    const MIB: f64 = 1024.0 * KIB;
-
-    if bps >= MIB {
-        format!("{:.0}M", bps / MIB)
-    } else if bps >= KIB {
-        format!("{:.0}K", bps / KIB)
-    } else {
-        format!("{:.0}B", bps)
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Create a chart widget element for the throughput history with a custom height.
 pub(crate) fn throughput_chart_sized(
     history: &ThroughputHistory,
     height: f32,
     palette: ChartPalette,
 ) -> Element<'_, Message> {

---- chart::tests::format_rate_kib stdout ----

thread 'chart::tests::format_rate_kib' (24720) panicked at openvpn-mgmt-ui\src\chart.rs:265:9:
assertion `left == right` failed
  left: ""
 right: "1K"

---- chart::tests::format_rate_bytes stdout ----

thread 'chart::tests::format_rate_bytes' (28212) panicked at openvpn-mgmt-ui\src\chart.rs:258:9:
assertion `left == right` failed
  left: ""
 right: "0B"

---- chart::tests::format_rate_mib stdout ----

thread 'chart::tests::format_rate_mib' (5668) panicked at openvpn-mgmt-ui\src\chart.rs:271:9:
assertion `left == right` failed
  left: ""
 right: "1M"

failures:
    chart::tests::format_rate_bytes
    chart::tests::format_rate_kib
    chart::tests::format_rate_mib

test result: FAILED. 21 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
