*** openvpn-mgmt-ui/src/chart.rs:232:29: replace * with + in format_rate

*** mutation diff:
--- openvpn-mgmt-ui/src/chart.rs
+++ replace * with + in format_rate
@@ -224,17 +224,17 @@
 /// Format bytes/sec in a compact human-readable form (public variant).
 pub(crate) fn format_rate_public(bps: f64) -> String {
     format_rate(bps)
 }
 
 /// Format bytes/sec in a compact human-readable form for axis labels.
 fn format_rate(bps: f64) -> String {
     const KIB: f64 = 1024.0;
-    const MIB: f64 = 1024.0 * KIB;
+    const MIB: f64 = 1024.0 + /* ~ changed by cargo-mutants ~ */ KIB;
 
     if bps >= MIB {
         format!("{:.0}M", bps / MIB)
     } else if bps >= KIB {
         format!("{:.0}K", bps / KIB)
     } else {
         format!("{:.0}B", bps)
     }

---- chart::tests::format_rate_kib stdout ----

thread 'chart::tests::format_rate_kib' (36304) panicked at openvpn-mgmt-ui\src\chart.rs:275:9:
assertion `left == right` failed
  left: "256M"
 right: "512K"

---- chart::tests::format_rate_mib stdout ----

thread 'chart::tests::format_rate_mib' (20344) panicked at openvpn-mgmt-ui\src\chart.rs:280:9:
assertion `left == right` failed
  left: "512M"
 right: "1M"

failures:
    chart::tests::format_rate_kib
    chart::tests::format_rate_mib

test result: FAILED. 22 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
