*** openvpn-mgmt-ui/src/chart.rs:234:12: replace >= with < in format_rate

*** mutation diff:
--- openvpn-mgmt-ui/src/chart.rs
+++ replace >= with < in format_rate
@@ -226,17 +226,17 @@
     format_rate(bps)
 }
 
 /// Format bytes/sec in a compact human-readable form for axis labels.
 fn format_rate(bps: f64) -> String {
     const KIB: f64 = 1024.0;
     const MIB: f64 = 1024.0 * KIB;
 
-    if bps >= MIB {
+    if bps < /* ~ changed by cargo-mutants ~ */ MIB {
         format!("{:.0}M", bps / MIB)
     } else if bps >= KIB {
         format!("{:.0}K", bps / KIB)
     } else {
         format!("{:.0}B", bps)
     }
 }

---- chart::tests::format_rate_kib stdout ----

thread 'chart::tests::format_rate_kib' (39284) panicked at openvpn-mgmt-ui\src\chart.rs:274:9:
assertion `left == right` failed
  left: "0M"
 right: "1K"

---- chart::tests::format_rate_mib stdout ----

thread 'chart::tests::format_rate_mib' (36964) panicked at openvpn-mgmt-ui\src\chart.rs:280:9:
assertion `left == right` failed
  left: "1024K"
 right: "1M"

---- chart::tests::format_rate_bytes stdout ----

thread 'chart::tests::format_rate_bytes' (1552) panicked at openvpn-mgmt-ui\src\chart.rs:267:9:
assertion `left == right` failed
  left: "0M"
 right: "0B"

failures:
    chart::tests::format_rate_bytes
    chart::tests::format_rate_kib
    chart::tests::format_rate_mib

test result: FAILED. 21 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
