*** openvpn-mgmt-ui/src/chart.rs:236:19: replace >= with < in format_rate

*** mutation diff:
--- openvpn-mgmt-ui/src/chart.rs
+++ replace >= with < in format_rate
@@ -228,17 +228,17 @@
 
 /// Format bytes/sec in a compact human-readable form for axis labels.
 fn format_rate(bps: f64) -> String {
     const KIB: f64 = 1024.0;
     const MIB: f64 = 1024.0 * KIB;
 
     if bps >= MIB {
         format!("{:.0}M", bps / MIB)
-    } else if bps >= KIB {
+    } else if bps < /* ~ changed by cargo-mutants ~ */ KIB {
         format!("{:.0}K", bps / KIB)
     } else {
         format!("{:.0}B", bps)
     }
 }
 
 /// Create a chart widget element for the throughput history with a custom height.
 pub(crate) fn throughput_chart_sized(

---- chart::tests::format_rate_kib stdout ----

thread 'chart::tests::format_rate_kib' (7960) panicked at openvpn-mgmt-ui\src\chart.rs:274:9:
assertion `left == right` failed
  left: "1024B"
 right: "1K"

---- chart::tests::format_rate_bytes stdout ----

thread 'chart::tests::format_rate_bytes' (7316) panicked at openvpn-mgmt-ui\src\chart.rs:267:9:
assertion `left == right` failed
  left: "0K"
 right: "0B"

failures:
    chart::tests::format_rate_bytes
    chart::tests::format_rate_kib

test result: FAILED. 22 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
