*** openvpn-mgmt-ui/src/chart.rs:88:12: delete ! in ThroughputHistory::push

*** mutation diff:
--- openvpn-mgmt-ui/src/chart.rs
+++ delete ! in ThroughputHistory::push
@@ -80,17 +80,17 @@
 }
 
 impl ThroughputHistory {
     /// Feed a new cumulative byte-count reading.
     ///
     /// `interval` is the configured bytecount interval in seconds (used to
     /// convert the delta into bytes/sec).
     pub(crate) fn push(&mut self, bytes_in: u64, bytes_out: u64, interval_secs: u32) {
-        if !self.seeded {
+        if  /* ~ changed by cargo-mutants ~ */self.seeded {
             self.prev_in = bytes_in;
             self.prev_out = bytes_out;
             self.seeded = true;
             return;
         }
 
         let elapsed = interval_secs.max(1) as f64;
         let sample = Sample {

---- chart::tests::push_second_sample_produces_one_point stdout ----

thread 'chart::tests::push_second_sample_produces_one_point' (42240) panicked at openvpn-mgmt-ui\src\chart.rs:298:9:
assertion `left == right` failed
  left: 2
 right: 1

---- chart::tests::push_first_sample_seeds_but_produces_no_data stdout ----

thread 'chart::tests::push_first_sample_seeds_but_produces_no_data' (21220) panicked at openvpn-mgmt-ui\src\chart.rs:290:9:
assertion failed: h.samples().is_empty()

---- chart::tests::reset_clears_all_state stdout ----

thread 'chart::tests::reset_clears_all_state' (43676) panicked at openvpn-mgmt-ui\src\chart.rs:323:9:
assertion failed: h.samples().is_empty()

failures:
    chart::tests::push_first_sample_seeds_but_produces_no_data
    chart::tests::push_second_sample_produces_one_point
    chart::tests::reset_clears_all_state

test result: FAILED. 21 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
