*** openvpn-mgmt-ui/src/chart.rs:88:9: replace ThroughputHistory::push with ()

*** mutation diff:
--- openvpn-mgmt-ui/src/chart.rs
+++ replace ThroughputHistory::push with ()
@@ -80,35 +80,17 @@
 }
 
 impl ThroughputHistory {
     /// Feed a new cumulative byte-count reading.
     ///
     /// `interval` is the configured bytecount interval in seconds (used to
     /// convert the delta into bytes/sec).
     pub(crate) fn push(&mut self, bytes_in: u64, bytes_out: u64, interval_secs: u32) {
-        if !self.seeded {
-            self.prev_in = bytes_in;
-            self.prev_out = bytes_out;
-            self.seeded = true;
-            return;
-        }
-
-        let elapsed = interval_secs.max(1) as f64;
-        let sample = Sample {
-            in_bps: bytes_in.saturating_sub(self.prev_in) as f64 / elapsed,
-            out_bps: bytes_out.saturating_sub(self.prev_out) as f64 / elapsed,
-        };
-        self.prev_in = bytes_in;
-        self.prev_out = bytes_out;
-
-        if self.samples.len() >= MAX_SAMPLES {
-            self.samples.pop_front();
-        }
-        self.samples.push_back(sample);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn samples(&self) -> &VecDeque<Sample> {
         &self.samples
     }
 
     pub(crate) fn reset(&mut self) {
         *self = Self::default();

---- chart::tests::push_caps_at_max_samples stdout ----

thread 'chart::tests::push_caps_at_max_samples' (30892) panicked at openvpn-mgmt-ui\src\chart.rs:293:9:
assertion `left == right` failed
  left: 0
 right: 60

---- chart::tests::push_second_sample_produces_one_point stdout ----

thread 'chart::tests::push_second_sample_produces_one_point' (31652) panicked at openvpn-mgmt-ui\src\chart.rs:280:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    chart::tests::push_caps_at_max_samples
    chart::tests::push_second_sample_produces_one_point

test result: FAILED. 22 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
