*** openvpn-mgmt-ui/src/chart.rs:98:69: replace / with * in ThroughputHistory::push

*** mutation diff:
--- openvpn-mgmt-ui/src/chart.rs
+++ replace / with * in ThroughputHistory::push
@@ -90,17 +90,17 @@
             self.prev_out = bytes_out;
             self.seeded = true;
             return;
         }
 
         let elapsed = interval_secs.max(1) as f64;
         let sample = Sample {
             in_bps: bytes_in.saturating_sub(self.prev_in) as f64 / elapsed,
-            out_bps: bytes_out.saturating_sub(self.prev_out) as f64 / elapsed,
+            out_bps: bytes_out.saturating_sub(self.prev_out) as f64 * /* ~ changed by cargo-mutants ~ */ elapsed,
         };
         self.prev_in = bytes_in;
         self.prev_out = bytes_out;
 
         if self.samples.len() >= MAX_SAMPLES {
             self.samples.pop_front();
         }
         self.samples.push_back(sample);

---- chart::tests::push_second_sample_produces_one_point stdout ----

thread 'chart::tests::push_second_sample_produces_one_point' (15676) panicked at openvpn-mgmt-ui\src\chart.rs:301:9:
assertion failed: (sample.out_bps - 2000.0).abs() < f64::EPSILON

failures:
    chart::tests::push_second_sample_produces_one_point

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
