*** openvpn-mgmt-ui/src/main.rs:605:25: delete field rate_out from struct DemoState expression in App::update

*** mutation diff:
--- openvpn-mgmt-ui/src/main.rs
+++ delete field rate_out from struct DemoState expression in App::update
@@ -597,17 +597,17 @@
 
             // -- Debug -----------------------------------------------------------
             #[cfg(debug_assertions)]
             Message::ToggleDemoChart => {
                 self.demo_chart = !self.demo_chart;
                 if self.demo_chart {
                     self.demo_state = DemoState {
                         rate_in: 200_000.0,
-                        rate_out: 80_000.0,
+                         /* ~ changed by cargo-mutants ~ */
                         ..DemoState::default()
                     };
                     self.throughput.reset();
                 }
             }
             #[cfg(debug_assertions)]
             Message::DemoChartTick => {
                 use rand::Rng;

*** result: Success
